Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/python3.po
Languages: ru

source: Porting to Python 3
ru: Портирование на Python 3

source: Django 1.5 is the first version of Django to support Python 3. The same code runs both on Python 2 (≥ 2.6.5) and Python 3 (≥ 3.2), thanks to the six_ compatibility layer.
ru: Django 1.5 -- это первая версия Django, поддерживающая Python 3. Ваш код может работать с обеими версиями Python: Python 2 (≥ 2.6.5) и Python 3 (≥ 3.2), благодаря приложению `six <http://pythonhosted.org/six/>`_.

source: This document is primarily targeted at authors of pluggable application who want to support both Python 2 and 3. It also describes guidelines that apply to Django's code.
ru: Этот документ предназначен в первую очередь для авторов повторно используемых (подключаемых) приложений, которые хотят обеспечить поддержку как Python 2, так и Python 3. Он также описывает принципы написания совместимого кода на Django.

source: Philosophy
ru: Философия

source: This document assumes that you are familiar with the changes between Python 2 and Python 3. If you aren't, read `Python's official porting guide`_ first. Refreshing your knowledge of unicode handling on Python 2 and 3 will help; the `Pragmatic Unicode`_ presentation is a good resource.
ru: Предполагается, что вы знакомы с отличиями версий Python 2 и 3. Если это не так, сначала прочтите `руководство по портированию <http://docs.python.org/3/howto/pyporting.html>`_. Также будет нелишним освежить ваши знания о строках unicode; хорошим способом сделать это является просмотр презентации `the Pragmatic Unicode presentation <http://nedbatchelder.com/text/unipain.html>`_.

source: Django uses the *Python 2/3 Compatible Source* strategy. Of course, you're free to chose another strategy for your own code, especially if you don't need to stay compatible with Python 2. But authors of pluggable applications are encouraged to use the same porting strategy as Django itself.
ru: Django придерживается стратегии использования совместимого кода. Конечно, вы можете избрать другой подход при написании вашего проекта, особенно в случае, если вам не нужна поддержка Python 2. Но авторам подключаемых приложений всё же рекомендуется придерживаться той же стратегии, что и Django.

source: Writing compatible code is much easier if you target Python ≥ 2.6. Django 1.5 introduces compatibility tools such as :mod:`django.utils.six`, which is a customized version of the :mod:`six module <six>`. For convenience, forwards-compatible aliases were introduced in Django 1.4.2. If your application takes advantage of these tools, it will require Django ≥ 1.4.2.
ru: Написание совместимого кода будет намного легче, если вы используете Python ≥ 2.6. Django 1.5 включает некоторые инструменты для совместимости приложений, такие как :mod:`six module <six>`. Для удобства, некоторые псевдонимы были включены уже в Django 1.4.2. Если ваше приложение использует эти инструменты, вам потребуется версия Django ≥ 1.4.2.

source: Obviously, writing compatible source code adds some overhead, and that can cause frustration. Django's developers have found that attempting to write Python 3 code that's compatible with Python 2 is much more rewarding than the opposite. Not only does that make your code more future-proof, but Python 3's advantages (like the saner string handling) start shining quickly. Dealing with Python 2 becomes a backwards compatibility requirement, and we as developers are used to dealing with such constraints.
ru: Очевидно, написание совместимого кода потребует дополнительных сил, что может привести к разочарованию. Разработчики Django обнаружили, что написание кода на Python 3, который был бы совместим с Python 2, всё же приносит больше пользы, чем наоборот. Это не только сделает ваш код более перспективным, но и сделает доступными преимущества Python 3 (такие как более разумная обработка строк). Работа с Python 2 требует обратной совместимости, и мы как разработчики уже привыкли иметь дело с подобными ограничениями.

source: Porting tools provided by Django are inspired by this philosophy, and it's reflected throughout this guide.
ru: Инструменты портирования, предоставляемые Django, соответствуют представленной философии и будут описаны в данной инструкции.

source: Porting tips
ru: Советы по портированию

source: Unicode literals
ru: Строки Unicode

source: This step consists in:
ru: Этот шаг заключается в следующем:

source: Adding ``from __future__ import unicode_literals`` at the top of your Python modules -- it's best to put it in each and every module, otherwise you'll keep checking the top of your files to see which mode is in effect;
ru: Добавление ``from __future__ import unicode_literals`` первой строкой в ваш модуль Python – будет лучше, если эта строка присутствует в каждом модуле, в противном случае вы должны проследить какой режим используется;

source: Removing the ``u`` prefix before unicode strings;
ru: Удаление префикса ``u`` перед строками unicode;

source: Adding a ``b`` prefix before bytestrings.
ru: Добавление префикса ``b`` перед байтовыми строками (bytestrings).

source: Performing these changes systematically guarantees backwards compatibility.
ru: Систематическое выполнение этого шага гарантирует обратную совместимость.

source: However, Django applications generally don't need bytestrings, since Django only exposes unicode interfaces to the programmer. Python 3 discourages using bytestrings, except for binary data or byte-oriented interfaces. Python 2 makes bytestrings and unicode strings effectively interchangeable, as long as they only contain ASCII data. Take advantage of this to use unicode strings wherever possible and avoid the ``b`` prefixes.
ru: Однако, в приложениях Django обычно не используются байтовые строки, поскольку Django предоставляет лишь интерфейс unicode для программистов. При использовании Python 3 не рекомендуется использовать байтовые строки, за исключением двоичных данных или байт-ориентированных интерфейсов. Python 2 делает байтовые строки и строки Unicode взаимозаменяемыми, если они содержат только ASCII данные. Воспользуйтесь этим, чтобы использовать строки Unicode там, где это возможно, и избежать добавления префиксов ``b``.

source: Python 2's ``u`` prefix is a syntax error in Python 3.2 but it will be allowed again in Python 3.3 thanks to :pep:`414`. Thus, this transformation is optional if you target Python ≥ 3.3. It's still recommended, per the "write Python 3 code" philosophy.
ru: Префикс ``u`` из Python 2 в версии Python 3.2 вызовет синтаксическую ошибку, но это будет исправлено в Python 3.3 благодаря :pep:`414`. Таким образом, это преобразование опционально в Python ≥ 3.3. Это всё ещё рекомендуется в философии Python 3 "write Python 3 code".

source: String handling
ru: Обработка строк

source: Django also contains several string related classes and functions in the :mod:`django.utils.encoding` and :mod:`django.utils.safestring` modules. Their names used the words ``str``, which doesn't mean the same thing in Python 2 and Python 3, and ``unicode``, which doesn't exist in Python 3. In order to avoid ambiguity and confusion these concepts were renamed ``bytes`` and ``text``.
ru: Django также содержит несколько связанных классов и функций в модулях :mod:`django.utils.encoding` и :mod:`django.utils.safestring`. Их имена используют тип ``str``, который неодинаков в Python 2 и Python 3, а также ``unicode``, которого попросту нет в Python 3. Для того, чтобы избежать неоднозначности и путаницы они были переименованы в ``bytes`` и ``text``.

source: Here are the name changes in :mod:`django.utils.encoding`:
ru: Это наименования, которые были изменены в :mod:`django.utils.encoding`:

source: Old name
ru: Прежнее имя

source: New name
ru: Новое имя

source: For backwards compatibility, the old names still work on Python 2. Under Python 3, ``smart_str`` is an alias for ``smart_text``.
ru: Для поддержания обратной совместимости прежние имена ещё работают на Python 2. В Python 3 ``smart_str`` является псевдонимом ``smart_text``.

source: For forwards compatibility, the new names work as of Django 1.4.2.
ru: Для обеспечения дальнейшей совместимости новые наименования работают как в Django 1.4.2.

source: :mod:`django.utils.encoding` was deeply refactored in Django 1.5 to provide a more consistent API. Check its documentation for more information.
ru: :mod:`django.utils.encoding` был очень сильно изменён в Django 1.5 для улучшения API. Просмотрите соответствующую документацию для получения более подробной информации.

source: :mod:`django.utils.safestring` is mostly used via the :func:`~django.utils.safestring.mark_safe` and :func:`~django.utils.safestring.mark_for_escaping` functions, which didn't change. In case you're using the internals, here are the name changes:
ru: :mod:`django.utils.safestring` в основном используется через :func:`~django.utils.safestring.mark_safe` и :func:`~django.utils.safestring.mark_for_escaping` функции, которые не изменились. В случае, если вы используете что-то иное, см. таблицу соответствий:

source: For backwards compatibility, the old names still work on Python 2. Under Python 3, ``EscapeString`` and ``SafeString`` are aliases for ``EscapeText`` and ``SafeText`` respectively.
ru: Для поддержания обратной совместимости прежние имена ещё работают на Python 2. В Python 3, ``EscapeString`` и ``SafeString`` являются псевдонимами для ``EscapeText`` и ``SafeText`` соответственно.

source: :meth:`~object.__str__` and ` __unicode__()`_ methods
ru: :meth:`~object.__str__` и ` __unicode__()`_ методы

source: In Python 2, the object model specifies :meth:`~object.__str__` and ` __unicode__()`_ methods. If these methods exist, they must return ``str`` (bytes) and ``unicode`` (text) respectively.
ru: В Python 2 модель объекта имеет :meth:`~object.__str__` и ` __unicode__()`_ методы. Если эти методы существуют, они должны вернуть ``str`` (байт) и ``unicode`` (строку) соответственно.

source: The ``print`` statement and the :class:`str` built-in call :meth:`~object.__str__` to determine the human-readable representation of an object. The ``unicode`` built-in calls ` __unicode__()`_ if it exists, and otherwise falls back to :meth:`~object.__str__` and decodes the result with the system encoding. Conversely, the :class:`~django.db.models.Model` base class automatically derives :meth:`~object.__str__` from ` __unicode__()`_ by encoding to UTF-8.
ru: Оператор ``print`` и :class:`str` вызовет встроенный метод :meth:`~object.__str__` для удобочитаемого представления объекта. ``unicode`` вызовет метод ` __unicode__()`_, если он существует, в противном случае вернёт метод :meth:`~object.__str__` и декодирует результат в соответствии с системными настройками. Базовый класс :class:`~django.db.models.Model` автоматически получит метод :meth:`~object.__str__` из ` __unicode__()`_ путем кодирования в UTF-8.

source: In Python 3, there's simply :meth:`~object.__str__`, which must return ``str`` (text).
ru: В python 3 есть объект :meth:`~object.__str__`, который должен вернуть ``str`` (строку текста).

source: (It is also possible to define :meth:`~object.__bytes__`, but Django application have little use for that method, because they hardly ever deal with ``bytes``.)
ru: (Также можно определить :meth:`~object.__bytes__`, но приложения Django практически не используют этот метод, потому что обычно не имеют дело с байтами.)

source: Django provides a simple way to define :meth:`~object.__str__` and ` __unicode__()`_ methods that work on Python 2 and 3: you must define a :meth:`~object.__str__` method returning text and to apply the :func:`~django.utils.encoding.python_2_unicode_compatible` decorator.
ru: Django предоставляет простой способ определить :meth:`~object.__str__` и ` __unicode__()`_ методы, которые работают на Python 2 и 3: необходимо определить метод :meth:`~object.__str__`, возвращающий текст и применить декоратор :func:`~django.utils.encoding.python_2_unicode_compatible`.

source: On Python 3, the decorator is a no-op. On Python 2, it defines appropriate ` __unicode__()`_ and :meth:`~object.__str__` methods (replacing the original :meth:`~object.__str__` method in the process). Here's an example::
ru: В Python 3, декоратор ничего не выполняет. В Python 2, он определяет соответствующие методы ` __unicode__()`_ и :meth:`~object.__str__` ( в процессе замены оригинального :meth:`~object.__str__`). Вот пример:

source: This technique is the best match for Django's porting philosophy.
ru: Этот метод является наиболее подходящим для портирования в стиле Django.

source: For forwards compatibility, this decorator is available as of Django 1.4.2.
ru: Для обеспечения дальнейшей совместимости этот декоратор доступен с версии Django 1.4.2.

source: Finally, note that :meth:`~object.__repr__` must return a ``str`` on all versions of Python.
ru: Наконец, отметим, что метод :meth:`~object.__repr__` должен возвращать ``str`` во всех версиях Python.

source: :class:`dict` and :class:`dict`-like classes
ru: :class:`dict` и :class:`dict`-like классы

source: :meth:`dict.keys`, :meth:`dict.items` and :meth:`dict.values` return lists in Python 2 and iterators in Python 3. :class:`~django.http.QueryDict` and the :class:`dict`-like classes defined in :mod:`django.utils.datastructures` behave likewise in Python 3.
ru: :meth:`dict.keys`, :meth:`dict.items` и :meth:`dict.values` возвращают списки в Python 2 и итераторы в Python 3. :class:`~django.http.QueryDict` и :class:`dict`-like классы, определенные в :mod:`django.utils.datastructures` ведут себя аналогично в Python 3.

source: six_ provides compatibility functions to work around this change: :func:`~six.iterkeys`, :func:`~six.iteritems`, and :func:`~six.itervalues`. It also contains an undocumented ``iterlists`` function that works well for ``django.utils.datastructures.MultiValueDict`` and its subclasses.
ru: `six <http://pythonhosted.org/six/>`_ предоставляет инструменты, учитывающие эти изменения: :func:`~six.iterkeys`, :func:`~six.iteritems` и :func:`~six.itervalues`. Вместе с Django поставляется недокументированная функция :func:`~django.utils.six.iterlists` для ``django.utils.datastructures.MultiValueDict`` и его подклассов.

source: :class:`~django.http.HttpRequest` and :class:`~django.http.HttpResponse` objects
ru: :class:`~django.http.HttpRequest` и :class:`~django.http.HttpResponse` объекты

source: According to :pep:`3333`:
ru: В соответствии с :pep:`3333`:

source: headers are always ``str`` objects,
ru: заголовки всегда являются строковыми объектами ( ``str`` objects),

source: input and output streams are always ``bytes`` objects.
ru: поток ввода и вывода всегда является объектом байтов (``bytes`` objects).

source: Specifically, :attr:`HttpResponse.content <django.http.HttpResponse.content>` contains ``bytes``, which may become an issue if you compare it with a ``str`` in your tests. The preferred solution is to rely on :meth:`~django.test.SimpleTestCase.assertContains` and :meth:`~django.test.SimpleTestCase.assertNotContains`. These methods accept a response and a unicode string as arguments.
ru: В частности, :attr:`HttpResponse.content <django.http.HttpResponse.content>` содержит ``bytes``, что может стать источником проблем, если вы сравните его со ``str`` в ваших тестах. Предпочтительное решение в таком случае: полагаться на :meth:`~django.test.TestCase.assertContains` и :meth:`~django.test.TestCase.assertNotContains`. Эти методы принимают ответ со строками unicode в качестве аргументов.

source: Coding guidelines
ru: Рекомендации по написанию кода

source: The following guidelines are enforced in Django's source code. They're also recommended for third-party application who follow the same porting strategy.
ru: Следующие рекомендации применяются в исходных кодах Django. Также они рекомендуются для сторонних приложений, которые следуют аналогичной стратегии портирования.

source: Syntax requirements
ru: Требования к синтаксису

source: Unicode
ru: Юникод (Unicode)

source: In Python 3, all strings are considered Unicode by default. The ``unicode`` type from Python 2 is called ``str`` in Python 3, and ``str`` becomes ``bytes``.
ru: В Python 3 все строки по-умолчанию считаются строками юникода. Тип ``unicode`` из Python 2 аналогичен ``str`` в Python 3, а тип ``str`` становится типом ``bytes``.

source: You mustn't use the ``u`` prefix before a unicode string literal because it's a syntax error in Python 3.2. You must prefix byte strings with ``b``.
ru: Вы не должны использовать префикс ``u`` перед строками юникода, поскольку подобный синтаксис вызовет ошибку в Python 3.2. И вы обязаны ставить префикс ``b`` перед объектом байта.

source: In order to enable the same behavior in Python 2, every module must import ``unicode_literals`` from ``__future__``::
ru: Чтобы в Python 2 появилось такое же поведение, всегда импортируйте в модулях ``unicode_literals`` из ``__future__``::

source: If you need a byte string literal under Python 2 and a unicode string literal under Python 3, use the :class:`str` builtin::
ru: Если вам нужны строки байтов в Python 2 и строки юникода в Python 3, используйте встроенную функцию :class:`str`::

source: In Python 3, there aren't any automatic conversions between ``str`` and ``bytes``, and the :mod:`codecs` module became more strict. :meth:`str.encode` always returns ``bytes``, and ``bytes.decode`` always returns ``str``. As a consequence, the following pattern is sometimes necessary::
ru: В Python 3, нет никаких автоматических преобразований между ``str`` и ``bytes``, а модуль :mod:`codecs` стал более строгим. Метод :meth:`str.decode` всегда возвращает тип ``bytes``, в свою очередь ``bytes.decode`` всегда возвращает тип ``str``. В следствие этого иногда может появиться такая необходимость::

source: Be cautious if you have to `index bytestrings`_.
ru: Будьте осторожны с `index bytestrings <http://docs.python.org/3/howto/pyporting.html#bytes-literals>`_.

source: Exceptions
ru: Исключения

source: When you capture exceptions, use the ``as`` keyword::
ru: При вызове исключения используйте в качестве ключевого слово ``as``::

source: This older syntax was removed in Python 3::
ru: Прежний синтаксис был удалён из Python 3::

source: The syntax to reraise an exception with a different traceback also changed. Use :func:`six.reraise`.
ru: Синтаксис повторного вызова исключений также подвергся изменениям. См. :func:`six.reraise`.

source: Magic methods
ru: Магические методы (Magic methods)

source: Use the patterns below to handle magic methods renamed in Python 3.
ru: Используйте шаблоны, данные ниже, для обработки магических методов, переименованных в Python 3.

source: Iterators
ru: Итераторы (Iterators)

source: Boolean evaluation
ru: Булевы выражения (Boolean evaluation)

source: Division
ru: Деление

source: Special methods are looked up on the class and not on the instance to reflect the behavior of the Python interpreter.
ru: Специальные методы ищутся в классе, а не в объекте.

source: Writing compatible code with six
ru: Написание совместимого кода с помощью six

source: six_ is the canonical compatibility library for supporting Python 2 and 3 in a single codebase. Read its documentation!
ru: `six <http://pythonhosted.org/six/>`_ является канонической библиотекой для одновременной поддержки Python 2 и 3. Ознакомьтесь с его документацией!

source: A :mod:`customized version of six <django.utils.six>` is bundled with Django as of version 1.4.2. You can import it as ``django.utils.six``.
ru: :mod:`Измененная версия six <django.utils.six>` входит в поставку Django начиная с версии 1.4.2. Вы можете импортировать его как ``django.utils.six``.

source: Here are the most common changes required to write compatible code.
ru: В нём учитываются наиболее распространенные изменения, что позволит написать совместимый код.

source: The ``basestring`` and ``unicode`` types were removed in Python 3, and the meaning of ``str`` changed. To test these types, use the following idioms::
ru: Типы ``basestring`` и ``unicode`` были удалены в Python 3, а метод ``str`` изменён. Для проверки этих типов, используйте следующие идиомы ::

source: Python ≥ 2.6 provides ``bytes`` as an alias for ``str``, so you don't need :data:`six.binary_type`.
ru: Python ≥ 2.6 предоставляет тип ``bytes`` как псевдоним типа ``str``, так что вам не нужен :data:`six.binary_type`.

source: ``long``
ru: Тип ``long``

source: The ``long`` type no longer exists in Python 3. ``1L`` is a syntax error. Use :data:`six.integer_types` check if a value is an integer or a long::
ru: Типа ``long`` больше не существует в Python 3. ``1L`` вызовет синтаксическую ошибку. Используйте :data:`six.integer_types`, чтобы проверить является ли число обычным целым или это число типа ``long``::

source: Moved modules
ru: Перемещённые модули

source: Some modules were renamed in Python 3. The ``django.utils.six.moves`` module (based on the :mod:`six.moves module <six.moves>`) provides a compatible location to import them.
ru: Некоторые модули были переименованы в Python 3. Модуль ``django.utils.six.moves``(на основе :mod:`six.moves module <six.moves>`) обеспечивает совместимость с ними и вы можете импортировать их.

source: If you need different code in Python 2 and Python 3, check :data:`six.PY2`::
ru: Для получения разного кода при использовании Python 2 и Python 3, проверьте :data:`six.PY2`::

source: This is a last resort solution when :mod:`six` doesn't provide an appropriate function.
ru: Это решение используется в крайнем случае, только когда :mod:`six` не может обеспечить необходимый функционал.

source: Django customized version of six
ru: Модифицированная версия six
