Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/glossary.po
Languages: ru

source: Glossary
ru: Глоссарий

source: concrete model
ru: конкретная(concrete) модель

source: A non-abstract (:attr:`abstract=False <django.db.models.Options.abstract>`) model.
ru: Не абстрактная (:attr:`abstract=False <django.db.models.Options.abstract>`) модель.

source: An attribute on a :term:`model`; a given field usually maps directly to a single database column.
ru: Атрибут модели (:term:`model`). Как правило соответствует одному полю в таблице базы данных

source: See :doc:`/topics/db/models`.
ru: См. :doc:`/topics/db/models`.

source: A higher-order :term:`view` function that provides an abstract/generic implementation of a common idiom or pattern found in view development.
ru: Высокоуровневое представление (:term:`view`). Используется для реализации схожего для нескольких представлений поведения и логики функционирования.

source: See :doc:`/topics/class-based-views/index`.
ru: См. :doc:`/topics/class-based-views/index`.

source: Models store your application's data.
ru: Модели служат для хранения данных, используемых вашим приложением.

source: "Model-template-view"; a software pattern, similar in style to MVC, but a better description of the way Django does things.
ru: "Модель-шаблон-представление" (англ. "Model-template-view") концепция проектирования программного обеспечения, схожая с MVC, однако является более приемлемой для описания логики работы Django.

source: See :ref:`the FAQ entry <faq-mtv>`.
ru: См. :ref:`ответ в FAQ <faq-mtv>`.

source: `Model-view-controller`__; a software pattern. Django :ref:`follows MVC to some extent <faq-mtv>`.
ru: "Модель-представление-контроллер" (англ. "Model-view-controller") концепция проектирования программного обеспечения. Разработка в Django :ref:`в определенной степени соответсвует<faq-mtv>` данной концепции.

source: A Python package -- i.e. a directory of code -- that contains all the settings for an instance of Django. This would include database configuration, Django-specific options and application-specific settings.
ru: Пакет Python, то есть директория с исходными кодами, настроенная для работы с Django - содержит параметры подключения к базе данных, конфигурацию конкретной версии Django и разрабатываемого приложения.

source: Also known as "managed attributes", and a feature of Python since version 2.2. This is a neat way to implement attributes whose usage resembles attribute access, but whose implementation uses method calls.
ru: Может именоваться как "управляемые атрибуты" (англ. "managed attributes") и появилось в языке Python начиная с версии 2.2. Это изящный способ реализации атрибутов. Использование свойств выглядит как обычное обращение к атрибутам, однако приводит к вызову метода.

source: See :class:`property`.
ru: См. :class:`property`.

source: An object representing some set of rows to be fetched from the database.
ru: Объект, представляющий некоторое множество строк, извлекаемых из базы данных.

source: See :doc:`/topics/db/queries`.
ru: См. :doc:`/topics/db/queries`.

source: A short label for something, containing only letters, numbers, underscores or hyphens. They're generally used in URLs. For example, in a typical blog entry URL:
ru: Короткая метка для чего-либо, содержащая только буквы, цифры, символы подчеркивания и дефисы. Обычно используются в URL. Например, в адресе:

source: the last bit (``spring``) is the slug.
ru: последний элемент (``spring``) - это и есть slug.

source: A chunk of text that acts as formatting for representing data. A template helps to abstract the presentation of data from the data itself.
ru: Фрагмент текста, определяющий правила форматирования при визуализации данных. Шаблон помогает отделить сами данные от их представления.

source: See :doc:`/topics/templates`.
ru: См. :doc:`/topics/templates`.

source: A function responsible for rendering a page.
ru: Функция, отвечающая за формирование веб-страницы.
