Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/1.3.6.po
Languages: ru

source: Django 1.3.6 release notes
ru: О релизе Django 1.3.6

source: *February 19, 2013*
ru: *19 февраля 2013*

source: Django 1.3.6 fixes four security issues present in previous Django releases in the 1.3 series.
ru: Django 1.3.6 исправляет 4 проблемы в ветке 1.3.

source: This is the sixth bugfix/security release in the Django 1.3 series.
ru: Это шестой патч в ветке Django 1.3.

source: Host header poisoning
ru: Опасный заголовок Host

source: For this reason, Django 1.3.6 adds a new setting, ``ALLOWED_HOSTS``, which should contain an explicit list of valid host/domain names for this site. A request with a Host header not matching an entry in this list will raise ``SuspiciousOperation`` if ``request.get_host()`` is called. For full details see the documentation for the :setting:`ALLOWED_HOSTS` setting.
ru: По этой причине в Django 1.3.6 добавлена новая настройка ``ALLOWED_HOSTS``, в котором должен быть явно указан список допустимых хостов для этого сайта.

source: The default value for this setting in Django 1.3.6 is ``['*']`` (matching any host), for backwards-compatibility, but we strongly encourage all sites to set a more restrictive value.
ru: Значением по умолчанию в Django 1.3.6 является ``['*']`` (любой хост). Это оставлено для обратной совместимости, но мы настоятельно рекомендуем ужесточить это условие.

source: This host validation is disabled when ``DEBUG`` is ``True`` or when running tests.
ru: Валидация хоста отключена, когда ``DEBUG`` установлен в ``True``, а также при запуске тестов.

source: XML deserialization
ru: Десериализация XML

source: The XML parser in the Python standard library is vulnerable to a number of attacks via external entities and entity expansion. Django uses this parser for deserializing XML-formatted database fixtures. The fixture deserializer is not intended for use with untrusted data, but in order to err on the side of safety in Django 1.3.6 the XML deserializer refuses to parse an XML document with a DTD (DOCTYPE definition), which closes off these attack avenues.
ru: XML-парсер в стандартной поставке Python уязвимы для ряда атак через внешние сущности и расширения. Django же использует его для десериализации фикстур БД. В принципе, в них не должно быть плохих данных, но мы решили перестраховаться и сделали невозможным атаки через это направление.

source: These issues in the Python standard library are CVE-2013-1664 and CVE-2013-1665. More information available `from the Python security team`_.
ru: Эти вопросы проходят под номерами CVE-2013-1664 и CVE-2013-1665 стандартной библиотеки. Подробнее можно посмотреть на `from the Python security team`_.

source: Django's XML serializer does not create documents with a DTD, so this should not cause any issues with the typical round-trip from ``dumpdata`` to ``loaddata``, but if you feed your own XML documents to the ``loaddata`` management command, you will need to ensure they do not contain a DTD.
ru: Сериализатор Django не создаёт DTD, так что это не должно быть проблемой при обычной загрузке восстановлении через ``dumpdata``/``loaddata``, однако если вы применяете сторонний XML через ``loaddata`` убедитесь, что он не содержит DTD.

source: Formset memory exhaustion
ru: Нехватка памяти для наборов форм

source: Previous versions of Django did not validate or limit the form-count data provided by the client in a formset's management form, making it possible to exhaust a server's available memory by forcing it to create very large numbers of forms.
ru: Предыдущие версии Django не проверяли и не ограничивали в размере наборы форм, делая возможным создание огромного их количества, что исчерпывало всю доступную память на сервере.

source: In Django 1.3.6, all formsets have a strictly-enforced maximum number of forms (1000 by default, though it can be set higher via the ``max_num`` formset factory argument).
ru: В Django 1.3.6 все наборы форм имеют ограничение в количестве оных (по умолчанию 1000, но это значение может быть увеличено через аргумент ``max_num``).

source: Admin history view information leakage
ru: Утечка истории посещения админки

source: In previous versions of Django, an admin user without change permission on a model could still view the unicode representation of instances via their admin history log. Django 1.3.6 now limits the admin history log view for an object to users with change permission for that model.
ru: В предыдущих версиях Django админ без права редактирования всё ещё мог видеть unicode представления объектов через историю. Теперь добавлено ограничение на просмотр лога.
