Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/static-files/index.po
Languages: ru

source: Managing static files (CSS, images)
ru: Работа со статическими файлами (CSS, изображения)

source: Websites generally need to serve additional files such as images, JavaScript, or CSS. In Django, we refer to these files as "static files". Django provides :mod:`django.contrib.staticfiles` to help you manage them.
ru: Веб-приложения обычно требуют различные дополнительные файлы для своей работы (изображения, CSS, Javascript и др.). В Django их принято называть "статическими файлами"(прим.пер. - или "статика"). Django предоставляет приложение :mod:`django.contrib.staticfiles` для работы с ними.

source: This page describes how you can serve these static files.
ru: Этот раздел описывает как работать с ними.

source: Configuring static files
ru: Настройка статики

source: Make sure that ``django.contrib.staticfiles`` is included in your :setting:`INSTALLED_APPS`.
ru: Убедитесь что ``django.contrib.staticfiles`` добавлено :setting:`INSTALLED_APPS`.

source: In your settings file, define :setting:`STATIC_URL`, for example::
ru: В настройках укажите :setting:`STATIC_URL`, например::

source: In your templates, either hardcode the url like ``/static/my_app/myexample.jpg`` or, preferably, use the :ttag:`static<staticfiles-static>` template tag to build the URL for the given relative path by using the configured :setting:`STATICFILES_STORAGE` storage (this makes it much easier when you want to switch to a content delivery network (CDN) for serving static files).
ru: В шаблоне или "захардкодьте" URL ``/static/my_app/myexample.jpg``, или лучше использовать тег :ttag:`static<staticfiles-static>` для генерация URL-а по указанному относительному пути с использованием бэкенда, указанного в :setting:`STATICFILES_STORAGE` (это позволяет легко перенести статические файлы на CDN).

source: Store your static files in a folder called ``static`` in your app. For example ``my_app/static/my_app/myimage.jpg``.
ru: Сохраните статические файлы в каталоге ``static`` вашего приложения. Например ``my_app/static/my_app/myimage.jpg``.

source: Serving the files
ru: Раздача файлов

source: In addition to these configuration steps, you'll also need to actually serve the static files.
ru: Кроме конфигурации, необходимо настроить раздачу статических файлов.

source: During development, if you use :mod:`django.contrib.staticfiles`, this will be done automatically by :djadmin:`runserver` when :setting:`DEBUG` is set to ``True`` (see :func:`django.contrib.staticfiles.views.serve`).
ru: При разработке, если вы используете :mod:`django.contrib.staticfiles`, это все происходит автоматически через :djadmin:`runserver`, при :setting:`DEBUG` равной ``True`` (смотрите :func:`django.contrib.staticfiles.views.serve`).

source: This method is **grossly inefficient** and probably **insecure**, so it is **unsuitable for production**.
ru: Потому что это представление **очень неэффективно** и, возможно, **небезопасно**. Оно предназначено только для разработки, и **не должно использоваться на боевом сервере**.

source: See :doc:`/howto/static-files/deployment` for proper strategies to serve static files in production environments.
ru: Способы раздачи статических файлов описаны в разделе :doc:`/howto/static-files/deployment`.

source: Your project will probably also have static assets that aren't tied to a particular app. In addition to using a ``static/`` directory inside your apps, you can define a list of directories (:setting:`STATICFILES_DIRS`) in your settings file where Django will also look for static files. For example::
ru: Ваш проект, возможно, будет содержать статические файлы, которые не относятся ни к одному из приложений. Настройка :setting:`STATICFILES_DIRS` указывает каталоги, которые проверяются на наличие статических файлов. По умолчанию эта настройка пустая. Например::

source: See the documentation for the :setting:`STATICFILES_FINDERS` setting for details on how ``staticfiles`` finds your files.
ru: Смотрите описание настройки :setting:`STATICFILES_FINDERS` чтобы узнать, как ``staticfiles`` находит файлы.

source: Static file namespacing
ru: Пространства имен для статических файлов

source: Now we *might* be able to get away with putting our static files directly in ``my_app/static/`` (rather than creating another ``my_app`` subdirectory), but it would actually be a bad idea. Django will use the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
ru: Вы *можете* добавлять статические файлы непосредственно в каталог ``my_app/static/`` (не создавая подкаталог ``my_app``), но это плохая идея. Django использует первый найденный по имени файл и, если у вас есть файлы с одинаковым названием в *разных* приложениях, Django не сможет использовать оба. Необходимо как-то указать, какой файл использовать, и самый простой способ -- это *пространство имен*. Просто положите их в каталог с названием приложения(``my_app/static/my_app``).

source: Serving static files during development.
ru: Раздача статических файлов при разработке.

source: If you use :mod:`django.contrib.staticfiles` as explained above, :djadmin:`runserver` will do this automatically when :setting:`DEBUG` is set to ``True``. If you don't have ``django.contrib.staticfiles`` in :setting:`INSTALLED_APPS`, you can still manually serve static files using the :func:`django.contrib.staticfiles.views.serve` view.
ru: Если вы используете :mod:`django.contrib.staticfiles` как описано ваше, :djadmin:`runserver` все сделает автоматически, если :setting:`DEBUG` равна ``True``. Если ``django.contrib.staticfiles`` не добавлено в :setting:`INSTALLED_APPS`, вы можете раздавать статические файлы используя представление :func:`django.contrib.staticfiles.views.serve`.

source: This is not suitable for production use! For some common deployment strategies, see :doc:`/howto/static-files/deployment`.
ru: Не используйте его на боевом сервере! Способы раздачи статических файлов описаны в разделе :doc:`/howto/static-files/deployment`.

source: For example, if your :setting:`STATIC_URL` is defined as ``/static/``, you can do this by adding the following snippet to your urls.py::
ru: Например, если :setting:`STATIC_URL` равна ``/static/``, вы можете добавить следующий код в ``urls.py``::

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``/static/``) and not a URL (e.g. ``http://static.example.com/``).
ru: Это представление работает только при включенной отладке и для локальных префиксов (например ``/static/``), а не полных URL-ов (e.g. ``http://static.example.com/``).

source: Also this helper function only serves the actual :setting:`STATIC_ROOT` folder; it doesn't perform static files discovery like :mod:`django.contrib.staticfiles`.
ru: Также эта функция раздает файлы из каталога :setting:`STATIC_ROOT` не выполняя поиск всех статических файлов, как это делает :mod:`django.contrib.staticfiles`.

source: Serving files uploaded by a user during development.
ru: Раздача файлов, загруженных пользователем, при разработке

source: During development, you can serve user-uploaded media files from :setting:`MEDIA_ROOT` using the :func:`django.contrib.staticfiles.views.serve` view.
ru: При разработке медиа файлы из :setting:`MEDIA_ROOT` можно раздавать используя представление :func:`django.contrib.staticfiles.views.serve`.

source: For example, if your :setting:`MEDIA_URL` is defined as ``/media/``, you can do this by adding the following snippet to your urls.py::
ru: Например, если :setting:`MEDIA_URL` равна ``/media/``, вы можете добавить следующий код в ``urls.py``::

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``/media/``) and not a URL (e.g. ``http://media.example.com/``).
ru: Это представление работает только при включенной отладке и для локальных префиксов (например ``/media/``), а не полных URL-ов (e.g. ``http://media.example.com/``).

source: Testing
ru: Тестирование

source: When running tests that use actual HTTP requests instead of the built-in testing client (i.e. when using the built-in :class:`LiveServerTestCase <django.test.LiveServerTestCase>`) the static assets need to be served along the rest of the content so the test environment reproduces the real one as faithfully as possible, but ``LiveServerTestCase`` has only very basic static file-serving functionality: It doesn't know about the finders feature of the ``staticfiles`` application and assumes the static content has already been collected under :setting:`STATIC_ROOT`.
ru: При выполнении тестов, которые отправляют действительные HTTP запросы вместо встроенного тестового клиента (то есть при использовании :class:`LiveServerTestCase <django.test.LiveServerTestCase>`), статические файлы должны быть доступны как и остальная часть контента, чтобы тестовое окружение было максимально близким к настоящему. Но ``LiveServerTestCase`` предоставляет минимальную поддержку раздачи статических файлов: не поддерживает различные возможности поиска файлов, которые предоставляет приложение ``staticfiles``, и предполагает, что все статические файлы уже собраны в :setting:`STATIC_ROOT`.

source: Because of this, ``staticfiles`` ships its own :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`, a subclass of the built-in one that has the ability to transparently serve all the assets during execution of these tests in a way very similar to what we get at development time with ``DEBUG = True``, i.e. without having to collect them using :djadmin:`collectstatic` first.
ru: Поэтому ``staticfiles`` предоставляет :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`, который работает с файлами аналогично серверу разработки при ``DEBUG = True``, то есть не требуя выполнения команды :djadmin:`collectstatic`.

source: :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase` is new in Django 1.7. Previously its functionality was provided by :class:`django.test.LiveServerTestCase`.
ru: :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase` добавлен в Django 1.7. В старых версиях эта функциональность была в :class:`django.test.LiveServerTestCase`.

source: Deployment
ru: Развертывание

source: :mod:`django.contrib.staticfiles` provides a convenience management command for gathering static files in a single directory so you can serve them easily.
ru: :mod:`django.contrib.staticfiles` предоставляет команду, чтобы собрать все статические файлы в одном каталоге.

source: Set the :setting:`STATIC_ROOT` setting to the directory from which you'd like to serve these files, for example::
ru: Укажите в :setting:`STATIC_ROOT` каталог, из которого будут раздаваться статические файлы, например::

source: Run the :djadmin:`collectstatic` management command::
ru: Выполните команду :djadmin:`collectstatic`::

source: This will copy all files from your static folders into the :setting:`STATIC_ROOT` directory.
ru: Она скопирует все статические файлы в каталоге :setting:`STATIC_ROOT`.

source: Use a web server of your choice to serve the files. :doc:`/howto/static-files/deployment` covers some common deployment strategies for static files.
ru: Используйте любой веб-сервер для раздачи этих файлов. Способы раздачи статических файлов описаны в разделе :doc:`/howto/static-files/deployment`.

source: Learn more
ru: Узнайте больше

source: This document has covered the basics and some common usage patterns. For complete details on all the settings, commands, template tags, and other pieces included in :mod:`django.contrib.staticfiles`, see :doc:`the staticfiles reference </ref/contrib/staticfiles>`.
ru: Этот документ описывает основные и самые распространенные практики. Подробности о настройках, командах, шаблонных тегах и других деталях, включая ``django.contrib.staticfiles``, смотрите :doc:`раздел о статических файлах </ref/contrib/staticfiles>`.
