Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/faq/contributing.po
Languages: ru

source: FAQ: Contributing code
ru: FAQ: участие в развитии Django

source: How can I get started contributing code to Django?
ru: Как начать оказывать содействие развитию проекта?

source: Thanks for asking! We've written an entire document devoted to this question. It's titled :doc:`Contributing to Django </internals/contributing/index>`.
ru: Спасибо вам за вашу заинтересованность! Данному вопросу посвящен отдельный документ :doc:`содействие развитию Django </internals/contributing/index>`.

source: I submitted a bug fix in the ticket system several weeks ago. Why are you ignoring my patch?
ru: Несколько недель назад я представил на рассмотрение свой вариант устранения ошибки. Почему вы игнорируете мое предложение?

source: Don't worry: We're not ignoring you!
ru: Не беспокойтесь! Мы вас не игнорируем.

source: It's important to understand there is a difference between "a ticket is being ignored" and "a ticket has not been attended to yet." Django's ticket system contains hundreds of open tickets, of various degrees of impact on end-user functionality, and Django's developers have to review and prioritize.
ru: Важно понимать разницу между двумя состояниями, в котором может находится ваше предложение: "игнорируется" и "еще не принято к рассмотрению". В системе обработки заявок, поступающих от пользователей, на рассмотрении находятся сотни предложений. Они различаются по степени влияния на функционал Django, предоставляемый конечным пользователям. Разработчики Django должны просмотреть и ранжировать по важности весь объем этих предложений.

source: On top of that: the people who work on Django are all volunteers. As a result, the amount of time that we have to work on the framework is limited and will vary from week to week depending on our spare time. If we're busy, we may not be able to spend as much time on Django as we might want.
ru: Кроме этого, нельзя упускать из виду тот факт, что люди, работающие над развитием Django, делают это по своей инициативе. В результате этого количество времени, отводимого нами на работу с фреймворком, ограничено и может различаться от недели к неделе, в зависимости от нашей загруженности. Если мы заняты, то на разработку Django приходится уделять не так много времени, сколько бы нам хотелось.

source: The best way to make sure tickets do not get hung up on the way to checkin is to make it dead easy, even for someone who may not be intimately familiar with that area of the code, to understand the problem and verify the fix:
ru: Лучший способ добиться того, чтобы ваше предложение не застряло на пути к рассмотрению - это сделать его предельно простым и понятным. Тогда любой участник, даже не слишком хорошо знакомый с конкретной частью кода, сможет понять суть проблемы и проверить корректность вашего предложения. Вот некоторые рекомендации на этот счет:

source: Are there clear instructions on how to reproduce the bug? If this touches a dependency (such as Pillow/PIL), a contrib module, or a specific database, are those instructions clear enough even for someone not familiar with it?
ru: Есть ли указания на то, при каких условиях возникает ошибка? Если появление ошибки связано с использованием библиотек Python (таких как Pillow/PIL), модулей Django, входящих в состав ``contrib``, или конкретной СУБД, то достаточно ли понятным является ваше описание?

source: If there are several patches attached to the ticket, is it clear what each one does, which ones can be ignored and which matter?
ru: Если в вашем предложении содержится несколько исправлений, то понятно ли назначение каждого из них в отдельности? Какие из них могут быть проигнорированы, а какие составляют суть вашего предложения?

source: Does the patch include a unit test? If not, is there a very clear explanation why not? A test expresses succinctly what the problem is, and shows that the patch actually fixes it.
ru: Содержит ли ваше исправление модульный тест? Если не содержит, то по какой причине? Тест лаконично отражает суть проблемы и свидетельствует о том, действительно ли ваше предложение исправляет эту ошибку.

source: If your patch stands no chance of inclusion in Django, we won't ignore it -- we'll just close the ticket. So if your ticket is still open, it doesn't mean we're ignoring you; it just means we haven't had time to look at it yet.
ru: Если ваше исправление не имеет шансов быть включенным в Django, мы не будет игнорировать его - мы просто закроем ваше предложение. Поэтому, если оно все еще находится в активном состоянии, то это не означает, что мы игнорируем его. Это значит всего лишь то, что у нас не было времени на его рассмотрение.

source: When and how might I remind the core team of a patch I care about?
ru: Когда и как я могу напомнить основной команде разработчиков об интересующем меня исправлении?

source: A polite, well-timed message to the mailing list is one way to get attention. To determine the right time, you need to keep an eye on the schedule. If you post your message when the core developers are trying to hit a feature deadline or manage a planning phase, you're not going to get the sort of attention you require. However, if you draw attention to a ticket when the core developers are paying particular attention to bugs -- just before a bug fixing sprint, or in the lead up to a beta release for example -- you're much more likely to get a productive response.
ru: Вежливое и своевременное сообщение в списке рассылки является одним из способов привлечь к себе внимание. Чтобы определить подходящее время, необходимо отслеживать график разработки. Если вы разместите ваше сообщение в то время, когда основные разработчики пытаются реализовать необходимые функции к установленному сроку или заняты планированием работы, то ваше обращение не удостоится желаемого внимания. Однако, если вы напомните о предложении в то время, когда основные разработчики заняты исправлением ошибок, вы имеете гораздо больше шансов получить продуктивный ответ.

source: Gentle IRC reminders can also work -- again, strategically timed if possible. During a bug sprint would be a very good time, for example.
ru: Ненавязчивые напоминания в IRC, также согласованные по времени с графиком разработки, могут принести результат. Например, период устранения ошибок может быть очень удачным временем для напоминания.

source: Another way to get traction is to pull several related tickets together. When the core developers sit down to fix a bug in an area they haven't touched for a while, it can take a few minutes to remember all the fine details of how that area of code works. If you collect several minor bug fixes together into a similarly themed group, you make an attractive target, as the cost of coming up to speed on an area of code can be spread over multiple tickets.
ru: Еще один способ привлечения внимания - собрать воедино несколько связанных предложений. Когда основные разработчики приступают к исправлению ошибок в области, с которой они не сталкивались некоторое время, несколько минут уходит на то, чтобы вспомнить все нюансы этой конкретной области. Объединение нескольких незначительных исправлений, относящихся к одной сфере, в группу - довольно хорошая идея. Время, затрачиваемое разработчиками на "погружение" в конкретную область, сокращается и позволяет обработать большее число предложений, затрагивающих эту область.

source: Please refrain from emailing core developers personally, or repeatedly raising the same issue over and over. This sort of behavior will not gain you any additional attention -- certainly not the attention that you need in order to get your pet bug addressed.
ru: Пожалуйста, воздержитесь от отправки электронных писем основным разработчикам лично или постоянного повторения одного и того же вопроса. Такое поведение не обеспечит вам какого-либо дополнительного внимания со стороны разработчиков и не будет способствовать рассмотрению вашего предложения.

source: But I've reminded you several times and you keep ignoring my patch!
ru: Но я уже несколько раз напоминал о своем предложении, а вы продолжаете игнорировать его!

source: Seriously - we're not ignoring you. If your patch stands no chance of inclusion in Django, we'll close the ticket. For all the other tickets, we need to prioritize our efforts, which means that some tickets will be addressed before others.
ru: Мы не игнорирует вас, в самом деле. Если ваше исправление не имеет никаких шансов на включение в Django, мы закроем его. Для всех остальных предложений, мы должны определить их важность. Это означает, что некоторые предложения будут рассмотрены раньше других.

source: One of the criteria that is used to prioritize bug fixes is the number of people that will likely be affected by a given bug. Bugs that have the potential to affect many people will generally get priority over those that are edge cases.
ru: Одним из критериев, используемых для ранжирования предложений, является количество пользователей, которые могут пострадать от конкретной ошибки. Ошибки, которые потенциально могут отрицательно сказаться для большого числа людей получают приоритет над теми, которые затрагивают незначительное количество пользователей.

source: Another reason that bugs might be ignored for while is if the bug is a symptom of a larger problem. While we can spend time writing, testing and applying lots of little patches, sometimes the right solution is to rebuild. If a rebuild or refactor of a particular component has been proposed or is underway, you may find that bugs affecting that component will not get as much attention. Again, this is just a matter of prioritizing scarce resources. By concentrating on the rebuild, we can close all the little bugs at once, and hopefully prevent other little bugs from appearing in the future.
ru: Другой причиной того, что ошибки могут игнорироваться в течение некоторого времени, является то, что они всего лишь свидетельствуют о более серьезной проблеме. Иногда, вместо того, чтобы тратить время на написание, тестирование и включение в состав Django множества небольших исправлений, правильным решением является изменение структуры на более глубоком уровне. Если рассматривается или уже реализуется решение по изменению или рефакторингу кода конкретного компонента Django, то вы можете обнаружить, что предложения по исправлению ошибок в этом компоненте не будут получать должного внимания. Опять же, это всего лишь вопрос распределения ограниченных ресурсов. Концентрируясь на изменении структуры, мы можем избавится от всех несущественных ошибок сразу, и, возможно, предотвратить появление их в будущем.

source: Whatever the reason, please keep in mind that while you may hit a particular bug regularly, it doesn't necessarily follow that every single Django user will hit the same bug. Different users use Django in different ways, stressing different parts of the code under different conditions. When we evaluate the relative priorities, we are generally trying to consider the needs of the entire community, not just the severity for one particular user. This doesn't mean that we think your problem is unimportant -- just that in the limited time we have available, we will always err on the side of making 10 people happy rather than making 1 person happy.
ru: Пожалуйста, имейте в виду, что вы регулярно можете встречать определенную ошибку, но из этого не обязательно следует, что каждый пользователь Django получает ту же самую ошибку. Разные пользователи используют Django по-разному, используя различные компоненты в различных условиях. При расстановке относительных приоритетов мы, как правило, пытаемся учесть потребности всего сообщества в целом, а не отдельных пользователей. Это не означает, что мы думаем будто ваше предложение несущественно. В условиях ограниченности имеющегося у нас времени, мы придерживаемся мнения, что лучше удовлетворить потребности 10 человек, а не одного конкретного.
