Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/faq/install.po
Languages: ru

source: FAQ: Installation
ru: FAQ: Установка

source: How do I get started?
ru: С чего начать?

source: Install Django (read the :doc:`installation guide </intro/install>`).
ru: Установка Django (согласно :doc:`installation guide </intro/install>`)

source: Walk through the :doc:`tutorial </intro/tutorial01>`.
ru: Прочитать :doc:`tutorial </intro/tutorial01>`.

source: Check out the rest of the :doc:`documentation </index>`, and `ask questions`_ if you run into trouble.
ru: Если зашли в тупик, то прочитайте :doc:`documentation </index>` или `ask questions`_.

source: What are Django's prerequisites?
ru: Что нужно для Django?

source: Django requires Python. See the table in the next question for the versions of Python that work with each version of Django. Other Python libraries may be required for some uses, but you'll receive an error about it as they're needed.
ru: Django требует установленного Python. Смотрите таблицу в следующем вопросе, чтобы узнать какие версии Python необходимы для каждой версии Django. Могут понадобится некоторые дополнительные библиотеки, вы получите ошибку в таком случае.

source: For a development environment -- if you just want to experiment with Django -- you don't need to have a separate Web server installed; Django comes with its own lightweight development server. For a production environment, Django follows the WSGI spec, :pep:`3333`, which means it can run on a variety of server platforms. See :doc:`Deploying Django </howto/deployment/index>` for some popular alternatives.
ru: Для разработки (если хотите только поэкспериментировать с Django) нет нужды устанавливать какой-либо веб-сервер; вместе с Django поставляется простой веб-сервер. В боевом окружении Django может быть запущен на множестве платформ, которые поддерживают WSGI (:pep:`3333`). Альтернативы можно найти в :doc:`Deploying Django </howto/deployment/index>`.

source: If you want to use Django with a database, which is probably the case, you'll also need a database engine. PostgreSQL_ is recommended, because we're PostgreSQL fans, and MySQL_, `SQLite 3`_, and Oracle_ are also supported.
ru: Для работы Django с базами данных вам понадобится сам движок. Мы рекомендуем PostgreSQL_, потому что он нам самим нравится, но также поддерживаются MySQL_, `SQLite 3`_ и Oracle_.

source: What Python version can I use with Django?
ru: Какие версии Python можно использовать с Django?

source: Django version
ru: Версия Django

source: Python versions
ru: Версия Python

source: For each version of Python, only the latest micro release (A.B.C) is officially supported. You can find the latest micro version for each series on the `Python download page <https://www.python.org/downloads/>`_.
ru: Для каждой версии Python, только последний микро-релиз (A.B.C) поддерживается официально. Последние релизы вы можете найти на `странице загрузок Python <https://www.python.org/downloads/>`_.

source: Typically, we will support a Python version up to and including the first Django LTS release whose security support ends after security support for that version of Python ends. For example, Python 3.3 security support ends September 2017 and Django 1.8 LTS security support ends April 2018. Therefore Django 1.8 is the last version to support Python 3.3.
ru: Обычно мы поддерживаем версию Python, срок поддержки которой заканчивается до срока поддержки Django LTS релиза. Например, поддержка Python 3.3 заканчивается в сентябре 2017, а поддержка Django 1.8 LTS заканчивается в апреле 2018. Следовательно Django 1.8 последняя версия, которая поддерживает Python 3.3.

source: What Python version should I use with Django?
ru: Какие версии Python можно использовать с Django?

source: As of Django 1.6, Python 3 support is considered stable and you can safely use it in production. See also :doc:`/topics/python3`. However, the community is still in the process of migrating third-party packages and applications to Python 3.
ru: Django 1.6 поддерживает Python 3 и вы можете использовать его в реальном проекте. Смотрите :doc:`/topics/python3`. Однако сообщество все еще в процессе миграции сторонних библиотек и приложений на Python 3.

source: If you're starting a new project, and the dependencies you plan to use work on Python 3, you should use Python 3. If they don't, consider contributing to the porting efforts, or stick to Python 2.
ru: Если вы начинаете новый проект и зависимые библиотеки поддерживают Python 3, вам следует использовать Python 3. Если нет, можно помочь в их переносе на Python 3, или использовать Python 2.

source: Since newer versions of Python are often faster, have more features, and are better supported, all else being equal, we recommend that you use the latest 2.x.y or 3.x.y release.
ru: Так как последние версии Python обычно быстрее, содержат больше возможностей и лучше поддерживаются, мы советуем использовать последние релизы 2.x.y или 3.x.y.

source: You don't lose anything in Django by using an older release, but you don't take advantage of the improvements and optimizations in newer Python releases. Third-party applications for use with Django are, of course, free to set their own version requirements.
ru: Вы ничего не потеряете используя Django со старой версией, но вы не получите улучшений и оптимизаций новых версий Python. Сторонние приложения Django могут иметь свою политику поддержки версий Python.

source: Should I use the stable version or development version?
ru: Использовать ли стабильную версию?

source: Generally, if you're using code in production, you should be using a stable release. The Django project publishes a full stable release every nine months or so, with bugfix updates in between. These stable releases contain the API that is covered by our backwards compatibility guarantees; if you write code against stable releases, you shouldn't have any problems upgrading when the next official version is released.
ru: Если ваш код уйдёт в продакшн, то используйте стабильную версию. Разработчики Django выпускают стабильный релиз примерно каждые девять месяцев, а уж мелкие исправления выходят постоянно. Стабильные релизы содержат API, которое обратно совместимо с предыдущими версиями, так что при обновлении на следующий стабильный релиз никаких проблем возникнуть не должно.
