Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/faq/models.po
Languages: ru

source: FAQ: Databases and models
ru: FAQ: Базы данных и модели

source: How can I see the raw SQL queries Django is running?
ru: Как посмотреть SQL, который генерирует Django?

source: Make sure your Django :setting:`DEBUG` setting is set to ``True``. Then, just do this::
ru: Установите :setting:`DEBUG` в ``True`` и проделайте следующее::

source: ``connection.queries`` is only available if :setting:`DEBUG` is ``True``. It's a list of dictionaries in order of query execution. Each dictionary has the following::
ru: ``connection.queries`` доступны только при включённой отладке. Это обычный словарь выполняемых запросов, каждый из которых содержит следующее::

source: If you are using :doc:`multiple databases</topics/db/multi-db>`, you can use the same interface on each member of the ``connections`` dictionary::
ru: Если вы используете :doc:`multiple databases</topics/db/multi-db>`, то для каждого словаря ``connections`` есть свои интерфейсы.

source: If you need to clear the query list manually at any point in your functions, just call ``reset_queries()``, like this::
ru: Для очистки списка запросов вручную вызовите ``reset_queries()``, например::

source: Can I use Django with a pre-existing database?
ru: Могу ли я использовать Django вместе с уже существующей БД?

source: Yes. See :doc:`Integrating with a legacy database </howto/legacy-databases>`.
ru: Да, подробнее здесь - :doc:`Integrating with a legacy database </howto/legacy-databases>`

source: If I make changes to a model, how do I update the database?
ru: После изменений в модели как обновить базу данных?

source: Take a look at Django's support for :mod:`schema migrations <django.db.migrations>`.
ru: Посмотрите на поддержку :mod:`миграций структуры данных <django.db.migrations>` в Django.

source: If you don't mind clearing data, your project's ``manage.py`` utility has a :djadmin:`flush` option to reset the database to the state it was in immediately after :djadmin:`migrate` was executed.
ru: Если вам не обязательно сохранять все данные, то для ``manage.py`` есть команда :djadmin:`flush`, которая сбрасывает состояние БД на момент непосредственно после выполнения :djadmin:`migrate`.

source: Do Django models support multiple-column primary keys?
ru: Поддерживает ли Django составные главные ключи?

source: No. Only single-column primary keys are supported.
ru: Нет, поддерживаются только главные ключи, состоящие из одного столбца.

source: But this isn't an issue in practice, because there's nothing stopping you from adding other constraints (using the ``unique_together`` model option or creating the constraint directly in your database), and enforcing the uniqueness at that level. Single-column primary keys are needed for things such as the admin interface to work; e.g., you need a simple way of being able to specify an object to edit or delete.
ru: На практике это не является проблемой, так как не мешает добавлению других ограничений (с использованием ключа ``unique_together`` в модели или условий в БД), обеспечив уникальность на этом уровне. Главный ключ из одного столбца нужен, например, для работы интерфейса администратора - должен быть простой способ определить объект для изменения или удаления.

source: Does Django support NoSQL databases?
ru: Django поддерживает NoSQL базы данных?

source: NoSQL databases are not officially supported by Django itself. There are, however, a number of side project and forks which allow NoSQL functionality in Django, like `Django non-rel`_.
ru: NoSQL базы данных официально не поддерживаются Django. Однако, есть сторонние проекты и форки, которые позволяют использовать NoSQL, например, `Django non-rel`_.

source: You can also take a look on `the wiki page`_ which discusses some alternatives.
ru: В `вики <https://code.djangoproject.com/wiki/NoSqlSupport>`_ можно найти обсуждение различных библиотек.

source: How do I add database-specific options to my CREATE TABLE statements, such as specifying MyISAM as the table type?
ru: Как добавить СУБД-специфичные опции (например, тип таблицы MyISAM) в выражение CREATE TABLE?

source: We try to avoid adding special cases in the Django code to accommodate all the database-specific options such as table type, etc. If you'd like to use any of these options, create a migration with a :class:`~django.db.migrations.operations.RunSQL` operation that contains ``ALTER TABLE`` statements that do what you want to do.
ru: Мы стараемся избегать добавления таких специфичных настроек в код Django. Если же это действительно нужно, создайте миграцию с :class:`~django.db.migrations.operations.RunSQL`, который будет содержать выражение ``ALTER TABLE`` для тонкой настройки.

source: For example, if you're using MySQL and want your tables to use the MyISAM table type, use the following SQL::
ru: Например, при использовании MySQL для указания типа таблицы MyISAM используйте следующий SQL::
