Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/class-based-views/generic-editing.po
Languages: ru

source: Form handling with class-based views
ru: Обработка форм в представлениях-классах

source: Form processing generally has 3 paths:
ru: Обработка форм осуществляется обычно в три этапа:

source: Initial GET (blank or prepopulated form)
ru: Инициализирующий GET запрос(пустая или частично проинициализированная форма)

source: POST with invalid data (typically redisplay form with errors)
ru: Запрос POST с неверными данными(обычно отображается форма с указанием ошибок)

source: POST with valid data (process the data and typically redirect)
ru: Запрос POST с корректными данными(обработка данных и , как правило, перенаправление)

source: Implementing this yourself often results in a lot of repeated boilerplate code (see :ref:`Using a form in a view<using-a-form-in-a-view>`). To help avoid this, Django provides a collection of generic class-based views for form processing.
ru: При самостоятельной реализации подобной обработки форм, вы сталкиваетесь с большим количеством повторяющегося "шаблонного" кода. (См. :ref:`использование форм в представлениях <using-a-form-in-a-view>`). Чтобы избавиться от этого, Django предоставляет нам коллекцию общих CBV для работы с формами.

source: Given a simple contact form:
ru: Рассмотрим простую контактную форму::

source: The view can be constructed using a ``FormView``:
ru: Представление можно создать используя класс ``FormView``::

source: Notes:
ru: Примечания:

source: FormView inherits :class:`~django.views.generic.base.TemplateResponseMixin` so :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` can be used here.
ru: FormView наследует :class:`~django.views.generic.base.TemplateResponseMixin`, таким образом вы можете использовать атрибут :attr:`~django.views.generic.base.TemplateResponseMixin.template_name`.

source: The default implementation for :meth:`~django.views.generic.edit.FormMixin.form_valid` simply redirects to the :attr:`~django.views.generic.edit.FormMixin.success_url`.
ru: Реализация по умолчанию для метода :meth:`~django.views.generic.edit.FormMixin.form_valid` просто осуществляет редирект на URL, хранящийся в атрибуте :attr:`~django.views.generic.edit.FormMixin.success_url`.

source: Generic views really shine when working with models. These generic views will automatically create a :class:`~django.forms.ModelForm`, so long as they can work out which model class to use:
ru: Общие CBV раскрываются во всей красе при работе с моделями. Они автоматически создают класс :class:`~django.forms.ModelForm` при работе с моделями:

source: If the :attr:`~django.views.generic.edit.ModelFormMixin.model` attribute is given, that model class will be used.
ru: Если указано значение атрибута :attr:`~django.views.generic.edit.ModelFormMixin.model`, то будет использоваться этот класс модели.

source: If :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()` returns an object, the class of that object will be used.
ru: Если метод :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()` возвращает объект, то будет использоваться класс этого объекта.

source: If a :attr:`~django.views.generic.detail.SingleObjectMixin.queryset` is given, the model for that queryset will be used.
ru: Если указан атрибут :attr:`~django.views.generic.detail.SingleObjectMixin.queryset`, то будет использована модель этого запроса(queryset).

source: Model form views provide a :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()` implementation that saves the model automatically. You can override this if you have any special requirements; see below for examples.
ru: Представления форм, связанные с моделями, предоставляют реализацию метода :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()`, которая автоматически сохраняет модель. Вы можете переопределить этот метод согласно вашим требованиям; смотрите примеры ниже.

source: You don't even need to provide a ``success_url`` for :class:`~django.views.generic.edit.CreateView` or :class:`~django.views.generic.edit.UpdateView` - they will use :meth:`~django.db.models.Model.get_absolute_url()` on the model object if available.
ru: Вы можете не устанавливать значение ``success_url`` для классов :class:`~django.views.generic.edit.CreateView` или :class:`~django.views.generic.edit.UpdateView` - они воспользуются методом :meth:`~django.db.models.Model.get_absolute_url()` объекта модели (если такой объект доступен).

source: If you want to use a custom :class:`~django.forms.ModelForm` (for instance to add extra validation) simply set :attr:`~django.views.generic.edit.FormMixin.form_class` on your view.
ru: Если вам необходимо специальное поведение для :class:`~django.forms.ModelForm` (например для дополнительной валидации данных) просто установите :attr:`~django.views.generic.edit.FormMixin.form_class` в нужное значение.

source: When specifying a custom form class, you must still specify the model, even though the :attr:`~django.views.generic.edit.FormMixin.form_class` may be a :class:`~django.forms.ModelForm`.
ru: При создании пользовательского класса формы, вы по прежнему должны указать модель. Даже в том случае если в :attr:`~django.views.generic.edit.FormMixin.form_class` используется :class:`~django.forms.ModelForm`.

source: First we need to add :meth:`~django.db.models.Model.get_absolute_url()` to our ``Author`` class:
ru: Во-первых, мы должны добавить метод :meth:`~django.db.models.Model.get_absolute_url()` в наш класс ``Author`` :

source: Then we can use :class:`CreateView` and friends to do the actual work. Notice how we're just configuring the generic class-based views here; we don't have to write any logic ourselves:
ru: Затем мы можем использовать класс :class:`CreateView` и "сотоварищей" чтобы выполнить необходимую работу. Обратите внимание, что мы лишь создаем конфигурацию для CBV; нам не нужно писать никакого кода, реализующего логику:

source: The ``fields`` attribute works the same way as the ``fields`` attribute on the inner ``Meta`` class on :class:`~django.forms.ModelForm`. Unless you define the form class in another way, the attribute is required and the view will raise an :exc:`~django.core.exceptions.ImproperlyConfigured` exception if it's not.
ru: Атрибут ``fields`` работает аналогично атрибуту ``fields`` внутреннего класса ``Meta`` :class:`~django.forms.ModelForm`. Если вы не указали класс формы другим способом, этот атрибут обязателен и вы получите исключение :exc:`~django.core.exceptions.ImproperlyConfigured`, если он не указан.

source: If you specify both the :attr:`~django.views.generic.edit.ModelFormMixin.fields` and :attr:`~django.views.generic.edit.FormMixin.form_class` attributes, an :exc:`~django.core.exceptions.ImproperlyConfigured` exception will be raised.
ru: Если вы указали и :attr:`~django.views.generic.edit.ModelFormMixin.fields` и :attr:`~django.views.generic.edit.FormMixin.form_class`, будет вызвано исключение :exc:`~django.core.exceptions.ImproperlyConfigured`.

source: Finally, we hook these new views into the URLconf:
ru: И наконец, мы подключаем новые представления в URLconf:

source: These views inherit :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin` which uses :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` to construct the :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` based on the model.
ru: Эти представления наследуют :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin`,который использует атрибут :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` для создания :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` с помощью имени модели.

source: In this example:
ru: В этом примере:

source: :class:`CreateView` and :class:`UpdateView` use ``myapp/author_form.html``
ru: Классы :class:`CreateView` и :class:`UpdateView` используют ``myapp/author_form.html``

source: :class:`DeleteView` uses ``myapp/author_confirm_delete.html``
ru: Классы :class:`DeleteView` используют ``myapp/author_confirm_delete.html``

source: If you wish to have separate templates for :class:`CreateView` and :class:`UpdateView`, you can set either :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` or :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` on your view class.
ru: Если вам нужно разделить шаблоны для классов :class:`CreateView` и :class:`UpdateView`, вы можете либо назначить атрибут :attr:`~django.views.generic.base.TemplateResponseMixin.template_name`, либо использовать :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` в ваших классах представлений.

source: To track the user that created an object using a :class:`CreateView`, you can use a custom :class:`~django.forms.ModelForm` to do this. First, add the foreign key relation to the model:
ru: Чтобы отслеживать пользователя, создавшего некий объект с помощью :class:`CreateView`, вы можете использовать пользовательский класс :class:`~django.forms.ModelForm`. Первое, добавьте внешний ключ (foreign key) к модели:

source: In the view, ensure that you don't include ``created_by`` in the list of fields to edit, and override :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()` to add the user:
ru: В представлении удостоверьтесь, что вы не включаете ``created_by`` в список редактируемых полей и переопределите метод :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()` для добавления пользователя:

source: Note that you'll need to :ref:`decorate this view<decorating-class-based-views>` using :func:`~django.contrib.auth.decorators.login_required`, or alternatively handle unauthorized users in the :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()`.
ru: Обратите внимание, что вам необходимо :ref:`задекорировать представление<decorating-class-based-views>` используя :func:`~django.contrib.auth.decorators.login_required`, или в качестве альтернативы, обрабатывать неавторизированных пользователей в методе :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()`.

source: AJAX example
ru: Пример с использованием AJAX

source: Here is a simple example showing how you might go about implementing a form that works for AJAX requests as well as 'normal' form POSTs::
ru: Вот простой пример, показывающий, как вы могли бы реализовать форму, которая работает и с запросами AJAX, и с "обычными" POST запросами формы::
