Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/class-based-views/index.po
Languages: ru

source: Class-based views
ru: Представления-классы (Class-based views, CBV)

source: A view is a callable which takes a request and returns a response. This can be more than just a function, and Django provides an example of some classes which can be used as views. These allow you to structure your views and reuse code by harnessing inheritance and mixins. There are also some generic views for simple tasks which we'll get to later, but you may want to design your own structure of reusable views which suits your use case. For full details, see the :doc:`class-based views reference documentation</ref/class-based-views/index>`.
ru: Представление, в самом общем виде, - это исполняемый(callable) объект, который принимает "на вход" запрос (request), и возвращает ответ(response). В этой роли может выступать не только функция, но и классы - и Django предоставляет нам такие классы и примеры их использования. Такие классы позволяют создавать структурированные, повторно используемые представления, базируясь на возможностях наследования и, в том числе, множественного наследования, - с использованием примесей(mixins). Django включает в себя набор общих(generic) представлений, которые идеально подходят для решения ряда рутинных задач(мы рассмотрим их позже). Ну и конечно, вы можете использовать существующие классы Django для создания собственных, расширяемых и повторно используемых представлений, которые будут полностью удовлетворять вашим потребностям. За более полной информацией обратитесь к :doc:`документация по классам-представлениям </ref/class-based-views/index>`.

source: Basic examples
ru: Простые примеры

source: Django provides base view classes which will suit a wide range of applications. All views inherit from the :class:`~django.views.generic.base.View` class, which handles linking the view in to the URLs, HTTP method dispatching and other simple features. :class:`~django.views.generic.base.RedirectView` is for a simple HTTP redirect, and :class:`~django.views.generic.base.TemplateView` extends the base class to make it also render a template.
ru: Django предлагает нам базовый набор классов представлений, который может использоваться в широком спектре приложений. Все классы-представления наследуют класс :class:`~django.views.generic.base.View`, который обрабатывает "привязку" представления с соответствующими URL, диспетчеризацию HTTP запросов(анализ методов GET, POST и последующий вызов одноименного метода для обработки запроса) и ряд других простых действий. Класс :class:`~django.views.generic.base.RedirectView` служит для простого HTTP перенаправления(redirect), а класс :class:`~django.views.generic.base.TemplateView` расширяет базовый класс, предоставляя возможность обработки шаблонов.

source: Simple usage in your URLconf
ru: Использование CBV в ваших URLconf

source: The simplest way to use generic views is to create them directly in your URLconf. If you're only changing a few simple attributes on a class-based view, you can simply pass them into the :meth:`~django.views.generic.base.View.as_view` method call itself::
ru: Самой простой (прим. пер. но не самый верный) способ использования общих классов-представлений, - это создание них непосредственно в вашем URLconf. Если переопределяете всего несколько простых атрибутов в классе-представлении, вы можете просто передать эти значения как аргументы метода :meth:`~django.views.generic.base.View.as_view`::

source: Any arguments passed to :meth:`~django.views.generic.base.View.as_view` will override attributes set on the class. In this example, we set ``template_name`` on the ``TemplateView``. A similar overriding pattern can be used for the ``url`` attribute on :class:`~django.views.generic.base.RedirectView`.
ru: Любые аргументы, переданные в :meth:`~django.views.generic.base.View.as_view` переопределят значения этих же аргументов, указанных в теле класса. В данном примере, мы назначаем атрибут ``template_name`` для класса ``TemplateView``. Такой же принцип может быть использован для переопределения атрибута ``url`` в классе :class:`~django.views.generic.base.RedirectView`.

source: Subclassing generic views
ru: Использование общих классов-представлений в наследовании

source: The second, more powerful way to use generic views is to inherit from an existing view and override attributes (such as the ``template_name``) or methods (such as ``get_context_data``) in your subclass to provide new values or methods. Consider, for example, a view that just displays one template, ``about.html``. Django has a generic view to do this - :class:`~django.views.generic.base.TemplateView` - so we can just subclass it, and override the template name::
ru: Второй, более мощный и гибкий способ использования общих CBV, это использование их в качестве родительских классов. Вы можете указать эти классы в качестве родительских для вашего пользовательского класса-представления и переопределить в теле вашего класса значения атрибутов (таких как ``template_name``) или методы (такие как ``get_context_data``), определив тем самым специфику его работы. Рассмотрим к примеру представление, которое просто отображает один шаблон , ``about.html``. Django предоставляет нам общий класс-представление :class:`~django.views.generic.base.TemplateView` для побобных задач - и все что нам надо сделать, - унаследовать этот класс в дочернем, пользовательском, классе и переопределить имя шаблона::

source: Then we just need to add this new view into our URLconf. `~django.views.generic.base.TemplateView` is a class, not a function, so we point the URL to the :meth:`~django.views.generic.base.View.as_view` class method instead, which provides a function-like entry to class-based views::
ru: Затем мы должны просто добавить это новое представление в наш URLconf. `~django.views.generic.base.TemplateView` - это класс, а не функция. Чтобы связать URL и функцию представления ( как это делается для "классических" представлений), мы используем специальный метод класса-представления :meth:`~django.views.generic.base.View.as_view`::

source: For more information on how to use the built in generic views, consult the next topic on :doc:`generic class based views</topics/class-based-views/generic-display>`.
ru: Для дополнительной информации по использованию общих(generic) представлений-классов, смотрите раздел :doc:`Общие классы-представления</topics/class-based-views/generic-display>`.

source: Supporting other HTTP methods
ru: Поддержка других методов HTTP

source: Suppose somebody wants to access our book library over HTTP using the views as an API. The API client would connect every now and then and download book data for the books published since last visit. But if no new books appeared since then, it is a waste of CPU time and bandwidth to fetch the books from the database, render a full response and send it to the client. It might be preferable to ask the API when the most recent book was published.
ru: Предположим, кто-то хочет получить доступ к списку книг в нашей библиотеке, используя для этого HTTP и наши представления в качестве API. Клиент, работающий с API, будет коннектиться к сайту и получать данные о книгах с момента последнего визита. Но если новых книг не появилось, то мы сталкиваемся с проблемой непродуктивного расходования времени CPU, создания ненужных запросов к БД: все это лишь с целью того, чтобы вернуть пользователю ответ, "что новых книг нет". Было бы предпочтительней перенести в API функцию, проверяющую наличие обновлений( дату появления последней новой книги).

source: We map the URL to book list view in the URLconf::
ru: В URLconf мы создаем отображение URL на представление, выводящее список книг::

source: And the view::
ru: И, собственно, само представление::

source: If the view is accessed from a ``GET`` request, a plain-and-simple object list is returned in the response (using ``book_list.html`` template). But if the client issues a ``HEAD`` request, the response has an empty body and the ``Last-Modified`` header indicates when the most recent book was published. Based on this information, the client may or may not download the full object list.
ru: Если представление выполняется "в контексте" ``GET`` запроса, то возвращается просто список объектов(используя шаблон ``book_list.html``). Но если клиент выполнит запрос с методом ``HEAD``, то ответ(response) будет иметь пустое тело и установленный в нужное значение заголовок ``Last-Modified``, хранящий дату последних изменений в нашей "библиотеке". Основываясь на этой информации, клиент должен принять решение, нужно ли ( или нет ) получить и скачать полный список объектов.

source: Decorating class-based views
ru: Декорирование представлений-классов

source: Since class-based views aren't functions, decorating them works differently depending on if you're using ``as_view`` or creating a subclass.
ru: Поскольку CBV представления это не функции, то их декорирование(decorating) реализуется по разному, в зависимости от того, используете ли вы метод ``as_view`` или создаете подклассы.

source: Decorating in URLconf
ru: Декорирование в URLconf

source: The simplest way of decorating class-based views is to decorate the result of the :meth:`~django.views.generic.base.View.as_view` method. The easiest place to do this is in the URLconf where you deploy your view::
ru: Наиболее простой способ использования декораторов с CBV, это задекорировать вызов метода :meth:`~django.views.generic.base.View.as_view`. В самом простом случае это можно сделать непосредственно в URLconf::

source: This approach applies the decorator on a per-instance basis. If you want every instance of a view to be decorated, you need to take a different approach.
ru: Такой метод позволяет применить декоратор только к одному экземпляру класса-представления. Если вам необходимо использовать декоратор "на уровне класса", чтобы он применялся к каждому экземпляру, - то необходимо использовать другой подход.

source: Decorating the class
ru: Декорирование класса

source: To decorate every instance of a class-based view, you need to decorate the class definition itself. To do this you apply the decorator to the :meth:`~django.views.generic.base.View.dispatch` method of the class.
ru: Чтобы применить декоратор к каждому экземпляру CBV, вам необходимо задекорировать само определение класса. Чтобы сделать это, вы должны применить декоратор к методу :meth:`~django.views.generic.base.View.dispatch` класса.

source: A method on a class isn't quite the same as a standalone function, so you can't just apply a function decorator to the method -- you need to transform it into a method decorator first. The ``method_decorator`` decorator transforms a function decorator into a method decorator so that it can be used on an instance method. For example::
ru: Метод класса, это не совсем тоже самое, что и обычная функция. Поэтому вы не можете просто использовать декоратор функции с методом класса - вы должны сперва преобразовать его в декоратор для метода класса. Декоратор ``method_decorator`` осуществляет такое преобразование, позволяя декорировать методы класса. Н-р::

source: In this example, every instance of ``ProtectedView`` will have login protection.
ru: В этом примере, каждый экземпляр ``ProtectedView`` будет осуществлять проверку прав доступа пользователя.

source: ``method_decorator`` passes ``*args`` and ``**kwargs`` as parameters to the decorated method on the class. If your method does not accept a compatible set of parameters it will raise a ``TypeError`` exception.
ru: ``method_decorator`` передает ``*args`` и ``**kwargs`` как параметры в декорируемый метод класса. Если ваш метод не принимает схожий тип параметров, будет сгенерировано исключение ``TypeError`` exception.
