Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/jython.po
Languages: ru

source: Running Django on Jython
ru: Запускаем Django на Jython

source: Jython_ is an implementation of Python that runs on the Java platform (JVM). This document will get you up and running with Django on top of Jython.
ru: Jython_ - реализация Python на платформе Java (JVM). Этот раздел поможет запустить Django на Jython.

source: Installing Jython
ru: Установка Jython

source: Creating a servlet container
ru: Создание сервлет-контейнера

source: If you just want to experiment with Django, skip ahead to the next section; Django includes a lightweight Web server you can use for testing, so you won't need to set up anything else until you're ready to deploy Django in production.
ru: Если вы хотите только поэкспериментировать с Django, пропустите следующую секцию; в Django включён лёгкий web-сервер для тестирования, таким образом нет необходимости ставить что-либо ещё, пока не нужно будет деплоить.

source: If you want to use Django on a production site, use a Java servlet container, such as `Apache Tomcat`_. Full JavaEE applications servers such as `GlassFish`_ or `JBoss`_ are also OK, if you need the extra features they include.
ru: Если вы хотите использовать Django в бою, используйте Java servlet-контейнер (например, `Apache Tomcat`_). Если вам нужны какие-то специфичные вещи, то можете использовать сервер приложений JavaEE (`GlassFish`_ or `JBoss`_).

source: Installing Django
ru: Установка Django

source: The next step is to install Django itself. This is exactly the same as installing Django on standard Python, so see :ref:`removing-old-versions-of-django` and :ref:`install-django-code` for instructions.
ru: Далее установим, собственно, Django. Всё делаем точно так же, как и при установке для обычного Python`а, подробнее можно посмотреть в :ref:`removing-old-versions-of-django` и :ref:`install-django-code`.

source: Installing Jython platform support libraries
ru: Установка библиотек для Jython

source: The `django-jython`_ project contains database backends and management commands for Django/Jython development. Note that the builtin Django backends won't work on top of Jython.
ru: Проект `django-jython`_ содержит обёртки для работы с базами данных, служебные команды для разработки Django/Jython. Обратите внимание, что обёртки Django под Python не будут работать под Jython.

source: Differences with Django on Jython
ru: Отличия Django на Jython

source: At this point, Django on Jython should behave nearly identically to Django running on standard Python. However, are a few differences to keep in mind:
ru: На данный момент Django на Python и на Juthon должны вести себя одинаково, однако несколько моментов всё-таки следует учитывать:

source: Remember to use the ``jython`` command instead of ``python``. The documentation uses ``python`` for consistency, but if you're using Jython you'll want to mentally replace ``python`` with ``jython`` every time it occurs.
ru: Не забывайте заменять ``python`` на ``jython`` при чтении документации.

source: Similarly, you'll need to use the ``JYTHONPATH`` environment variable instead of ``PYTHONPATH``.
ru: Используйте переменную окружения ``JYTHONPATH`` вместо ``PYTHONPATH``.

source: Any part of Django that requires `Pillow`_ will not work.
ru: Приложения Django, которые требуют `Pillow`_, не будут работать.
