Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/outputting-csv.po
Languages: ru

source: Outputting CSV with Django
ru: Генерация CSV на Django

source: This document explains how to output CSV (Comma Separated Values) dynamically using Django views. To do this, you can either use the Python CSV library or the Django template system.
ru: Здесь описывается как генерировать CSV (Comma Separated Values) с помощью представлений Django. Для этого нам понадобится библиотека для работы с CSV или шаблоны Django.

source: Using the Python CSV library
ru: Использование библиотеки для работы с CSV

source: Python comes with a CSV library, :mod:`csv`. The key to using it with Django is that the :mod:`csv` module's CSV-creation capability acts on file-like objects, and Django's :class:`~django.http.HttpResponse` objects are file-like objects.
ru: Python поставляется с библиотекой :mod:`csv`. Фишка в том, что этот модуль работает с файловыми объектами, которым как раз и является :class:`~django.http.HttpResponse`.

source: Here's an example::
ru: Пример::

source: The code and comments should be self-explanatory, but a few things deserve a mention:
ru: Код и комментарии должны быть понятны, но на некоторые вещи стоит обратить внимание:

source: The response gets a special MIME type, :mimetype:`text/csv`. This tells browsers that the document is a CSV file, rather than an HTML file. If you leave this off, browsers will probably interpret the output as HTML, which will result in ugly, scary gobbledygook in the browser window.
ru: Ответу устанавливается определённый тип :mimetype:`text/csv`, этим мы говорим браузеру, что передаём файл в формате CSV, а не HTML. Если этого не сделать, то браузер будет пытаться отобразить документ как HTML, что может испугать пользователя.

source: The response gets an additional ``Content-Disposition`` header, which contains the name of the CSV file. This filename is arbitrary; call it whatever you want. It'll be used by browsers in the "Save as..." dialog, etc.
ru: Ответ также имеет дополнительный заголовок ``Content-Disposition``, в котором содержится имя файла. Оно будет подставлено в окне сохранения файла и других случаях.

source: Hooking into the CSV-generation API is easy: Just pass ``response`` as the first argument to ``csv.writer``. The ``csv.writer`` function expects a file-like object, and :class:`~django.http.HttpResponse` objects fit the bill.
ru: Для генерации CSV просто передайте ``response`` первым аргументом в ``csv.writer``. Вообще, в ``csv.writer`` можно передавать любой файловый объект.

source: For each row in your CSV file, call ``writer.writerow``, passing it an iterable object such as a list or tuple.
ru: Для каждой строки в CSV файле вызовите ``writer.writerow``, передав итерируемый объект (список или кортеж).

source: The CSV module takes care of quoting for you, so you don't have to worry about escaping strings with quotes or commas in them. Just pass ``writerow()`` your raw strings, and it'll do the right thing.
ru: Модуль для работы с CSV сам умеет экранировать спецсимволы, так что просто передавайте в ``writerow()`` свои данные.

source: Streaming large CSV files
ru: Стриминг больших CSV файлов

source: When dealing with views that generate very large responses, you might want to consider using Django's :class:`~django.http.StreamingHttpResponse` instead. For example, by streaming a file that takes a long time to generate you can avoid a load balancer dropping a connection that might have otherwise timed out while the server was generating the response.
ru: При работе с представлениями, которые генерируют ответ с большим количеством данных, вам следует использовать :class:`~django.http.StreamingHttpResponse`. Стримя большой файл, можно избежать обрыва подключения по таймауту при использовании балансировщика нагрузки.

source: In this example, we make full use of Python generators to efficiently handle the assembly and transmission of a large CSV file::
ru: В этом примере мы используем генераторы Python для создания и передачи большого CSV файла::

source: Using the template system
ru: Использование шаблонов

source: Alternatively, you can use the :doc:`Django template system </topics/templates>` to generate CSV. This is lower-level than using the convenient Python :mod:`csv` module, but the solution is presented here for completeness.
ru: Однако, вы можете использовать :doc:`Django template system </topics/templates>` для генерации CSV. Это низкоуровневое решение представлено здесь для полноты картины.

source: The idea here is to pass a list of items to your template, and have the template output the commas in a :ttag:`for` loop.
ru: Суть в том, чтобы обработать список элементов вашим шаблоном и вывести в цикле с помощью, например, :ttag:`for`.

source: Here's an example, which generates the same CSV file as above::
ru: Ниже пример реализации::

source: The only difference between this example and the previous example is that this one uses template loading instead of the CSV module. The rest of the code -- such as the ``content_type='text/csv'`` -- is the same.
ru: Единственное отличие между этим примером и предыдущим состоит в том, что используется шаблон Django, а не модуль :mod:`csv`. Всё остальное, например ``content_type='text/csv'``, совпадает.

source: Then, create the template ``my_template_name.txt``, with this template code:
ru: Затем создайте шаблон ``my_template_name.txt`` со следующим кодом:

source: This template is quite basic. It just iterates over the given data and displays a line of CSV for each row. It uses the :tfilter:`addslashes` template filter to ensure there aren't any problems with quotes.
ru: Довольно примитивный шаблон. Он перебирает полученные данные и формирует строку CSV для каждого элемента. В нём используется фильтр :tfilter:`addslashes`, так что проблем с экранированием символов быть не должно.

source: Other text-based formats
ru: Остальные текстовые форматы

source: Notice that there isn't very much specific to CSV here -- just the specific output format. You can use either of these techniques to output any text-based format you can dream of. You can also use a similar technique to generate arbitrary binary data; see :doc:`/howto/outputting-pdf` for an example.
ru: Обратите внимание, что специфики именно CSV здесь нет. Подобным образом можно работать с остальными форматами: как текстовыми, так и бинарными (например, :doc:`/howto/outputting-pdf`).
