Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/install.po
Languages: ru

source: Quick install guide
ru: Быстрое руководство по установке

source: Before you can use Django, you'll need to get it installed. We have a :doc:`complete installation guide </topics/install>` that covers all the possibilities; this guide will guide you to a simple, minimal installation that'll work while you walk through the introduction.
ru: Для использования Django необходимо его установить. Документация содержит :doc:`полное руководство по установке </topics/install>`, этот раздел содержит описание быстрой установкой, которая подойдет для ознакомления с Django.

source: Install Python
ru: Установка Python

source: Being a Python Web framework, Django requires Python. See :ref:`faq-python-version-support` for details. Python includes a lightweight database called SQLite_ so you won't need to set up a database just yet.
ru: Будучи веб-фреймворком Python, Django требует Python. Подробности смотрите в :ref:`faq-python-version-support`. Эти версии Python содержат базу данных SQLite_, поэтому вам не обязательно устанавливать базу данных для ознакомления с Django.

source: Get the latest version of Python at https://www.python.org/download/ or with your operating system's package manager.
ru: Последнюю версию Python можно найти на https://www.python.org/download/, или установить его с помощью пакетного менеджера вашей операционной системы.

source: Django on Jython
ru: Django на Jython

source: If you use Jython_ (a Python implementation for the Java platform), you'll need to follow a few additional steps. See :doc:`/howto/jython` for details.
ru: Если вы используете Jython_ (реализация Python для Java платформы), необходимо выполнить дополнительные действия. Подробности смотрите в :doc:`/howto/jython`.

source: You can verify that Python is installed by typing ``python`` from your shell; you should see something like::
ru: Проверить установлен ли Python можно выполнив команду ``python`` в терминале, вы должны увидеть приблизительно следующее::

source: Set up a database
ru: Установка базы данных

source: This step is only necessary if you'd like to work with a "large" database engine like PostgreSQL, MySQL, or Oracle. To install such a database, consult the :ref:`database installation information <database-installation>`.
ru: Этот шаг необходим, если вы хотите использовать "большую" базу данных, такую как PostgreSQL, MySQL, или Oracle. Для установки этих баз данных, смотрите раздел про :ref:`настройку базы данных <database-installation>`.

source: Remove any old versions of Django
ru: Удалите старые версии Django

source: If you are upgrading your installation of Django from a previous version, you will need to :ref:`uninstall the old Django version before installing the new version <removing-old-versions-of-django>`.
ru: Если вы обновляете версию Django, вам следует :ref:`удалить старые версии Django перед установкой новой <removing-old-versions-of-django>`.

source: Install Django
ru: Установка Django

source: You've got three easy options to install Django:
ru: У вас есть варианта установки Django:

source: Install a version of Django :doc:`provided by your operating system distribution </misc/distributions>`. This is the quickest option for those who have operating systems that distribute Django.
ru: Установить версию Django :doc:`предоставленную дистрибутивом вашей операционной системой </misc/distributions>`. Это самый простой способ для операционных систем, дистрибутив которых содержит Django.

source: :ref:`Install an official release <installing-official-release>`. This is the best approach for most users.
ru: :ref:`Установить официальный релиз <installing-official-release>`. Это самый лучший вариант для большинства пользователей.

source: :ref:`Install the latest development version <installing-development-version>`. This option is for enthusiasts who want the latest-and-greatest features and aren't afraid of running brand new code. You might encounter new bugs in the development version, but reporting them helps the development of Django. Also, releases of third-party packages are less likely to be compatible with the development version than with the latest stable release.
ru: :ref:`Установить последнюю разрабатываемую версию <installing-development-version>`. Этот вариант для энтузиастов, которые хотят использовать самые последние возможности и не боятся использовать свежий код. Вы можете натолкнуться на баги в разрабатываемой версии, но уведомив нас о них поможет разрабатывать Django. Также, сторонние приложения скорее всего не будут совместимы с этой версией.

source: Always refer to the documentation that corresponds to the version of Django you're using!
ru: Всегда обращайтесь к документации той версии Django, которую вы используете!

source: If you do either of the first two steps, keep an eye out for parts of the documentation marked **new in development version**. That phrase flags features that are only available in development versions of Django, and they likely won't work with an official release.
ru: Если вы воспользовались одним из первых двух вариантов, обращайте внимание на пометки в документации **new in development version**. Это означает, что функционал доступен в текущей разрабатываемой версии Django и не доступен в официальной стабильной версии.

source: Verifying
ru: Проверка

source: To verify that Django can be seen by Python, type ``python`` from your shell. Then at the Python prompt, try to import Django:
ru: Чтобы проверить что Django доступен для Python, выполните ``python`` в терминале. Теперь в консоли Python выполните импорт Django::

source: You may have another version of Django installed.
ru: У вас может быть установлена другая версия Django.

source: That's it!
ru: Вот и все!

source: That's it -- you can now :doc:`move onto the tutorial </intro/tutorial01>`.
ru: Вот и все, вы можете переходить к :doc:`учебнику </intro/tutorial01>`.
