Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/reusable-apps.po
Languages: ru

source: Advanced tutorial: How to write reusable apps
ru: Углублённый материал: Как создать повторно применяемое приложение

source: This advanced tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off. We'll be turning our Web-poll into a standalone Python package you can reuse in new projects and share with other people.
ru: В продолжение :doc:`Части 6 </intro/tutorial05>` мы будем совершенствовать наше приложение Web-poll. Нам предстоит сделать настоящий пакет Python, который можно будет повторно использовать в новых проектах, а главное делиться им с другими разработчиками.

source: If you haven't recently completed Tutorials 1–6, we encourage you to review these so that your example project matches the one described below.
ru: Если вы новичок и все ещё не выполняли занятия с 1 по 6 часть, мы настоятельно рекомендуем сделать это. Весь дальнейший материал опирается на предыдущие главы.

source: Reusability matters
ru: Смысл многократного использования

source: It's a lot of work to design, build, test and maintain a web application. Many Python and Django projects share common problems. Wouldn't it be great if we could save some of this repeated work?
ru: Большая часть работы уходит на проектирование, сборку, тестирование и конечно же поддержку веб приложения/компонента. У многих Python и Django проектов существуют схожие задачи и проблемы. Вот было бы здорово не повторять однажды проделанную работу, а сохранить её и использовать в будущем. Не правда ли?

source: Reusability is the way of life in Python. `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ has a vast range of packages you can use in your own Python programs. Check out `Django Packages <https://www.djangopackages.com>`_ for existing reusable apps you could incorporate in your project. Django itself is also just a Python package. This means that you can take existing Python packages or Django apps and compose them into your own web project. You only need to write the parts that make your project unique.
ru: Многократное использование - часть философии Python. К примеру, для тех кто ещё не знает что такое `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ - это громадное хранилище пакетов которые вы можете использовать в собственных Python программах. Посетите `Django Packages <https://www.djangopackages.com>`_ и вы также увидите много приложений для Django, который были добавлены другими разработчиками. По-существу Django сам является обычным Python пакетом. Всё это означает простую истину: вы можете брать любые существующие решения(пакеты, не важно Python или Django) и использовать в своих проектах как угодно. Это даёт большое преимущество в скорости. Не надо придумывать то, что уже придумано другими, а значит можно посвятить всё время только разработке уникальной стороны своего проекта.

source: Let's say you were starting a new project that needed a polls app like the one we've been working on. How do you make this app reusable? Luckily, you're well on the way already. In :doc:`Tutorial 3 </intro/tutorial03>`, we saw how we could decouple polls from the project-level URLconf using an ``include``. In this tutorial, we'll take further steps to make the app easy to use in new projects and ready to publish for others to install and use.
ru: Скажем вы начали новый проект в котором используется приложение для голосования, подобно тому, которое мы разрабатывали в предыдущих уроках. Как же сделать наше приложение с голосованием многократно используемым и независимым от проекта к проекту? К счастью, мы уже на правильном пути и затрагивали эту тему в :doc:`3 части </intro/tutorial03>`. Тогда мы уже смогли отделить приложение для голосования от проекта при помощи URLconf, используя ``include``. В этом уроке мы продвинемся вперёд в решении этого вопроса. А именно, оформим приложение таким образом, чтобы его можно было легко подключать в наших новых проектах. А при желании приложение можно будет опубликовать, и тогда его смогут использовать и другие.

source: Package? App?
ru: Пакет? Приложение?

source: A Python `package <https://docs.python.org/tutorial/modules.html#packages>`_ provides a way of grouping related Python code for easy reuse. A package contains one or more files of Python code (also known as "modules").
ru: `Пакет в Python <https://docs.python.org/tutorial/modules.html#packages>`_ предоставляет способ группировать код Python для последующего повторного использования. Пакет содержит один или несколько файлов с кодом(также известны как "модули").

source: A package can be imported with ``import foo.bar`` or ``from foo import bar``. For a directory (like ``polls``) to form a package, it must contain a special file ``__init__.py``, even if this file is empty.
ru: Пакет может быть импортирован в ваш код так ``import foo.bar`` или так ``from foo import bar``. Для того, чтобы обычная директория (к примеру ``polls``) превратилась в пакет, обязательно создайте в этой директории файл ``__init__.py``. Этот файл может быть пустым.

source: A Django *application* is just a Python package that is specifically intended for use in a Django project. An application may use common Django conventions, such as having ``models``, ``tests``, ``urls``, and ``views`` submodules.
ru: *Приложение* (App) в Django является тоже пакетом Python. Только этот пакет адаптирован для использования с Django. Правила Django допускают включение в пакет таких модулей, как ``models``, ``tests``, ``urls`` и ``views``.

source: Later on we use the term *packaging* to describe the process of making a Python package easy for others to install. It can be a little confusing, we know.
ru: Позднее мы будем использовать термин *packaging* для описания процесса создания пакетов для Python.

source: Your project and your reusable app
ru: Ваш проект и ваши приложения

source: After the previous tutorials, our project should look like this::
ru: Если вы следовали нашим инструкциям из предыдущих частей урока, ваш каталог проекта должен иметь следующий вид::

source: You created ``mysite/templates`` in :doc:`Tutorial 2 </intro/tutorial02>`, and ``polls/templates`` in :doc:`Tutorial 3 </intro/tutorial03>`. Now perhaps it is clearer why we chose to have separate template directories for the project and application: everything that is part of the polls application is in ``polls``. It makes the application self-contained and easier to drop into a new project.
ru: Во :doc:`2 части урока </intro/tutorial02>` вы создали ``mysite/templates``. А в :doc:`3 части урока </intro/tutorial03>` вы создали ``polls/templates``. Сейчас вы поймёте почему мы решили создать отдельный каталог для проекта и отдельный каталог для приложения. Всё, что касается нашего приложения для голосования мы сохранили в каталоге ``polls`` таким образом, чтобы он был автономным. Вот теперь, при желании, этот каталог можно скопировать в наш новый проект. Кроме этого, не забудьте сделать две вещи в новом проекте: добавить название приложения в кортеж ``INSTALLED_APPS`` который находится в settings.py, а после этого выполнить в консоли команду ``./manage.py syncdb``

source: The ``polls`` directory could now be copied into a new Django project and immediately reused. It's not quite ready to be published though. For that, we need to package the app to make it easy for others to install.
ru: И хоть приложение сейчас можно переносить из проекта в проект, этого не хватает для того, чтобы делиться с другими. Требуется оформить наше приложение особым образом и запаковать его.

source: Installing some prerequisites
ru: Необходимые условия

source: The current state of Python packaging is a bit muddled with various tools. For this tutorial, we're going to use setuptools_ to build our package. It's the recommended packaging tool (merged with the ``distribute`` fork). We'll also be using `pip`_ to install and uninstall it. You should install these two packages now. If you need help, you can refer to :ref:`how to install Django with pip<installing-official-release>`. You can install ``setuptools`` the same way.
ru: Текущее состояние пакетов в Python немного запутано, содержит различные инструменты. В этом учебнике мы будем использовать setuptools_ для создания пакета. Это рекомендуемый инструмент для работы с пакетами (смерженый с форком ``distribute``). Для его установки необходим `pip`_. Установите эти два пакета. Доп. информацию можно получить по :ref:`как установить Django используя pip<installing-official-release>`. Вы можете установить ``setuptools`` аналогичным способом.

source: Packaging your app
ru: Создание пакета с вашим приложением

source: Python *packaging* refers to preparing your app in a specific format that can be easily installed and used. Django itself is packaged very much like this. For a small app like polls, this process isn't too difficult.
ru: *Пакеты* Python созданы для удобного распространения и установки ваших приложений. Django использует аналогичную систему. Для простых приложений, как голосование, это не сложно.

source: First, create a parent directory for ``polls``, outside of your Django project. Call this directory ``django-polls``.
ru: Первым делом создайте родительский каталог для ``polls`` вне вашего Django проекта. Назовите его ``django-polls``.

source: Choosing a name for your app
ru: Выбор название для вашего приложения

source: When choosing a name for your package, check resources like PyPI to avoid naming conflicts with existing packages. It's often useful to prepend ``django-`` to your module name when creating a package to distribute. This helps others looking for Django apps identify your app as Django specific.
ru: Выбирая название для вашего пакета, проверьте на PyPI нет ли уже пакета с таким названием. Рекомендуем добавлять префикс ``django-`` к названию пакета. Это поможет людям при поиске приложений для Django.

source: Application labels (that is, the final part of the dotted path to application packages) *must* be unique in :setting:`INSTALLED_APPS`. Avoid using the same label as any of the Django :doc:`contrib packages </ref/contrib/index>`, for example ``auth``, ``admin``, or ``messages``.
ru: Метка приложения (последняя часть пути к пакету приложения) *должна* быть уникальной в :setting:`INSTALLED_APPS`. Не используйте метки приложений Django из :doc:`contrib packages </ref/contrib/index>`, например, ``auth``, ``admin`` или ``messages``.

source: Move the ``polls`` directory into the ``django-polls`` directory.
ru: Перенесите каталог ``polls`` в ``django-polls``.

source: Create a file ``django-polls/README.rst`` with the following contents:
ru: Создайте файл ``django-polls/README.rst`` со следующим содержимым:

source: Create a ``django-polls/LICENSE`` file. Choosing a license is beyond the scope of this tutorial, but suffice it to say that code released publicly without a license is *useless*. Django and many Django-compatible apps are distributed under the BSD license; however, you're free to pick your own license. Just be aware that your licensing choice will affect who is able to use your code.
ru: Создайте файл ``django-polls/LICENSE``. Выбор лицензии не будет рассматриваться в этом разделе, но помните, что пакет без лицензии *бесполезен* для сообщества. Django и большое количество Django-приложений распространяются под BSD лицензией, но вы можете выбрать любую другую лицензию.

source: Next we'll create a ``setup.py`` file which provides details about how to build and install the app. A full explanation of this file is beyond the scope of this tutorial, but the `setuptools docs <http://pythonhosted.org/setuptools/setuptools.html>`_ have a good explanation. Create a file ``django-polls/setup.py`` with the following contents:
ru: Теперь создадим файл ``setup.py``, который укажет процесс установки нашего приложения. Мы не будем описывать в деталях его содержимое, их вы можете найти в `документации setuptools <http://pythonhosted.org/setuptools/setuptools.html>`_. Создайте ``django-polls/setup.py`` со следующим содержимым:

source: Only Python modules and packages are included in the package by default. To include additional files, we'll need to create a ``MANIFEST.in`` file. The setuptools docs referred to in the previous step discuss this file in more details. To include the templates, the ``README.rst`` and our ``LICENSE`` file, create a file ``django-polls/MANIFEST.in`` with the following contents:
ru: Только модули и пакеты Python добавляются в пакет по умолчанию. Чтобы добавить другие файлы, необходимо создать файл ``MANIFEST.in``. Документация setuptools содержит подробное описание этого файла. Чтобы указать добавление ``README.rst`` и ``LICENSE`` файлов, создайте ``django-polls/MANIFEST.in`` со следующим содержимым:

source: It's optional, but recommended, to include detailed documentation with your app. Create an empty directory ``django-polls/docs`` for future documentation. Add an additional line to ``django-polls/MANIFEST.in``::
ru: Не обязательно, но мы рекомендуем, добавлять документацию приложения. Создайте пустой каталог ``django-polls/docs`` для будущей документации. Добавьте еще одну строку в ``django-polls/MANIFEST.in``::

source: Note that the ``docs`` directory won't be included in your package unless you add some files to it. Many Django apps also provide their documentation online through sites like `readthedocs.org <https://readthedocs.org>`_.
ru: Обратите внимание, каталог ``docs`` не будет включен в пакет, пока вы не добавите в него хотя бы один файл. Многие приложения Django также предоставляют документацию онлайн через такие сайты, как `readthedocs.org <http://readthedocs.org>`_.

source: Try building your package with ``python setup.py sdist`` (run from inside ``django-polls``). This creates a directory called ``dist`` and builds your new package, ``django-polls-0.1.tar.gz``.
ru: Теперь попробуйте собрать ваш пакет выполнив ``python setup.py sdist`` (запустите в каталоге ``django-polls``). Эта команда создаст каталог ``dist`` и соберет ваш новый пакет, ``django-polls-0.1.tar.gz``.

source: For more information on packaging, see Python's `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/en/latest/distributing.html>`_.
ru: Подробности о пакетах можно найти в `The Hitchhiker's Guide to Packaging <https://packaging.python.org/en/latest/distributing.html>`_.

source: Using your own package
ru: Использование ваших пакетов

source: Since we moved the ``polls`` directory out of the project, it's no longer working. We'll now fix this by installing our new ``django-polls`` package.
ru: Т.к. каталог ``polls`` был перенесен с каталога проекта, он перестал работать. Исправим это установив пакет ``django-polls``.

source: Installing as a user library
ru: Устанавливаем как библиотеку пользователя

source: The following steps install ``django-polls`` as a user library. Per-user installs have a lot of advantages over installing the package system-wide, such as being usable on systems where you don't have administrator access as well as preventing the package from affecting system services and other users of the machine.
ru: Инструкция описывает как установить ``django-polls`` как библиотеку пользователя. Это лучше, чем устанавливать как системный пакет, таким образом он не влияет на системные сервисы и других пользователей, и позволяет установить пакеты без прав администратора.

source: Note that per-user installations can still affect the behavior of system tools that run as that user, so ``virtualenv`` is a more robust solution (see below).
ru: Но такая установка влияет на системные приложения запущенные этим пользователем, ``virtualenv`` более надежный инструмент (смотрите ниже).

source: To install the package, use pip (you already :ref:`installed it <installing-reusable-apps-prerequisites>`, right?)::
ru: Для установки пакета используйте pip (вы уже :ref:`установили его <installing-reusable-apps-prerequisites>`, правда?)::

source: With luck, your Django project should now work correctly again. Run the server again to confirm this.
ru: Теперь ваш Django проект должен работать. Запустите сервер для проверки.

source: To uninstall the package, use pip::
ru: Для удаления пакета используйте pip::

source: Publishing your app
ru: Распространение вашего пакета

source: Now that we've packaged and tested ``django-polls``, it's ready to share with the world! If this wasn't just an example, you could now:
ru: Теперь, когда мы создали пакет и проверили его работоспособность, можно поделиться ним с сообществом Django! Если бы это был не просто пример, вы бы могли:

source: Email the package to a friend.
ru: Отправить пакет друзьям электронной почтой.

source: Post the package on a public repository, such as `the Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ has `a good tutorial <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ for doing this.
ru: Отправить пакет в публичный репозиторий, такой как `The Python Package Index (PyPI) <https://packaging.python.org>`_. `Это руководство <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ поможет вам.

source: Installing Python packages with virtualenv
ru: Установка пакетов Python с использованием virtualenv

source: Earlier, we installed the polls app as a user library. This has some disadvantages:
ru: Раньше мы устанавливали пакет как библиотеку пользователя. В этом есть некоторые недостатки:

source: Modifying the user libraries can affect other Python software on your system.
ru: Изменение таких библиотек влияет на другие программы написанные на Python.

source: You won't be able to run multiple versions of this package (or others with the same name).
ru: Вы не сможете использовать разные версии пакета (или пакеты с одинаковым названием).

source: Typically, these situations only arise once you're maintaining several Django projects. When they do, the best solution is to use `virtualenv <http://www.virtualenv.org/>`_. This tool allows you to maintain multiple isolated Python environments, each with its own copy of the libraries and package namespace.
ru: Обычно такое происходит при работе над несколькими Django проектами. В таком случае лучше всего использовать `virtualenv <http://www.virtualenv.org/>`_. Этот инструмент позволяет использовать независимые Python окружения, каждое со своими пакетами.
