Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial05.po
Languages: ru

source: Writing your first Django app, part 5
ru: Создаём своё первое приложение с Django, часть 5

source: This tutorial begins where :doc:`Tutorial 4 </intro/tutorial04>` left off. We've built a Web-poll application, and we'll now create some automated tests for it.
ru: Продолжаем начатое в :doc:`четвёртой части </intro/tutorial04>`. Мы создали веб-приложение для опросов, теперь надо создать несколько автоматизированных тестов для него.

source: Introducing automated testing
ru: Введение в автоматизированное тестирование

source: What are automated tests?
ru: Что такое автоматизированные тесты?

source: Tests are simple routines that check the operation of your code.
ru: По своей сути тесты -- простые задачи, который проверяют работу вашего кода.

source: Testing operates at different levels. Some tests might apply to a tiny detail (*does a particular model method return values as expected?*) while others examine the overall operation of the software (*does a sequence of user inputs on the site produce the desired result?*). That's no different from the kind of testing you did earlier in :doc:`Tutorial 2 </intro/tutorial02>`, using the :djadmin:`shell` to examine the behavior of a method, or running the application and entering data to check how it behaves.
ru: Тесты разделяются по уровням. Некоторые проверяют мелкие детали - *этот метод возвращает то, что я ожидаю?*, другие более глобальны - *эта последовательность ввода пользователя приведёт к ожидаемому результату?*. Нет никакой разницы как тестировать: через :djadmin:`shell` (как показано в :doc:`Части 2 </intro/tutorial02>`) или через приложение, которое само вводит данные.

source: What's different in *automated* tests is that the testing work is done for you by the system. You create a set of tests once, and then as you make changes to your app, you can check that your code still works as you originally intended, without having to perform time consuming manual testing.
ru: Отличие *автоматизированных* тестов заключается в том, что вся работа выполняется за вас системой. Вы один раз создаёте набор тестов, а затем, внеся некоторые изменения в код приложения, вы можете проверить, осталось ли приложение работоспособным в целом, без муторной ручной проверки.

source: Why you need to create tests
ru: Зачем вам нужны тесты

source: So why create tests, and why now?
ru: Так зачем создавать тесты и зачем прямо сейчас?

source: You may feel that you have quite enough on your plate just learning Python/Django, and having yet another thing to learn and do may seem overwhelming and perhaps unnecessary. After all, our polls application is working quite happily now; going through the trouble of creating automated tests is not going to make it work any better. If creating the polls application is the last bit of Django programming you will ever do, then true, you don't need to know how to create automated tests. But, if that's not the case, now is an excellent time to learn.
ru: Может сложиться впечатление, что вы уже освоили Python/Django и изучение ещё каких-то вещей может быть ненужным. После того, как мы завершили разработку веб-приложения для проведения опроса (и оно даже работает!), написание тестов не сделает его лучше. Если эти уроки - последнее, что вы изучали по Django, то тесты вам действительно не нужны, в ином случае приступим к изучению.

source: Tests will save you time
ru: Тесты сэкономят ваше время

source: Up to a certain point, 'checking that it seems to work' will be a satisfactory test. In a more sophisticated application, you might have dozens of complex interactions between components.
ru: До определённого момента проверки 'оно всё ещё работает' будет достаточно, однако чем больше приложение, тем больше и сложнее будут связи между компонентами.

source: A change in any of those components could have unexpected consequences on the application's behavior. Checking that it still 'seems to work' could mean running through your code's functionality with twenty different variations of your test data just to make sure you haven't broken something - not a good use of your time.
ru: Изменения в любом из этих компонентов могут привести к неожиданным последствиям. Проверка в стиле 'похоже, оно всё ещё работает' может обернуться беглой проверкой выполнения вашего кода с двенадцатью различными вариациями тестовых данных, чтобы убедиться, что ничего не сломалось. Время можно потратить и с большей пользой.

source: That's especially true when automated tests could do this for you in seconds. If something's gone wrong, tests will also assist in identifying the code that's causing the unexpected behavior.
ru: Особенно важно, что автоматизированные тесты могут сделать это за секунды. Если же что-то пойдёт не так, тесты также помогут найти какая именно часть кода приводит к неожиданному поведению приложения.

source: Sometimes it may seem a chore to tear yourself away from your productive, creative programming work to face the unglamorous and unexciting business of writing tests, particularly when you know your code is working properly.
ru: Иногда это может выглядеть как случайный повод, чтобы не заниматься по-настоящему продуктивным творческим программированием вместо неблагодарного и неинтересного дела по написанию тестов, особенно, когда вы точно знаете, что ваш код и так работает правильно.

source: However, the task of writing tests is a lot more fulfilling than spending hours testing your application manually or trying to identify the cause of a newly-introduced problem.
ru: Тем не менее, задача по написанию тестов значительно более плодотворна, чем пустая трата часов ручного труда по поиску причин вновь возникших проблем в коде.

source: Tests don't just identify problems, they prevent them
ru: Тесты не находят проблемы, они их предотвращают

source: It's a mistake to think of tests merely as a negative aspect of development.
ru: Будет ошибкой считать написание тестов негативной стороной разработки.

source: Without tests, the purpose or intended behavior of an application might be rather opaque. Even when it's your own code, you will sometimes find yourself poking around in it trying to find out what exactly it's doing.
ru: Без тестов цель и поведение приложения может быть совсем не прозрачным. Даже если это ваш код, вы можете часами биться над ошибкой, не понимая откуда она взялась.

source: Tests change that; they light up your code from the inside, and when something goes wrong, they focus light on the part that has gone wrong - *even if you hadn't even realized it had gone wrong*.
ru: С тестами такого не произойдёт. Они подсвечивают код изнутри, и если что-то пошло не так, они обратят на это ваше внимание - *даже если не видно, что что-то сломалось*.

source: Tests make your code more attractive
ru: Тесты делают код более привлекательным

source: You might have created a brilliant piece of software, but you will find that many other developers will simply refuse to look at it because it lacks tests; without tests, they won't trust it. Jacob Kaplan-Moss, one of Django's original developers, says "Code without tests is broken by design."
ru: Возможно, вы написали отличный кусок кода, однако многие разработчики могут отказаться с ним работать из-за того, что к нему нет тестов - они не будут доверять ему. Яков Каплан-Мос (один из разработчиков Django) говорит: "Код без тестов нарушает дизайн".

source: That other developers want to see tests in your software before they take it seriously is yet another reason for you to start writing tests.
ru: То, что другие разработчики хотят видеть тесты в вашей программе для того, чтобы воспринимать её всерьёз - ещё одна причина, чтобы начать писать тесты.

source: Tests help teams work together
ru: Тесты упрощают совместную работу

source: The previous points are written from the point of view of a single developer maintaining an application. Complex applications will be maintained by teams. Tests guarantee that colleagues don't inadvertently break your code (and that you don't break theirs without knowing). If you want to make a living as a Django programmer, you must be good at writing tests!
ru: Предыдущие пункты написаны с точки зрения одиночной разработки приложения. Сложные приложения разрабатываются командами. Тесты гарантируют, что коллеги ненароком не поломают ваш код, а вы их, даже не узнав об этом. Если вы хотите зарабатывать на жизнь в качестве разработчика на Django, вы обязаны быть хороши в написании тестов!

source: Basic testing strategies
ru: Базовые стратегии тестирования

source: There are many ways to approach writing tests.
ru: Есть много подходов к написанию тестов.

source: Some programmers follow a discipline called "`test-driven development`_"; they actually write their tests before they write their code. This might seem counter-intuitive, but in fact it's similar to what most people will often do anyway: they describe a problem, then create some code to solve it. Test-driven development simply formalizes the problem in a Python test case.
ru: Некоторые программисты следуют дисциплине называемой "`test-driven development`_"; они, на самом деле, сначала пишут тесты, прежде чем писать код. Это может показаться нелогичным, но, на самом деле это похоже на то, что большинство людей будут часто делать в любом случае: они описывают проблемы, а затем создают код, чтобы решить эту проблему. Разработка через тестирование просто формализует задачу в конкретном тесте.

source: More often, a newcomer to testing will create some code and later decide that it should have some tests. Perhaps it would have been better to write some tests earlier, but it's never too late to get started.
ru: Чаще всего новичок сначала пишет код, а потом тесты. Возможно, было бы лучше делать наоборот, но никогда не поздно дописать тесты.

source: Sometimes it's difficult to figure out where to get started with writing tests. If you have written several thousand lines of Python, choosing something to test might not be easy. In such a case, it's fruitful to write your first test the next time you make a change, either when you add a new feature or fix a bug.
ru: Иногда трудно понять откуда начать написание тестов. Если вы уже написали несколько тысяч строк кода Python, выбор чего-нибудь для теста может быть непростым. В таком случае, довольно плодотворным будет написать ваш первый тест в следующий раз, когда вы внесёте изменения, добавите новую функцию или исправите баг.

source: So let's do that right away.
ru: Давайте приступим!

source: Writing our first test
ru: Создаем наш первый тест

source: We identify a bug
ru: Мы нашли ошибку

source: Fortunately, there's a little bug in the ``polls`` application for us to fix right away: the ``Question.was_published_recently()`` method returns ``True`` if the ``Question`` was published within the last day (which is correct) but also if the ``Question``’s ``pub_date`` field is in the future (which certainly isn't).
ru: К счастью, в нашем приложении есть небольшой баг, пригодный для исправления прямо сейчас: метод ``Question.was_published_recently()`` возвращает ``True``, если ``Question`` был опубликован в последние сутки (что верно), но также если в поле ``pub_date`` стоит дата в будущем (что неверно).

source: To check if the bug really exists, using the Admin create a question whose date lies in the future and check the method using the :djadmin:`shell`::
ru: Это можно увидеть в админке: создайте вопрос будущей датой и проверьте метод, используя :djadmin:`shell`::

source: Since things in the future are not 'recent', this is clearly wrong.
ru: Так как будущее - не 'недавно', то это явная ошибка.

source: Create a test to expose the bug
ru: Создадим тест на эту ошибку

source: What we've just done in the :djadmin:`shell` to test for the problem is exactly what we can do in an automated test, so let's turn that into an automated test.
ru: То, что сделали в :djadmin:`shell` по сути повторяется в автоматизированном тесте, так что приступим.

source: A conventional place for an application's tests is in the application's ``tests.py`` file; the testing system will automatically find tests in any file whose name begins with ``test``.
ru: Лучшее место для тестов приложения - в файле ``tests.py`` - система будет искать тесты во всех файлах, название которых начинается на ``test``.

source: Put the following in the ``tests.py`` file in the ``polls`` application:
ru: Скопируйте следующий код в файл ``tests.py`` в каталог приложения ``polls``:

source: What we have done here is created a :class:`django.test.TestCase` subclass with a method that creates a ``Question`` instance with a ``pub_date`` in the future. We then check the output of ``was_published_recently()`` - which *ought* to be False.
ru: Здесь мы унаследовались от :class:`django.test.TestCase` и добавили метод, который создаёт экземпляр ``Question`` со значением ``pub_date`` в будущем. Затем проверяем результат выполнения ``was_published_recently()`` - который *должен быть* False.

source: Running tests
ru: Выполнение тестов

source: In the terminal, we can run our test::
ru: Для запуска тестов в консоли::

source: and you'll see something like::
ru: и вы увидите следующее::

source: What happened is this:
ru: Вот что случилось:

source: ``python manage.py test polls`` looked for tests in the ``polls`` application
ru: ``python manage.py test polls`` ищет тесты в каталоге приложения ``polls``

source: it found a subclass of the :class:`django.test.TestCase` class
ru: находит класс, который наследуется от :class:`django.test.TestCase`

source: it created a special database for the purpose of testing
ru: создаёт специальную базу данных для тестирования

source: it looked for test methods - ones whose names begin with ``test``
ru: ищет тестовые методы - они должны начинаться с ``test``

source: in ``test_was_published_recently_with_future_question`` it created a ``Question`` instance whose ``pub_date`` field is 30 days in the future
ru: в методе ``test_was_published_recently_with_future_question`` создаётся экземпляр ``Question`` с ``pub_date`` в далёком будущем (аж на 30 дней)

source: ... and using the ``assertIs()`` method, it discovered that its ``was_published_recently()`` returns ``True``, though we wanted it to return ``False``
ru: ... и с помощью метода ``assertIs()`` проверяется что вернул ``was_published_recently()``. Вернулось ``True``, а мы указали, что хотим ``False``

source: The test informs us which test failed and even the line on which the failure occurred.
ru: Далее идёт информация, какой тест не прошёл и на какой строчке возникло расхождение.

source: Fixing the bug
ru: Исправление ошибки

source: We already know what the problem is: ``Question.was_published_recently()`` should return ``False`` if its ``pub_date`` is in the future. Amend the method in ``models.py``, so that it will only return ``True`` if the date is also in the past:
ru: Мы уже знаем, что проблема в ``Question.was_published_recently()``: он должен вернуть ``False``, если ``pub_date`` находится в будущем. Дополним метод в ``models.py`` проверкой - возвращать ``True`` только если дата в прошлом:

source: and run the test again::
ru: и заново запустим::

source: After identifying a bug, we wrote a test that exposes it and corrected the bug in the code so our test passes.
ru: После того, как ошибка была выявлена, мы написали тест, который выявил и исправил ошибку в коде, поэтому наш тест был пройден успешно.

source: Many other things might go wrong with our application in the future, but we can be sure that we won't inadvertently reintroduce this bug, because simply running the test will warn us immediately. We can consider this little portion of the application pinned down safely forever.
ru: Много где ещё могут быть ошибки, но только не в этом месте, потому что простой запуск тестов немедленно нас об этом предупредит. Можно рассматривать этот маленький кусок кода как гарантию работы нашего приложения.

source: More comprehensive tests
ru: Более подробные тесты

source: While we're here, we can further pin down the ``was_published_recently()`` method; in fact, it would be positively embarrassing if in fixing one bug we had introduced another.
ru: Пока мы здесь, помучаем ещё метод ``was_published_recently()``; действительно, как-то нехорошо при исправлении ошибки создавать другую.

source: Add two more test methods to the same class, to test the behavior of the method more comprehensively:
ru: Добавим ещё тестов для полноты проверки поведения метода:

source: And now we have three tests that confirm that ``Question.was_published_recently()`` returns sensible values for past, recent, and future questions.
ru: Теперь у нас есть 3 метода, которые проверяют, что ``Question.was_published_recently()`` возвращает ожидаемое значение для опросов в далёком прошлом, недавних и будущих.

source: Again, ``polls`` is a simple application, but however complex it grows in the future and whatever other code it interacts with, we now have some guarantee that the method we have written tests for will behave in expected ways.
ru: ``polls`` - простое приложение, но каким бы сложным оно не стало в будущем, мы будем уверены, что этот метод будет возвращать ожидаемое значение.

source: Test a view
ru: Тестируем представление

source: The polls application is fairly undiscriminating: it will publish any question, including ones whose ``pub_date`` field lies in the future. We should improve this. Setting a ``pub_date`` in the future should mean that the Question is published at that moment, but invisible until then.
ru: Наше приложение довольно неразборчивое - оно публикует даже те вопросы, которые запланированы в будущем. Давайте это исправим. Значение ``pub_date`` в будущем должно означать, что до этого времени вопрос должен оставаться невидимым.

source: A test for a view
ru: Тесты для представления

source: When we fixed the bug above, we wrote the test first and then the code to fix it. In fact that was a simple example of test-driven development, but it doesn't really matter in which order we do the work.
ru: Когда мы исправляли ошибку выше, мы писали тест, а затем код. Это самый простой пример разработки через тестирование, но на самом деле нет разницы в каком порядке будут проделаны эти действия.

source: In our first test, we focused closely on the internal behavior of the code. For this test, we want to check its behavior as it would be experienced by a user through a web browser.
ru: В нашем первом тесте мы фокусировались на коде функции. Сейчас же мы проверим поведение как если бы пользователь использовал наше приложение через браузер.

source: Before we try to fix anything, let's have a look at the tools at our disposal.
ru: Прежде чем мы попытаемся исправить что-либо, давайте взглянем на инструменты, которые есть в нашем распоряжении.

source: The Django test client
ru: Клиент для тестирования Django

source: Django provides a test :class:`~django.test.Client` to simulate a user interacting with the code at the view level. We can use it in ``tests.py`` or even in the :djadmin:`shell`.
ru: Django предоставляет класс для тестов :class:`~django.test.Client` для эмуляции пользовательских действий на уровне представления. Мы можем использовать его в ``tests.py`` или в :djadmin:`shell`.

source: We will start again with the :djadmin:`shell`, where we need to do a couple of things that won't be necessary in ``tests.py``. The first is to set up the test environment in the :djadmin:`shell`::
ru: Давайте начнем снова с :djadmin:`shell`, где мы должны сделать несколько вещей, которые не нужны в ``tests.py``. Сначала проинициализируем тестовую среду в :djadmin:`shell`::

source: :meth:`~django.test.utils.setup_test_environment` installs a template renderer which will allow us to examine some additional attributes on responses such as ``response.context`` that otherwise wouldn't be available. Note that this method *does not* setup a test database, so the following will be run against the existing database and the output may differ slightly depending on what questions you already created. You might get unexpected results if your ``TIME_ZONE`` in ``settings.py`` isn't correct. If you don't remember setting it earlier, check it before continuing.
ru: :meth:`~django.test.utils.setup_test_environment` инициализирует шаблон, который позволяет обращаться к некоторым дополнительным атрибутам, например, ``response.context``. Обратите внимание, что этот метод *не настраивает* базу данных, так что мы будем обращаться к реальным данным, и вывод может отличаться в зависимости от того, что там содержится. Вы можете получить неожиданный результат, если ``TIME_ZONE`` в ``settings.py`` указана не верно. Если вы не установили эту настройку, проверьте перед тем, как продолжить.

source: Next we need to import the test client class (later in ``tests.py`` we will use the :class:`django.test.TestCase` class, which comes with its own client, so this won't be required)::
ru: Далее нужно импортировать класс тестового клиента (позже в ``tests.py`` мы будем использовать :class:`django.test.TestCase`, который поставляется со своим клиентом)::

source: With that ready, we can ask the client to do some work for us::
ru: Теперь мы готовы для запуска::

source: Improving our view
ru: Улучшим наше представление

source: The list of polls shows polls that aren't published yet (i.e. those that have a ``pub_date`` in the future). Let's fix that.
ru: В список опросов попали и те, которые ещё не должны быть опубликованы (у которых ``pub_date`` в будущем). Исправим это.

source: In :doc:`Tutorial 4 </intro/tutorial04>` we introduced a class-based view, based on :class:`~django.views.generic.list.ListView`:
ru: В :doc:`четвёртой части </intro/tutorial04>` мы унаследовались от :class:`~django.views.generic.list.ListView`:

source: We need to amend the ``get_queryset()`` method and change it so that it also checks the date by comparing it with ``timezone.now()``. First we need to add an import:
ru: Нам нужно изменить метод ``get_queryset()`` так, чтобы он сравнивал дату опроса с ``timezone.now()``. Сначала добавим импорт:

source: and then we must amend the ``get_queryset`` method like so:
ru: далее изменим существующую функцию ``get_queryset`` на:

source: ``Question.objects.filter(pub_date__lte=timezone.now())`` returns a queryset containing ``Question``\s whose ``pub_date`` is less than or equal to - that is, earlier than or equal to - ``timezone.now``.
ru: ``Question.objects.filter(pub_date__lte=timezone.now())`` возвращает набор данных, содержащий те вопросы, у которых ``pub_date`` меньше или равна ``timezone.now``.

source: Testing our new view
ru: Тестирование нового представления

source: Now you can satisfy yourself that this behaves as expected by firing up the runserver, loading the site in your browser, creating ``Questions`` with dates in the past and future, and checking that only those that have been published are listed. You don't want to have to do that *every single time you make any change that might affect this* - so let's also create a test, based on our :djadmin:`shell` session above.
ru: Теперь поведение такое, как и задумывалось. Проверим это: запустим runserver, загрузим сайт, создадим ``Questions`` с датами в прошлом и будущем и убедимся, что видны только даты в прошлом. Но проделывать это вручную каждый раз накладно - давайте напишем тест, который будет выполнять такую последовательность действий.

source: Add the following to ``polls/tests.py``:
ru: Добавим следующий код в ``polls/tests.py``:

source: and we'll create a shortcut function to create questions as well as a new test class:
ru: и мы создадим метод-фабрику для создания опросов как новый тестовый класс:

source: Let's look at some of these more closely.
ru: Давайте подробнее разберём некоторые моменты.
