Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial05.po
Languages: ru

source: First is a question shortcut function, ``create_question``, to take some repetition out of the process of creating questions.
ru: Первый блок - это метод-фабрика ``create_question``, который воспроизводит некоторые действия при создании опроса.

source: ``test_no_questions`` doesn't create any questions, but checks the message: "No polls are available." and verifies the ``latest_question_list`` is empty. Note that the :class:`django.test.TestCase` class provides some additional assertion methods. In these examples, we use :meth:`~django.test.SimpleTestCase.assertContains()` and :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.
ru: ``test_no_questions`` не создаёт никаких вопросов, но проверяет вывод сообщения "No polls are available." и ``latest_question_list`` на отсутствие содержимого. Обратите внимание, что :class:`django.test.TestCase` использует дополнительные методы для проверки утверждений: :meth:`~django.test.SimpleTestCase.assertContains()` и :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.

source: In ``test_past_question``, we create a question and verify that it appears in the list.
ru: В ``test_past_question`` мы создали опрос и убедились, что он попал в список.

source: In ``test_future_question``, we create a question with a ``pub_date`` in the future. The database is reset for each test method, so the first question is no longer there, and so again the index shouldn't have any questions in it.
ru: В ``test_future_question`` мы создаём опрос с ``pub_date`` в будущем. База данных сбрасывается для каждого тестового метода, так что в списке опросов должно быть пусто.

source: And so on. In effect, we are using the tests to tell a story of admin input and user experience on the site, and checking that at every state and for every new change in the state of the system, the expected results are published.
ru: И так далее. По сути, мы используем тесты как эмуляцию ввода данных администратора и для проверки, что на каждом шаге и для каждого изменения программа ведёт себя именно так, как задумывалось.

source: Testing the ``DetailView``
ru: Тестирование ``DetailView``

source: What we have works well; however, even though future questions don't appear in the *index*, users can still reach them if they know or guess the right URL. So we need to add a similar constraint to ``DetailView``:
ru: мы получили вполне рабочий результат, однако хоть запланированные опросы и не попадут в список, они будут доступны по прямой ссылке. Следовательно, нужно наложить некоторые ограничения на ``DetailView``:

source: And of course, we will add some tests, to check that a ``Question`` whose ``pub_date`` is in the past can be displayed, and that one with a ``pub_date`` in the future is not:
ru: И, конечно, мы добавим тесты, проверяющие, что вопросы, у которых ``pub_date`` в прошлом, показываются, в то время как те, у которых ``pub_date`` в будущем - нет:

source: Ideas for more tests
ru: Идеи для других тестов

source: We ought to add a similar ``get_queryset`` method to ``ResultsView`` and create a new test class for that view. It'll be very similar to what we have just created; in fact there will be a lot of repetition.
ru: Нам следовало бы добавить метод, подобный ``get_queryset``, в ``ResultsView`` и создать для него новый класс тестов. Это несложно, но, в основном, повторит код, который уже был здесь написан.

source: We could also improve our application in other ways, adding tests along the way. For example, it's silly that ``Questions`` can be published on the site that have no ``Choices``. So, our views could check for this, and exclude such ``Questions``. Our tests would create a ``Question`` without ``Choices`` and then test that it's not published, as well as create a similar ``Question`` *with* ``Choices``, and test that it *is* published.
ru: Мы также могли бы улучшить наше приложение, покрыв всё тестами. Например, ``Questions`` не должен публиковаться, если у него нет ``Choices``. Можно исключать такие опросы в представлении. Тест же может создать ``Question`` без ``Choices`` и проверить, что он не опубликован, а потом создать ``Question`` с ``Choices`` и проверить, что он *отображается*.

source: Perhaps logged-in admin users should be allowed to see unpublished ``Questions``, but not ordinary visitors. Again: whatever needs to be added to the software to accomplish this should be accompanied by a test, whether you write the test first and then make the code pass the test, or work out the logic in your code first and then write a test to prove it.
ru: Возможно, администраторы и должны иметь возможность видеть неопубликованные вопросы, но не обычные посетители. Опять же: каждый новый функционал должен сопровождаться тестами. Неважно, пишутся ли они до или после кода.

source: At a certain point you are bound to look at your tests and wonder whether your code is suffering from test bloat, which brings us to:
ru: В какой-то момент вы посмотрите на тесты покрывающие функционал и удивитесь, что всё так слаженно работает. Поэтому:

source: When testing, more is better
ru: Чем больше тестов, тем лучше

source: It might seem that our tests are growing out of control. At this rate there will soon be more code in our tests than in our application, and the repetition is unaesthetic, compared to the elegant conciseness of the rest of our code.
ru: Может показаться, что количество тестов выходит из-под контроля. Их объём превысит размер кода, а методы будут ужасны, по сравнению с кодом приложения.

source: **It doesn't matter**. Let them grow. For the most part, you can write a test once and then forget about it. It will continue performing its useful function as you continue to develop your program.
ru: **Это не важно!** Пускай они растут. В основном, вы будете писать тест всего раз и забывать про него. Он же будет работать и помогать развивать приложение.

source: Sometimes tests will need to be updated. Suppose that we amend our views so that only ``Questions`` with ``Choices`` are published. In that case, many of our existing tests will fail - *telling us exactly which tests need to be amended to bring them up to date*, so to that extent tests help look after themselves.
ru: Иногда тесты должны быть обновлены. Например, когда меняется логика функций или объектов. В этом случае многие существующие тесты будут провалены - *это означает, что эти тесты необходимо обновить*, чтобы поддерживать в актуальном состоянии.

source: At worst, as you continue developing, you might find that you have some tests that are now redundant. Even that's not a problem; in testing redundancy is a *good* thing.
ru: В худшем случае может оказаться, что тесты проверяют один и тот же функционал. Не обращайте на это внимание, в тестировании избыточность - *хорошая* вещь.

source: As long as your tests are sensibly arranged, they won't become unmanageable. Good rules-of-thumb include having:
ru: Пока ваши тесты логично организованы, они управляемы. Хорошие привычки подразумевают:

source: a separate ``TestClass`` for each model or view
ru: разделять ``TestClass`` для каждой модели или представления

source: a separate test method for each set of conditions you want to test
ru: делать отдельный метод для каждого проверяемого условия

source: test method names that describe their function
ru: имена тестовых методов должны описывать их функционал

source: Further testing
ru: Дальнейшее тестирование

source: This tutorial only introduces some of the basics of testing. There's a great deal more you can do, and a number of very useful tools at your disposal to achieve some very clever things.
ru: Этот урок показывает только базовые техники тестирования. На самом деле много чего здесь не описано, например, полезные утилиты, которые помогают в разработке.

source: For example, while our tests here have covered some of the internal logic of a model and the way our views publish information, you can use an "in-browser" framework such as Selenium_ to test the way your HTML actually renders in a browser. These tools allow you to check not just the behavior of your Django code, but also, for example, of your JavaScript. It's quite something to see the tests launch a browser, and start interacting with your site, as if a human being were driving it! Django includes :class:`~django.test.LiveServerTestCase` to facilitate integration with tools like Selenium.
ru: Например, пока наши тесты покрывают внутреннюю логику, вы можете использовать сторонние инструменты для тестирования, например, Selenium. Он позволяет проверять уже конечный результат генерации страницы непосредственно в браузере. Это очень пригодится при тестировании JavaScript. Выглядит это как будто человек открывает сайт и начинает с ним работать. У Django есть класс для интеграции - :class:`~django.test.LiveServerTestCase`.

source: If you have a complex application, you may want to run tests automatically with every commit for the purposes of `continuous integration`_, so that quality control is itself - at least partially - automated.
ru: Если у вас сложное приложение, то можно настроить запуск тестов на каждый коммит (часть `continuous integration`_), что позволит автоматически следить за качеством кода.

source: A good way to spot untested parts of your application is to check code coverage. This also helps identify fragile or even dead code. If you can't test a piece of code, it usually means that code should be refactored or removed. Coverage will help to identify dead code. See :ref:`topics-testing-code-coverage` for details.
ru: Хороший способ определить какая часть не покрыта тестами - узнать покрытие кода. Это также позволяет выявить неиспользуемый код. Если вы не можете написать тест для тестирования какого-либо куска кода, это означает, что именно здесь требуется рефакторинг. Подробнее тут - :ref:`topics-testing-code-coverage`.

source: :doc:`Testing in Django </topics/testing/index>` has comprehensive information about testing.
ru: Больше информации по тестированию можно получить здесь: :doc:`Testing Django applications </topics/testing/index>`

source: What's next?
ru: Что дальше?

source: For full details on testing, see :doc:`Testing in Django </topics/testing/index>`.
ru: За дополнительной информацией можно обратиться к документу :doc:`Тестирование в Django </topics/testing/index>`.

source: When you're comfortable with testing Django views, read :doc:`part 6 of this tutorial</intro/tutorial06>` to learn about static files management.
ru: Когда вы освоите тестирование, прочитайте :doc:`шестую часть этого учебника</intro/tutorial06>`, там разбирается работа со статическими файлами.
