Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/whatsnext.po
Languages: ru

source: What to read next
ru: Куда двигаться далее

source: So what's next?
ru: Итак, что дальше?

source: Well, we've always been big fans of learning by doing. At this point you should know enough to start a project of your own and start fooling around. As you need to learn new tricks, come back to the documentation.
ru: Мы всегда были большими поклонниками обучения на практике. На данный момент вы должны знать достаточно, чтобы создать собственный проект и начать с ним разбираться. Как только вам понадобится научиться новым хитростям, возвращайтесь к документации.

source: We've put a lot of effort into making Django's documentation useful, easy to read and as complete as possible. The rest of this document explains more about how the documentation works so that you can get the most out of it.
ru: Мы приложили немало усилий, чтобы сделать документацию по Django полезной, легко читаемой и как можно более полной. Остальная часть этого документа объясняет больше то, как работает документация, так что вы можете получить максимальную отдачу от нее.

source: (Yes, this is documentation about documentation. Rest assured we have no plans to write a document about how to read the document about documentation.)
ru: (Да, это документация о документации. Будьте уверены, мы не планируем писать документ о том, как прочитать документ о документации.)

source: Finding documentation
ru: Поиск документации

source: Or you can just browse around!
ru: Или вы можете просто полистать!

source: How the documentation is organized
ru: Как организована документация

source: Django's main documentation is broken up into "chunks" designed to fill different needs:
ru: Основная документация Django разбита на "блоки", предназначенные для удовлетворения различных потребностей:

source: The :doc:`introductory material </intro/index>` is designed for people new to Django -- or to Web development in general. It doesn't cover anything in depth, but instead gives a high-level overview of how developing in Django "feels".
ru: :doc:`Вводный материал </intro/index>` предназначен для новичков в Django или веб-разработке в целом. Он не охватывает все темы, но вместо этого дает общий обзор того, какова на вкус разработка на Django.

source: The :doc:`topic guides </topics/index>`, on the other hand, dive deep into individual parts of Django. There are complete guides to Django's :doc:`model system </topics/db/index>`, :doc:`template engine </topics/templates>`, :doc:`forms framework </topics/forms/index>`, and much more.
ru: :doc:`Путеводитель по темам </topics/index>`, с другой стороны, дает возможность погрузиться в отдельные части Django. Есть полные справочники по :doc:`ORM Django </topics/db/index>`, :doc:`механизме шаблонов </topics/templates>`, doc:`формах </topics/forms/index>` и многому другому.

source: This is probably where you'll want to spend most of your time; if you work your way through these guides you should come out knowing pretty much everything there is to know about Django.
ru: На эти вещи вы, наверное, захотите потратить большую часть своего времени, если вы начали работать с этим руководством, не зная практически ничего о Django.

source: Web development is often broad, not deep -- problems span many domains. We've written a set of :doc:`how-to guides </howto/index>` that answer common "How do I ...?" questions. Here you'll find information about :doc:`generating PDFs with Django </howto/outputting-pdf>`, :doc:`writing custom template tags </howto/custom-template-tags>`, and more.
ru: Веб-разработка часто широко, но не глубоко, затрагивает проблемы из многих областей. Мы написали множество :doc:`практических руководств </howto/index>`, которые отвечают на вопросы вида "Как мне ...?". Здесь вы найдете сведения о :doc:`создании PDF-файлов с Django </howto/outputting-pdf>`, :doc:`написании шаблоных тегов </howto/custom-template-tags>` и многом другом.

source: Answers to really common questions can also be found in the :doc:`FAQ </faq/index>`.
ru: Ответы на часто задаваемые вопросы можно найти в :doc:`FAQ </faq/index>`.

source: The guides and how-to's don't cover every single class, function, and method available in Django -- that would be overwhelming when you're trying to learn. Instead, details about individual classes, functions, methods, and modules are kept in the :doc:`reference </ref/index>`. This is where you'll turn to find the details of a particular function or whathaveyou.
ru: Руководства и how-to не покрывают каждый класс, функцию и метод, доступные в Django - это негативно сказалось бы на изучении. Вместо этого, информация об отдельных классах, функциях, методах и модулях хранится в :doc:`Справочнике API </ref/index>`. В нем вы можете найти детали той или иной функции или то, что Вам нужно.

source: How documentation is updated
ru: Как обновляется документация

source: Just as the Django code base is developed and improved on a daily basis, our documentation is consistently improving. We improve documentation for several reasons:
ru: Подобно тому, как базовый код Django ежедневно развивается и совершенствуется, наша документация постоянно улучшается. Мы улучшаем документацию по нескольким причинам:

source: To make content fixes, such as grammar/typo corrections.
ru: Для исправления грамматических ошибок и опечаток.

source: To add information and/or examples to existing sections that need to be expanded.
ru: Чтобы добавить информацию и/или примеры в существующие разделы, которые требуют расширения.

source: To document Django features that aren't yet documented. (The list of such features is shrinking but exists nonetheless.)
ru: Для документирования особенностей Django, которые до сих пор не документированы. (Перечень таких особенностей сокращается, но тем не менее, существует.)

source: To add documentation for new features as new features get added, or as Django APIs or behaviors change.
ru: Чтобы добавить документацию для новых функций или Django API после их добавления или изменения.

source: Where to get it
ru: Где взять документацию

source: You can read Django documentation in several ways. They are, in order of preference:
ru: Вы можете читать Django документацию несколькими путями. В порядке предпочтения:

source: On the Web
ru: В интернете

source: We encourage you to help improve the docs by submitting changes, corrections and suggestions in the `ticket system`_. The Django developers actively monitor the ticket system and use your feedback to improve the documentation for everybody.
ru: Мы поощряем улучшение документации через внесение изменений, исправлений и предложений в `ticket system`_. Django разработчики активно наблюдают за системой тикетов и используют обратную связь от вас для улучшения документации для каждого.

source: Note, however, that tickets should explicitly relate to the documentation, rather than asking broad tech-support questions. If you need help with your particular Django setup, try the `django-users mailing list`_ or the `#django IRC channel`_ instead.
ru: Однако следует отметить, что тикеты должны быть заведены по существу, а не обсуждать вопросы по технической поддержке широкого характера. Если Вам нужна помощь с вашей индивидуальной установкой Django, посмотрите`django-users mailing list`_ или `#django IRC channel`_

source: In plain text
ru: В текстовый формате

source: For offline reading, or just for convenience, you can read the Django documentation in plain text.
ru: Для чтения в автономном режиме, или просто для удобства, вы можете читать Django документацию в текстовом формате.

source: If you're using an official release of Django, note that the zipped package (tarball) of the code includes a ``docs/`` directory, which contains all the documentation for that release.
ru: Если вы используете официальный релиз Django, обратите внимание, что zip-архив кода включает в себя каталог ``docs/``, который содержит всю документацию для этого релиза.

source: One low-tech way of taking advantage of the text documentation is by using the Unix ``grep`` utility to search for a phrase in all of the documentation. For example, this will show you each mention of the phrase "max_length" in any Django document:
ru: При помощи утилиты grep можно сделать поиск заданной фразы по всей документации. Например, эта команда выдаст каждое упоминание фразы "max_length" во всей документации Django:

source: As HTML, locally
ru: Как HTML, локально

source: You can get a local copy of the HTML documentation following a few easy steps:
ru: Вы можете получить локальную копию HTML документации, выполнив несколько простых шагов:

source: Django's documentation uses a system called Sphinx__ to convert from plain text to HTML. You'll need to install Sphinx by either downloading and installing the package from the Sphinx Web site, or with ``pip``:
ru: Документация Django использует систему под названием Sphinx для преобразования обычного текста в HTML. Вам нужно установить Sphinx веб-сайта Сфинкс или при помощи pip:

source: Then, just use the included ``Makefile`` to turn the documentation into HTML:
ru: Затем, используйте ``Makefile`` для включения документов в HTML:

source: You'll need `GNU Make`__ installed for this.
ru: Вам понадобится `GNU Make`__, установленный для этого.

source: If you're on Windows you can alternatively use the included batch file:
ru: Если вы используете Windows, также можно использовать включенный batch файл:

source: The HTML documentation will be placed in ``docs/_build/html``.
ru: HTML документация будет размещена в ``docs/_build/html``.

source: Generation of the Django documentation will work with Sphinx version 0.6 or newer, but we recommend going straight to Sphinx 1.0.2 or newer.
ru: Генерация Django документации способен работать со Sphinx версии 0.6 или выше, но мы рекомендуем использовать сразу Sphinx 1.0.2 или выше.

source: Differences between versions
ru: Различия между версиями

source: We follow this policy:
ru: Мы следуем следующей политике:

source: To distinguish feature changes/additions in the docs, we use the phrase: "New in version X.Y", being X.Y the next release version (hence, the one being developed).
ru: Чтобы выделить особенности изменений/дополнений в документах, мы используем фразу: "Новое в версии X.Y", где X.Y - версия релиза (а, значит, находящаяся в разработке).
