Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/deployment/wsgi/index.po
Languages: ru

source: How to deploy with WSGI
ru: Развёртывание с WSGI

source: Django's primary deployment platform is WSGI_, the Python standard for web servers and applications.
ru: Основной платформой для развертывания Django является `WSGI <http://wsgi.readthedocs.org/en/latest/>`_, это фактически стандарт для веб-серверов и приложений на Python.

source: Django's :djadmin:`startproject` management command sets up a simple default WSGI configuration for you, which you can tweak as needed for your project, and direct any WSGI-compliant application server to use.
ru: Команда :djadmin:`startproject` установит простую WSGI конфигурацию по-умолчанию, которую вы можете впоследствии изменить под нужды вашего проекта и использовать с любым WSGI-совместимым веб-сервером.

source: Django includes getting-started documentation for the following WSGI servers:
ru: Django содержит описание работы со следующими WSGI серверами:

source: The ``application`` object
ru: Объект ``application``

source: The key concept of deploying with WSGI is the ``application`` callable which the application server uses to communicate with your code. It's commonly provided as an object named ``application`` in a Python module accessible to the server.
ru: Одна из ключевых концепций развертывания с WSGI заключается в указании функции, или вызываемого объекта, ``application``, который использует веб-сервер для взаимодействия с вашим кодом. Обычно это объект ``application`` модуля Python доступного для сервера.

source: The :djadmin:`startproject` command creates a file :file:`<project_name>/wsgi.py` that contains such an ``application`` callable.
ru: Команда :djadmin:`startproject` создаст файл :file:`<project_name>/wsgi.py`, который содержит вызываемый объект ``application``.

source: It's used both by Django's development server and in production WSGI deployments.
ru: Этот файл использует как встроенным сервером для разработки, так и на боевом WSGI сервере.

source: WSGI servers obtain the path to the ``application`` callable from their configuration. Django's built-in servers, namely the :djadmin:`runserver` and :djadmin:`runfcgi` commands, read it from the :setting:`WSGI_APPLICATION` setting. By default, it's set to ``<project_name>.wsgi.application``, which points to the ``application`` callable in :file:`<project_name>/wsgi.py`.
ru: WSGI сервер получает путь к объекту ``application`` из своих настроек. Встроенный сервер Django, запускаемый командами :djadmin:`runserver` и :djadmin:`runfcgi`, использует настройку :setting:`WSGI_APPLICATION`. По умолчанию она равна ``<project_name>.wsgi.application``, и указывает на объект ``application`` в :file:`<project_name>/wsgi.py`.

source: Configuring the settings module
ru: Конфигурация модуля настроек

source: When the WSGI server loads your application, Django needs to import the settings module — that's where your entire application is defined.
ru: Когда WSGI сервер загружает ваше приложение, Django необходимо импортировать модуль с настройками.

source: Django uses the :envvar:`DJANGO_SETTINGS_MODULE` environment variable to locate the appropriate settings module. It must contain the dotted path to the settings module. You can use a different value for development and production; it all depends on how you organize your settings.
ru: Django использует переменную окружения :envvar:`DJANGO_SETTINGS_MODULE` для определения расположения модуля настроек. Она должна содержать путь для импорта этого модуля. Вы можете использовать разные значения при разработке и на боевом сервере, все зависит от организации настроек в вашем проекте.

source: If this variable isn't set, the default :file:`wsgi.py` sets it to ``mysite.settings``, where ``mysite`` is the name of your project. That's how :djadmin:`runserver` discovers the default settings file by default.
ru: Если переменная не определена, :file:`wsgi.py` использует значение ``mysite.settings``, где ``mysite`` название вашего проекта. Вот как :djadmin:`runserver` определяет расположение файла настроек для вашего проекта.

source: Since environment variables are process-wide, this doesn't work when you run multiple Django sites in the same process. This happens with mod_wsgi.
ru: Так как переменные окружения одни на процесс, такой подход не работает при запуске нескольких Django сайтов в одном процессе, как это работает в mod_wsgi.

source: To avoid this problem, use mod_wsgi's daemon mode with each site in its own daemon process, or override the value from the environment by enforcing ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` in your :file:`wsgi.py`.
ru: Для этого используйте daemon mode mod_wsgi при котором каждый сайт запускается в отдельном процессе, или перезаписывайте переменную окружения ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` в :file:`wsgi.py`.

source: Applying WSGI middleware
ru: Использование WSGI мидлваров

source: To apply `WSGI middleware`_ you can simply wrap the application object. For instance you could add these lines at the bottom of :file:`wsgi.py`::
ru: Чтобы использовать `WSGI middleware <http://www.python.org/dev/peps/pep-3333/#middleware-components-that-play-both-sides>`_ можно просто обернуть объект приложения в том же файле. Например, вы можете добавить следующий код в конце :file:`wsgi.py`::

source: You could also replace the Django WSGI application with a custom WSGI application that later delegates to the Django WSGI application, if you want to combine a Django application with a WSGI application of another framework.
ru: Также вы можете заменить WSGI-приложение, предоставляемое с Django, если хотите совместить приложения Django с приложениями другого фреймворка.

source: Some third-party WSGI middleware do not call ``close`` on the response object after handling a request — most notably Sentry's error reporting middleware up to version 2.0.7. In those cases the :data:`~django.core.signals.request_finished` signal isn't sent. This can result in idle connections to database and memcache servers.
ru: Некоторые сторонние WSGI middleware не вызывают метод ``close`` объекта ответа после обработки запроса — самым известным является middleware Sentry(до 2.0.7 версии) для обработки ошибок. В таких случаях сигнал :data:`~django.core.signals.request_finished` не отсылается. Это может привести к простою подключений к базе данных или серверам memcache.
