Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/deployment/wsgi/modwsgi.po
Languages: ru

source: How to use Django with Apache and mod_wsgi
ru: Развертывание Django с Apache и mod_wsgi

source: Deploying Django with Apache_ and `mod_wsgi`_ is a tried and tested way to get Django into production.
ru: Развертывание Django с `Apache <http://httpd.apache.org/>`_ и `mod_wsgi <http://code.google.com/p/modwsgi/>`_ это испытанный способ установки на "боевой" веб-сервер.

source: mod_wsgi is an Apache module which can host any Python WSGI_ application, including Django. Django will work with any version of Apache which supports mod_wsgi.
ru: ``mod_wsgi`` является модулем веб-сервера Apache, который может взаимодействовать с любым приложением Python, в том числе Django. Django работает с любой версией Apache, поддерживающей ``mod_wsgi``.

source: The `official mod_wsgi documentation`_ is fantastic; it's your source for all the details about how to use mod_wsgi. You'll probably want to start with the `installation and configuration documentation`_.
ru: `Официальная документация mod_wsgi <http://code.google.com/p/modwsgi/>`_ просто фантастический документ; это ваш путеводитель по mod_wsgi. Возможно, вы захотите начать с `документации по установке и конфигурированию <http://code.google.com/p/modwsgi/wiki/InstallationInstructions>`_.

source: Basic configuration
ru: Базовая конфигурация

source: Once you've got mod_wsgi installed and activated, edit your Apache server's ``httpd.conf`` file and add the following. If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
ru: После того как вы установите и активируете mod_wsgi отредактируйте файл ``httpd.conf`` веб-сервера Apache, изменив его следующим образом. Если вы используете Apache версии ниже чем 2.4, замените `Require all granted`` на ``Allow from all`` и добавьте выше ``Order deny,allow``.

source: The first bit in the ``WSGIScriptAlias`` line is the base URL path you want to serve your application at (``/`` indicates the root url), and the second is the location of a "WSGI file" -- see below -- on your system, usually inside of your project package (``mysite`` in this example). This tells Apache to serve any request below the given URL using the WSGI application defined in that file.
ru: Значение ``WSGIScriptAlias`` указывает местоположение ваших приложений, (``/`` обозначает корневую директорию), вторым значением указывается расположение файла "WSGI" -- см.ниже -- в вашей системе, как правило, в корне проекта. (в примере это ``mysite``). Эти настройки позволят Apache обрабатывать любой запрос из директории, указанной как базовая с помощью WSGI-приложения, хранящегося в ней.

source: The ``WSGIPythonPath`` line ensures that your project package is available for import on the Python path; in other words, that ``import mysite`` works.
ru: ``WSGIPythonPath`` гарантирует, что ваш проект доступен для импорта; иначе говоря, что команда ``import mysite`` сработает.

source: The ``<Directory>`` piece just ensures that Apache can access your :file:`wsgi.py` file.
ru: Значение ``<Directory>`` просто предоставляет Apache доступ к файлу :file:`wsgi.py`.

source: Next we'll need to ensure this :file:`wsgi.py` with a WSGI application object exists. As of Django version 1.4, :djadmin:`startproject` will have created one for you; otherwise, you'll need to create it. See the :doc:`WSGI overview documentation</howto/deployment/wsgi/index>` for the default contents you should put in this file, and what else you can add to it.
ru: Далее следует удостовериться, что файл :file:`wsgi.py` существует. Начиная с версии Django 1.4 команда :djadmin:`startproject` создаёт его; в противном случае вы можете создать этот файл самостоятельно. См. :doc:`Развёртывание с WSGI </howto/deployment/wsgi/index>`, чтобы узнать изначальное содержимое файла и то, какие настройки вы можете добавить.

source: If multiple Django sites are run in a single mod_wsgi process, all of them will use the settings of whichever one happens to run first. This can be solved with a minor edit to ``wsgi.py`` (see comment in the file for details), or by :ref:`using mod_wsgi daemon mode<daemon-mode>` and ensuring that each site runs in its own daemon process.
ru: Если несколько сайтов на Django запущены в одном процессе mod_wsgi, они все будут использовать настройки сайта, который первый загрузился. Это можно исправить поправив ``wsgi.py``(смотрите комментарий в файле), или :ref:`используя mod_wsgi daemon mode<daemon-mode>` при котором каждый сайт запущен в отдельном фоновом процессе.

source: Using a virtualenv
ru: Использование virtualenv

source: If you install your project's Python dependencies inside a `virtualenv`_, you'll need to add the path to this virtualenv's ``site-packages`` directory to your Python path as well. To do this, add an additional path to your ``WSGIPythonPath`` directive, with multiple paths separated by a colon (``:``) if using a UNIX-like system, or a semicolon (``;``) if using Windows. If any part of a directory path contains a space character, the complete argument string to ``WSGIPythonPath`` must be quoted::
ru: Если вы установили зависимости проекта с помощью `virtualenv <http://www.virtualenv.org/en/latest/>`_ вам следует добавить в пути Python путь к директории ``site-packages``, находящейся в вашем виртуальном окружении. Для этого добавьте дополнительный путь к ``WSGIPythonPath``, разделив его двоеточием, если вы используете UNIX-системы, или точкой с запятой, если вы используете Windows. Если путь содержит пробелы, вся строка для ``WSGIPythonPath`` должна быть экранирована::

source: Make sure you give the correct path to your virtualenv, and replace ``python2.X`` with the correct Python version (e.g. ``python2.7``).
ru: Убедитесь в том, что путь к виртуальному окружению указан верно и замените ``python2.X`` на используемую вами версию Python (например, ``python2.7``).

source: Using mod_wsgi daemon mode
ru: Использование ``mod_wsgi`` в режиме демона

source: "Daemon mode" is the recommended mode for running mod_wsgi (on non-Windows platforms). To create the required daemon process group and delegate the Django instance to run in it, you will need to add appropriate ``WSGIDaemonProcess`` and ``WSGIProcessGroup`` directives. A further change required to the above configuration if you use daemon mode is that you can't use ``WSGIPythonPath``; instead you should use the ``python-path`` option to ``WSGIDaemonProcess``, for example::
ru: "Режим демона" рекомендуемый режим для запуска ``mod_wsgi`` (но не на ОС Windows). Для создания требуемой группы процесса-демона и передачи управления Django вы должны добавить директивы ``WSGIDaemonProcess`` и ``WSGIProcessGroup``. Еще одно важное дополнение: при использовании данной конфигурации в режиме демона вы не сможете работать с ``WSGIPythonPath``; вместо этого укажите опцию ``python-path`` , чтобы использовать возможности ``WSGIDaemonProcess``, к примеру::

source: See the official mod_wsgi documentation for `details on setting up daemon mode`_.
ru: Обратитесь к официальной документации ``mod_wsgi``, чтобы узнать подробнее о `настройке в режиме демона <http://code.google.com/p/modwsgi/wiki/QuickConfigurationGuide#Delegation_To_Daemon_Process>`_.

source: Serving files
ru: Обслуживание файлов

source: Django doesn't serve files itself; it leaves that job to whichever Web server you choose.
ru: Django не должен обрабатывать файлы самостоятельно; эта задача передаётся любому выбранному вами веб-серверу.

source: We recommend using a separate Web server -- i.e., one that's not also running Django -- for serving media. Here are some good choices:
ru: Мы рекомендуем использовать отдельный веб-сервер -- то есть тот, что идёт не в поставке с самим Django -- для обслуживания медиа-файлов. Вот несколько неплохих вариантов::

source: lighttpd_
ru: `lighttpd <http://www.lighttpd.net/>`_

source: Nginx_
ru: `Nginx <http://wiki.nginx.org/Main>`_

source: TUX_
ru: `TUX <http://en.wikipedia.org/wiki/TUX_web_server>`_

source: A stripped-down version of Apache_
ru: Неполная версия `Apache <http://httpd.apache.org/>`_

source: Cherokee_
ru: `Cherokee <http://cherokee-project.com/>`_

source: If, however, you have no option but to serve media files on the same Apache ``VirtualHost`` as Django, you can set up Apache to serve some URLs as static media, and others using the mod_wsgi interface to Django.
ru: Однако, если у вас нет возможности обслуживать медиа-файлы на том же виртуальном хосте (``VirtualHost``) что и Django, вы можете настроить Apache на обработку некоторых URL-запросов как статических и медиа-файлов, используя интерфейс mod_wsgi.

source: This example sets up Django at the site root, but explicitly serves ``robots.txt``, ``favicon.ico``, any CSS file, and anything in the ``/static/`` and ``/media/`` URL space as a static file. All other URLs will be served using mod_wsgi::
ru: Это пример настройки Django в корне сайта, где явно указаны пути к ``robots.txt``, ``favicon.ico``, различным CSS-файлам, а также директориям ``/static/`` и ``/media/`` для их обработки как статических файлов. Все прочие URL-адреса будут обработаны при помощи mod_wsgi::

source: If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
ru: Если вы используете Apache старее чем 2.4, замените ``Require all granted`` на ``Allow from all`` и добавьте выше ``Order deny,allow``.

source: Serving the admin files
ru: Обслуживание административных файлов

source: When :mod:`django.contrib.staticfiles` is in :setting:`INSTALLED_APPS`, the Django development server automatically serves the static files of the admin app (and any other installed apps). This is however not the case when you use any other server arrangement. You're responsible for setting up Apache, or whichever Web server you're using, to serve the admin files.
ru: Если добавить приложение :mod:`django.contrib.staticfiles` в :setting:`INSTALLED_APPS`, сервер разработки Django автоматически обрабатывает административные приложения (и любые другие установленные приложения ), но это не годится для случая с другим сервером разработки. Вы сами несете ответственность за настройку Apache или любого другого сервера при использовании его для обслуживания административных файлов.

source: The admin files live in (:file:`django/contrib/admin/static/admin`) of the Django distribution.
ru: Административные файлы находятся по пути (:file:`django/contrib/admin/static/admin`) в директории, где установлен Django.

source: We **strongly** recommend using :mod:`django.contrib.staticfiles` to handle the admin files (along with a Web server as outlined in the previous section; this means using the :djadmin:`collectstatic` management command to collect the static files in :setting:`STATIC_ROOT`, and then configuring your Web server to serve :setting:`STATIC_ROOT` at :setting:`STATIC_URL`), but here are three other approaches:
ru: Мы **настоятельно** рекомендуем использовать :mod:`django.contrib.staticfiles` для работы со статикой административного раздела (так же, как и в случае с веб-сервером, как это описано выше); это означает использование команды :djadmin:`collectstatic` для сбора статики в :setting:`STATIC_ROOT`, и настройку веб-сервера для обслуживания :setting:`STATIC_ROOT` в :setting:`STATIC_URL`), но есть и несколько иных подходов:

source: Create a symbolic link to the admin static files from within your document root (this may require ``+FollowSymLinks`` in your Apache configuration).
ru: Создание символьной ссылки на статические файлы, которые должны содержаться в корневом каталоге (для этого может потребоваться добавление ``+FollowSymLinks`` в конфигурации Apache).

source: Use an ``Alias`` directive, as demonstrated above, to alias the appropriate URL (probably :setting:`STATIC_URL` + ``admin/``) to the actual location of the admin files.
ru: Использование директивы ``Alias``, как было показано выше, для создания псевдонима соответствующего URL-адреса (вероятно это будет :setting:`STATIC_URL` + ``admin/``), указывающего на фактическое расположение файлов.

source: Copy the admin static files so that they live within your Apache document root.
ru: Копирование директории с административной статикой в корень Apache.

source: Authenticating against Django's user database from Apache
ru: Идентификация пользовательской базы данных с Apache

source: Django provides a handler to allow Apache to authenticate users directly against Django's authentication backends. See the :doc:`mod_wsgi authentication documentation </howto/deployment/wsgi/apache-auth>`.
ru: Django предоставляет возможность идентификации пользователей средствами Apache см. :doc:`mod_wsgi authentication documentation </howto/deployment/wsgi/apache-auth>`.

source: If you get a UnicodeEncodeError
ru: Если вы столкнулись с ошибкой ``UnicodeEncodeError``

source: If you're taking advantage of the internationalization features of Django (see :doc:`/topics/i18n/index`) and you intend to allow users to upload files, you must ensure that the environment used to start Apache is configured to accept non-ASCII file names. If your environment is not correctly configured, you will trigger ``UnicodeEncodeError`` exceptions when calling functions like the ones in :mod:`os.path` on filenames that contain non-ASCII characters.
ru: Если вы воспользовались настройками стандартной интернационализации Django (см. :doc:`/topics/i18n/index`) и позволили пользователям загружать файлы, то должны убедиться, что среда для запуска Apache настроена для обработки не ASCII символов.Если это не так, будет возбуждено исключение ``UnicodeEncodeError`` при вызове функций, подобных :mod:`os.path` с именами файлов, содержащими отличные от ASCII символы.

source: To avoid these problems, the environment used to start Apache should contain settings analogous to the following::
ru: Чтобы избежать проблем, среда, в которой запущен Apache, должна содержать параметры, аналогичные следующим::

source: Consult the documentation for your operating system for the appropriate syntax and location to put these configuration items; ``/etc/apache2/envvars`` is a common location on Unix platforms. Once you have added these statements to your environment, restart Apache.
ru: Обратитесь к документации вашей операционной системы, чтобы подобрать соответствующий синтаксис и настроить расположение конфигурационных файлов; ``/etc/apache2/envvars`` является общей для Unix-like систем. После внесения соответствующих изменений перезапустите Apache.
