Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/exceptions.po
Languages: ru

source: Django Exceptions
ru: Исключения Django

source: Django raises some of its own exceptions as well as standard Python exceptions.
ru: Django вызывает несколько собственных исключений на ряду со стандартными исключениями Python.

source: Django Core Exceptions
ru: Основные исключения Django

source: Django core exception classes are defined in ``django.core.exceptions``.
ru: Основные исключения Django определены в :mod:`django.core.exceptions`.

source: The base class for :exc:`~django.db.models.Model.DoesNotExist` exceptions; a ``try/except`` for ``ObjectDoesNotExist`` will catch :exc:`~django.db.models.Model.DoesNotExist` exceptions for all models.
ru: Основной класс :exc:`~django.db.models.Model.DoesNotExist`. ``try/except`` для ``ObjectDoesNotExist`` словит исключения :exc:`~django.db.models.Model.DoesNotExist` для всех моделей.

source: See :meth:`~django.db.models.query.QuerySet.get()` for further information on :exc:`ObjectDoesNotExist` and :exc:`~django.db.models.Model.DoesNotExist`.
ru: Смотрите :meth:`~django.db.models.query.QuerySet.get()` для подробной информации об исключениях :exc:`ObjectDoesNotExist` и :exc:`~django.db.models.Model.DoesNotExist`.

source: The ``FieldDoesNotExist`` exception is raised by a model's ``_meta.get_field()`` method when the requested field does not exist on the model or on the model's parents.
ru: Исключение ``FieldDoesNotExist`` вызывается методом ``_meta.get_field()`` модели, если запрошенное поле не найдено в модели или в предках модели.

source: This exception was previously defined only in ``django.db.models.fields`` and wasn't part of the public API.
ru: Ранее это исключение было определено в ``django.db.models.fields`` и не было частью публичного API.

source: The :exc:`MultipleObjectsReturned` exception is raised by a query if only one object is expected, but multiple objects are returned. A base version of this exception is provided in :mod:`django.core.exceptions`; each model class contains a subclassed version that can be used to identify the specific object type that has returned multiple objects.
ru: Исключение :exc:`MultipleObjectsReturned` вызывается запросом при получении нескольких объектов в случае, когда ожидался один объект. Базовая версия этого исключения предоставляется модулем :mod:`django.core.exceptions`; каждый класс модели содержит версию подкласса, которая может использоваться для идентификации особого объектного типа, который возвратил коллекцию объектов.

source: See :meth:`~django.db.models.query.QuerySet.get()` for further information.
ru: См. :meth:`~django.db.models.query.QuerySet.get()` для подробной информации.

source: The :exc:`SuspiciousOperation` exception is raised when a user has performed an operation that should be considered suspicious from a security perspective, such as tampering with a session cookie. Subclasses of ``SuspiciousOperation`` include:
ru: Исключение :exc:`SuspiciousOperation` вызывается когда пользователь выполнил операцию, которая должна быть рассмотрена как подозрительная с точки зрения безопасности, например, при подмене куки сессии. Подклассы ``SuspiciousOperation``:

source: If a ``SuspiciousOperation`` exception reaches the WSGI handler level it is logged at the ``Error`` level and results in a :class:`~django.http.HttpResponseBadRequest`. See the :doc:`logging documentation </topics/logging/>` for more information.
ru: Исключение ``SuspiciousOperation`` на уровне WSGI обработчика будет логгировано как ошибка и будет возвращен :class:`~django.http.HttpResponseBadRequest`. Подробности смотрите в :doc:`разделе о логгировании </topics/logging/>`.

source: The :exc:`PermissionDenied` exception is raised when a user does not have permission to perform the action requested.
ru: Исключение :exc:`PermissionDenied` вызывается если пользователь не имеет права на выполнение запрошенного действия.

source: The :exc:`ViewDoesNotExist` exception is raised by :mod:`django.core.urlresolvers` when a requested view does not exist.
ru: Исключение :exc:`ViewDoesNotExist` вызывается модулем :mod:`django.core.urlresolvers`, если запрошенное представление на найдено.

source: The :exc:`MiddlewareNotUsed` exception is raised when a middleware is not used in the server configuration.
ru: Исключение :exc:`MiddlewareNotUsed` вызывается, если мидлвар не используется в конфигурации сервера.

source: The :exc:`ImproperlyConfigured` exception is raised when Django is somehow improperly configured -- for example, if a value in ``settings.py`` is incorrect or unparseable.
ru: Исключение :exc:`ImproperlyConfigured` вызывается, если Django неправильно сконфигурировано. Например, если значение в ``settings.py`` неправильное.

source: The :exc:`FieldError` exception is raised when there is a problem with a model field. This can happen for several reasons:
ru: Исключение :exc:`FieldError` вызывается, если существует проблема с полем модели. Такое может произойти по следующим причинам:

source: A field in a model clashes with a field of the same name from an abstract base class
ru: Поле в модели конфликтует с полем абстрактного класса, которое имеет такое же имя.

source: An infinite loop is caused by ordering
ru: Бесконечный цикл, вызванный сортировкой.

source: A keyword cannot be parsed from the filter parameters
ru: Аргумент не может быть получен из параметров фильтра.

source: A field cannot be determined from a keyword in the query parameters
ru: Поле не может быть определено из аргумента в параметрах запроса.

source: A join is not permitted on the specified field
ru: Объединение не разрешено для указанного поля.

source: A field name is invalid
ru: Имя поля неверное.

source: A query contains invalid order_by arguments
ru: Запрос состоит из неверного порядка аргументов.

source: The :exc:`ValidationError` exception is raised when data fails form or model field validation. For more information about validation, see :doc:`Form and Field Validation </ref/forms/validation>`, :ref:`Model Field Validation <validating-objects>` and the :doc:`Validator Reference </ref/validators>`.
ru: Исключение :exc:`ValidationError` вызывается, если происходит ошибка проверки данных от формы или модели. Для подробностей о проверке данных, см. :doc:`Проверка форм и полей </ref/forms/validation>`, :ref:`Проверка поля модели <validating-objects>` и the :doc:`Справочник проверки </ref/validators>`.

source: ``ValidationError``\s that don't belong to a particular field in a form or model are classified as ``NON_FIELD_ERRORS``. This constant is used as a key in dictionaries that otherwise map fields to their respective list of errors.
ru: ``ValidationError``, которые не относятся ни к одному из полей формы или модели, классифицируются как ``NON_FIELD_ERRORS``. Эта константа определяет ключ в словаре ошибок.

source: URL Resolver exceptions
ru: Ошибки определения URL

source: URL Resolver exceptions are defined in ``django.core.urlresolvers``.
ru: Ошибки определения URL определены в ``django.core.urlresolvers``.

source: The :exc:`Resolver404` exception is raised by :func:`django.core.urlresolvers.resolve()` if the path passed to ``resolve()`` doesn't map to a view. It's a subclass of :class:`django.http.Http404`.
ru: Исключение :exc:`Resolver404` вызывается в :func:`django.core.urlresolvers.resolve()`, если путь переданный в ``resolve()`` не соответствует ни одному представлению. Подкласс :class:`django.http.Http404`.

source: The :exc:`NoReverseMatch` exception is raised by :mod:`django.core.urlresolvers` when a matching URL in your URLconf cannot be identified based on the parameters supplied.
ru: Исключение :exc:`NoReverseMatch` вызывается модулем :mod:`django.core.urlresolvers`, если не получилось найти соответствующий URL по переданным параметрам.

source: Database Exceptions
ru: Исключения базы данных

source: Database exceptions may be imported from ``django.db``.
ru: Ошибки базы данных определены в ``django.db``.

source: Django wraps the standard database exceptions so that your Django code has a guaranteed common implementation of these classes.
ru: Django оборачивает стандартные исключения базы данных таким образом, что код Django гарантирует стандартную реализацию этих классов.

source: The Django wrappers for database exceptions behave exactly the same as the underlying database exceptions. See :pep:`249`, the Python Database API Specification v2.0, for further information.
ru: Обёртка Django для исключений базы данных ведёт себя аналогично обёртываемым исключениям. См. :pep:`249`, вторую версию Python Database API Specification, для подробностей.

source: As per :pep:`3134`, a ``__cause__`` attribute is set with the original (underlying) database exception, allowing access to any additional information provided. (Note that this attribute is available under both Python 2 and Python 3, although :pep:`3134` normally only applies to Python 3.)
ru: В соответствии с :pep:`3134`, атрибут ``__cause__`` содержит изначальное исключение базы данных, предоставляя доступ к дополнительной информации. (Этот атрибут доступен для Python 2 и Python 3, хотя :pep:`3134` создавался для Python 3.)

source: Raised to prevent deletion of referenced objects when using :attr:`django.db.models.PROTECT`. :exc:`models.ProtectedError` is a subclass of :exc:`IntegrityError`.
ru: Выбрасывается для предотвращения удаления связанных объектов при использовании :attr:`django.db.models.PROTECT`. :exc:`models.ProtectedError`является дочерним классом :exc:`IntegrityError`.

source: Http Exceptions
ru: Исключения Http

source: Http exceptions may be imported from ``django.http``.
ru: Ошибки HTTP определенны в ``django.http``.

source: :exc:`UnreadablePostError` is raised when a user cancels an upload.
ru: Исключение :exc:`UnreadablePostError` выбрасывается когда пользователь прерывает закачку файла.

source: Transaction Exceptions
ru: Исключения транзакций

source: Transaction exceptions are defined in ``django.db.transaction``.
ru: Ошибки транзакции определены в ``django.db.transaction``.

source: :exc:`TransactionManagementError` is raised for any and all problems related to database transactions.
ru: Исключение :exc:`TransactionManagementError` вызывается для всех проблем с транзакциями в базе данных.

source: Testing Framework Exceptions
ru: Исключения, используемые в тестах

source: Exceptions provided by the ``django.test`` package.
ru: Ошибки HTTP определенны в ``django.test``.

source: :exc:`~client.RedirectCycleError` is raised when the test client detects a loop or an overly long chain of redirects.
ru: Исключение :exc:`~client.RedirectCycleError` вызывается, если тестовый клиент определил циклическое перенаправление или очень длинную цепочку перенаправлений.

source: Python Exceptions
ru: Исключения Python

source: Django raises built-in Python exceptions when appropriate as well. See the Python documentation for further information on the :ref:`bltin-exceptions`.
ru: Django вызывает встроенные исключения Python когда это требуется. Обратитесь к документации Python для получения более подробной информации :ref:`bltin-exceptions`.
