Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/settings.po
Languages: ru

source: Settings
ru: Настройки проекта

source: Be careful when you override settings, especially when the default value is a non-empty tuple or dictionary, such as :setting:`MIDDLEWARE_CLASSES` and :setting:`STATICFILES_FINDERS`. Make sure you keep the components required by the features of Django you wish to use.
ru: Будьте осторожны при переопределении настроек, особенно если значение по умолчанию не пустой словарь или кортеж, например :setting:`MIDDLEWARE_CLASSES` и :setting:`STATICFILES_FINDERS`. Убедитесь, что настройка содержит все параметры необходимые для работы модулей Django, которые вы собираетесь использовать.

source: Core settings
ru: Основные настройки

source: Here's a list of settings available in Django core and their default values. Settings provided by contrib apps are listed below, followed by a topical index of the core settings. For introductory material, see the :doc:`settings topic guide </topics/settings>`.
ru: Это список основных настроек Django и их значений по умолчанию. Настройки стандартных приложений можно найти ниже.О настройках можно прочитать в :doc:`разделе о настройке Django </topics/settings>`.

source: Default: ``{}`` (Empty dictionary)
ru: По умолчанию: ``{}`` (Пустой словарь)

source: A dictionary mapping ``"app_label.model_name"`` strings to functions that take a model object and return its URL. This is a way of inserting or overriding ``get_absolute_url()`` methods on a per-installation basis. Example::
ru: Словарь, содержащий ключи в формате ``"app_label.model_name"`` к функциям, которые принимает объект указанной модели и возвращает ее URL. Эта настройка позволяет переопределить методы ``get_absolute_url()`` модели для конкретной установки проекта. Например::

source: Note that the model name used in this setting should be all lower-case, regardless of the case of the actual model class name.
ru: Заметим что название модели должно быть в нижнем регистре не смотря на реальное название класса модели.

source: ``ABSOLUTE_URL_OVERRIDES`` now works on models that don't declare ``get_absolute_url()``.
ru: ``ABSOLUTE_URL_OVERRIDES`` теперь работает для моделей, которые не содержат метод ``get_absolute_url()``.

source: Default: ``()`` (Empty tuple)
ru: По умолчанию: ``()`` (Пустой кортеж)

source: A tuple that lists people who get code error notifications. When ``DEBUG=False`` and a view raises an exception, Django will email these people with the full exception information. Each member of the tuple should be a tuple of (Full name, email address). Example::
ru: Кортеж содержит список людей, которые будут получать уведомления об ошибках. Если ``DEBUG=False`` и приложение вызывает исключение, Django отравить e-mail с информацией об исключении. Каждый элемент кортежа должен быть кортежем формата (Полное имя, e-mail). Например::

source: Note that Django will email *all* of these people whenever an error happens. See :doc:`/howto/error-reporting` for more information.
ru: Заметим, что Django отправит email *всем* при возникновении ошибки. Подробную информацию смотрите в разделе :doc:`/howto/error-reporting`.

source: Default: ``[]`` (Empty list)
ru: По умолчанию: ``[]`` (Пустой список)

source: A list of strings representing the host/domain names that this Django site can serve. This is a security measure to prevent an attacker from poisoning caches and password reset emails with links to malicious hosts by submitting requests with a fake HTTP ``Host`` header, which is possible even under many seemingly-safe web server configurations.
ru: Список хостов/доменов, для которых может работать текущий сайт. Это сделано для безопасности, чтобы обезопасить от внедрения в куки или письма для сброса пароля ссылок на сторонний сайт подменив HTTP заголовок ``Host``, что возможно при многих, казалось бы безопасных, конфигурациях сервера.

source: Values in this list can be fully qualified names (e.g. ``'www.example.com'``), in which case they will be matched against the request's ``Host`` header exactly (case-insensitive, not including port). A value beginning with a period can be used as a subdomain wildcard: ``'.example.com'`` will match ``example.com``, ``www.example.com``, and any other subdomain of ``example.com``. A value of ``'*'`` will match anything; in this case you are responsible to provide your own validation of the ``Host`` header (perhaps in a middleware; if so this middleware must be listed first in :setting:`MIDDLEWARE_CLASSES`).
ru: Список может содержать полное имя домена (например ``'www.example.com'``), тогда значение заголовка ``Host`` будет сравниваться с этим значением (проверка без учета регистра и порта). Значение для проверки и поддоменов: ``'.example.com'``, удовлетворяет ``example.com``, ``www.example.com``и всем поддоменам ``example.com``. Значение ``'*'`` принимает все значения, в этом случае вы сами должны проверять заголовок ``Host`` (возможно в middleware, при этом укажите его в :setting:`MIDDLEWARE_CLASSES`).

source: In previous versions of Django, if you wanted to also allow the `fully qualified domain name (FQDN)`_, which some browsers can send in the ``Host`` header, you had to explicitly add another ``ALLOWED_HOSTS`` entry that included a trailing period. This entry could also be a subdomain wildcard::
ru: В предыдущих версиях Django, если вы хотите также разрешить `полностью определённые имена доменов (FQDN) <http://ru.wikipedia.org/wiki/FQDN>`_, которые отсылают некоторые браузеры в заголовке ``Host`, вы должны явно указать их в ``ALLOWED_HOSTS``. Они могут содержать "wildcard"::

source: In Django 1.7, the trailing dot is stripped when performing host validation, thus an entry with a trailing dot isn't required.
ru: В Django 1.7, завершающая точка удаляется при выполнении проверки хоста, таким образом, нет необходимости ее добавлять.

source: If the ``Host`` header (or ``X-Forwarded-Host`` if :setting:`USE_X_FORWARDED_HOST` is enabled) does not match any value in this list, the :meth:`django.http.HttpRequest.get_host()` method will raise :exc:`~django.core.exceptions.SuspiciousOperation`.
ru: Если заголовок ``Host`` (или ``X-Forwarded-Host`` при :setting:`USE_X_FORWARDED_HOST`) не совпадает ни с одним значением, метод :meth:`django.http.HttpRequest.get_host()` вызовет исключение :exc:`~django.core.exceptions.SuspiciousOperation`.

source: When :setting:`DEBUG` is ``True`` or when running tests, host validation is disabled; any host will be accepted. Thus it's usually only necessary to set it in production.
ru: При :setting:`DEBUG` равном ``True`` и при выполнении тестов проверка отключена. Проверка обычно нужна только на боевом сервере.

source: This validation only applies via :meth:`~django.http.HttpRequest.get_host()`; if your code accesses the ``Host`` header directly from ``request.META`` you are bypassing this security protection.
ru: Проверка выполняется только в методе :meth:`~django.http.HttpRequest.get_host()`, если вы используете значение заголовка ``Host`` непосредственно из ``request.META``, проверка не будет выполнена.

source: This setting, along with the :ttag:`ssi` template tag, is deprecated and will be removed in Django 2.0.
ru: Эта настройка, как и шаблонный тег :ttag:`ssi`, устарела и будет удалена в Django 2.0.

source: You can also set the ``'allowed_include_roots'`` option in the :setting:`OPTIONS <TEMPLATES-OPTIONS>` of a ``DjangoTemplates`` backend instead.
ru: Вы также можете указать опцию ``'allowed_include_roots'`` в настройке :setting:`OPTIONS <TEMPLATES-OPTIONS>` для бэкенда ``DjangoTemplates``.

source: A tuple of strings representing allowed prefixes for the ``{% ssi %}`` template tag. This is a security measure, so that template authors can't access files that they shouldn't be accessing.
ru: Кортеж, который содержит список допустимых префиксов для аргумента шаблонного тега ``{% ssi %}``. Это мера безопасности, чтобы авторы шаблонов не имели доступа ко всем файлам.

source: For example, if :setting:`ALLOWED_INCLUDE_ROOTS` is ``('/home/html', '/var/www')``, then ``{% ssi /home/html/foo.txt %}`` would work, but ``{% ssi /etc/passwd %}`` wouldn't.
ru: Например, если :setting:`ALLOWED_INCLUDE_ROOTS` равна ``('/home/html', '/var/www')``, тогда ``{% ssi /home/html/foo.txt %}`` будет работать, а ``{% ssi /etc/passwd %}`` не будет.

source: Default: ``True``
ru: По умолчанию: ``True``

source: When set to ``True``, if the request URL does not match any of the patterns in the URLconf and it doesn't end in a slash, an HTTP redirect is issued to the same URL with a slash appended. Note that the redirect may cause any data submitted in a POST request to be lost.
ru: Если равна ``True`` и запрошенный URL не удовлетворяет ни одному URL-шаблону из URLconf и URL не заканчивается косой чертой, Django верен HTTP перенаправление на этот же URL но с косой чертой в конце. Заметим что такое перенаправление может привести к потере всех данных при POST запросе.

source: The :setting:`APPEND_SLASH` setting is only used if :class:`~django.middleware.common.CommonMiddleware` is installed (see :doc:`/topics/http/middleware`). See also :setting:`PREPEND_WWW`.
ru: Настройка :setting:`APPEND_SLASH` используется только вместе с :class:`~django.middleware.common.CommonMiddleware` (смотрите :doc:`/topics/http/middleware`). Смотрите :setting:`PREPEND_WWW`.

source: Default::
ru: По умолчанию::

source: A dictionary containing the settings for all caches to be used with Django. It is a nested dictionary whose contents maps cache aliases to a dictionary containing the options for an individual cache.
ru: Словарь, содержащий настройки для всех механизмов кэширования Django, используемых в проекте. Содержит псевдонимы кэшей и словарь с настройками для каждого.

source: The :setting:`CACHES` setting must configure a ``default`` cache; any number of additional caches may also be specified. If you are using a cache backend other than the local memory cache, or you need to define multiple caches, other options will be required. The following cache options are available.
ru: :setting:`CACHES` должна определять кэш ``default`` и любое количество дополнительных. При определении какого либо кэша кроме кэширования в памяти, вы должны указать дополнительные параметры. Вот полный список доступных настроек.

source: Default: ``''`` (Empty string)
ru: По умолчанию: ``''`` (Пустая строка)

source: The cache backend to use. The built-in cache backends are:
ru: Бэкенд кэширования, который используется. Django предоставляет следующие бэкенды:

source: You can use a cache backend that doesn't ship with Django by setting :setting:`BACKEND <CACHES-BACKEND>` to a fully-qualified path of a cache backend class (i.e. ``mypackage.backends.whatever.WhateverCache``).
ru: Вы можете использовать сторонние бэкэнды указав в :setting:`BACKEND <CACHE-BACKEND>` путь для импорта класса (например, ``mypackage.backends.whatever.WhateverCache``).

source: A string containing a dotted path to a function (or any callable) that defines how to compose a prefix, version and key into a final cache key. The default implementation is equivalent to the function::
ru: Путь для импорта функции, которая создает конечный ключ кэша из префикса, версии кэша и значения ключа. Функция по умолчанию выглядит следующим образом::

source: You may use any key function you want, as long as it has the same argument signature.
ru: Вы можете использовать любую функцию, которая принимает аналогичные аргументы.

source: See the :ref:`cache documentation <cache_key_transformation>` for more information.
ru: Подробности смотрите в разделе :ref:`Кэширование <cache_key_transformation>`.

source: A string that will be automatically included (prepended by default) to all cache keys used by the Django server.
ru: Строка, которая будет автоматически добавлена (по умолчанию в начало) ко всем ключам кэша используемых Django.

source: See the :ref:`cache documentation <cache_key_prefixing>` for more information.
ru: Подробности смотрите в разделе :ref:`Кэширование <cache_key_prefixing>`.

source: The location of the cache to use. This might be the directory for a file system cache, a host and port for a memcache server, or simply an identifying name for a local memory cache. e.g.::
ru: Расположение используемого кэша. Это может быть путь к каталогу при кэшировании в файле, название хоста и порт для memcache, или просто уникальное название для кэширования в памяти. Например::

source: Default: None
ru: По умолчанию: None

source: Extra parameters to pass to the cache backend. Available parameters vary depending on your cache backend.
ru: Дополнительные параметры для бэкенда кэширования. Доступные параметры зависят от используемого бэкенда кэширования.

source: Some information on available parameters can be found in the :doc:`Cache Backends </topics/cache>` documentation. For more information, consult your backend module's own documentation.
ru: Информацию о дополнительных параметрах можно найти в описании :doc:`бэкендов кэширования </topics/cache>`.

source: Default: 300
ru: По умолчанию: 300

source: The number of seconds before a cache entry is considered stale.
ru: Количество секунд до устаревания записи кэша.

source: If the value of this settings is ``None``, cache entries will not expire.
ru: Если значение равно ``None``, записи кэша не истекает.

source: Default: ``1``
ru: По умолчанию: ``1``

source: The default version number for cache keys generated by the Django server.
ru: Значения по умолчанию для версии кэша.

source: See the :ref:`cache documentation <cache_versioning>` for more information.
ru: Подробности смотрите в разделе :ref:`Кэширование <cache_versioning>`.

source: Default: ``default``
ru: По умолчанию: ``default``

source: The cache connection to use for the :ref:`cache middleware <the-per-site-cache>`.
ru: Подключение к кэшу которое используется :ref:`кэширующим промежуточным слоем <the-per-site-cache>`.

source: A string which will be prefixed to the cache keys generated by the :ref:`cache middleware <the-per-site-cache>`. This prefix is combined with the :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` setting; it does not replace it.
ru: Префикс, который будет добавлять для ключей в кэше, которые генерируются :ref:`кэширующим промежуточным слоем <the-per-site-cache>`. Этот префикс добавляется к значению :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`, а не заменяет его.

source: See :doc:`/topics/cache`.
ru: Смотрите :doc:`/topics/cache`.

source: Default: ``600``
ru: По умолчанию: ``600``

source: The default number of seconds to cache a page for the :ref:`cache middleware <the-per-site-cache>`.
ru: Период в секундах на который кэшируются по умолчанию страницы при использовании :ref:`кэширующего промежуточного слоя <the-per-site-cache>`.

source: Default: ``31449600`` (1 year, in seconds)
ru: По умолчанию: ``31449600`` (1 год, в секундах)

source: The age of CSRF cookies, in seconds.
ru: Время хранения CSRF куки в секундах.

source: The reason for setting a long-lived expiration time is to avoid problems in the case of a user closing a browser or bookmarking a page and then loading that page from a browser cache. Without persistent cookies, the form submission would fail in this case.
ru: Установка большего времени жизни для CSRF куки может быть необходима, если пользователь закрыл браузер, или добавил страницу в закладки, а потом загрузил страницу из кэша браузера. В без долгоживущей куки отправка форма приведет к ошибке.

source: Some browsers (specifically Internet Explorer) can disallow the use of persistent cookies or can have the indexes to the cookie jar corrupted on disk, thereby causing CSRF protection checks to fail (and sometimes intermittently). Change this setting to ``None`` to use session-based CSRF cookies, which keep the cookies in-memory instead of on persistent storage.
ru: Некоторые браузеры (в том числе Internet Explorer) могут запрещать использование постоянных кук, или могут содержать битый индекс кук на диске, что приведет к ошибке проверки CSRF. Установите в ``None``, чтобы использовать CSRF куки на основе сессии и хранить значение в памяти, а не постоянном хранилище.

source: Default: ``None``
ru: По умолчанию: ``None``

source: The domain to be used when setting the CSRF cookie. This can be useful for easily allowing cross-subdomain requests to be excluded from the normal cross site request forgery protection. It should be set to a string such as ``".example.com"`` to allow a POST request from a form on one subdomain to be accepted by a view served from another subdomain.
ru: Домен, используемый для CSRF кук. Может быть полезна при настройке кросс-субдоменных запросов. Настройка должна быть равна строке вида ``".example.com"``, чтобы разрешить обрабатывать POST запросы из одного субдомена в другой.

source: Please note that the presence of this setting does not imply that Django's CSRF protection is safe from cross-subdomain attacks by default - please see the :ref:`CSRF limitations <csrf-limitations>` section.
ru: Обратите внимание, что установка этой настройки не означает что CSRF защита Django сможет вас защитить от кросс-субдоменных атак - смотрите раздел об :ref:`ограничениях CSRF <csrf-limitations>`.

source: Default: ``False``
ru: По умолчанию: ``False``

source: Whether to use ``HttpOnly`` flag on the CSRF cookie. If this is set to ``True``, client-side JavaScript will not to be able to access the CSRF cookie.
ru: Использовать ли флаг ``HTTPOnly`` для CSRF куки. Если установлена в ``True``, JavaScript в браузере не будет иметь доступ к CSRF куке.

source: This can help prevent malicious JavaScript from bypassing CSRF protection. If you enable this and need to send the value of the CSRF token with Ajax requests, your JavaScript will need to pull the value from a hidden CSRF token form input on the page instead of from the cookie.
ru: Эта настройка может помочь обезвредить вредоносный JavaScript, который пытается обойти CSRF защиту. Если вы установили эту настройку и хотите передать CSRF токен при Ajax запросе, ваш JavaScript может получить его значение из скрытого поля формы, а не из CRSF куки.

source: See :setting:`SESSION_COOKIE_HTTPONLY` for details on ``HttpOnly``.
ru: В описании настройки :setting:`SESSION_COOKIE_HTTPONLY` вы можете найти подробности о ``HttpOnly``.

source: Default: ``'csrftoken'``
ru: По умолчанию: ``'csrftoken'``

source: The name of the cookie to use for the CSRF authentication token. This can be whatever you want. See :doc:`/ref/csrf`.
ru: Название куки, которая используется для передачи CSRF токена. Может быть каким угодно. Смотрите :doc:`/ref/csrf`.

source: Default: ``'/'``
ru: По умолчанию: ``'/'``

source: The path set on the CSRF cookie. This should either match the URL path of your Django installation or be a parent of that path.
ru: Путь(*пер.* path), который будет использоваться при установке CSRF кук. Путь должен соответствовать URL-у вашего проекта или быть родительским относительно него.

source: This is useful if you have multiple Django instances running under the same hostname. They can use different cookie paths, and each instance will only see its own CSRF cookie.
ru: Эта настройка может быть полезна если вы используете несколько проектов на одном домене. Они могут использовать различные пути для CSRF кук и каждый проект будет видеть только свои куки.

source: Whether to use a secure cookie for the CSRF cookie. If this is set to ``True``, the cookie will be marked as "secure," which means browsers may ensure that the cookie is only sent under an HTTPS connection.
ru: Указывает, использовать ли безопасные куки для CSRF. Если равна ``True``, куки будут помечены как "безопасные", это означает что браузер будет проверять отослана ли кука через HTTPS подключение.

source: Default: ``'django.views.csrf.csrf_failure'``
ru: По умолчанию: ``'django.views.csrf.csrf_failure'``

source: A dotted path to the view function to be used when an incoming request is rejected by the CSRF protection. The function should have this signature::
ru: Путь к функции представления, которое будет использоваться при отклонении запроса при CSRF проверке. Функция должна иметь следующую сигнатуру::

source: where ``reason`` is a short message (intended for developers or logging, not for end users) indicating the reason the request was rejected. See :doc:`/ref/csrf`.
ru: где ``reason`` -- короткое сообщение (предназначенное для разработчиков или логгирования, не для пользователей) описывающее причину отклонения запроса. Смотрите :doc:`/ref/csrf`.

source: A dictionary containing the settings for all databases to be used with Django. It is a nested dictionary whose contents maps database aliases to a dictionary containing the options for an individual database.
ru: Словарь содержащий настройки для всех баз данных, которые будут использоваться Django. Словарь содержит псевдонимы используемых баз данных и словарь с настройками для каждой.

source: The :setting:`DATABASES` setting must configure a ``default`` database; any number of additional databases may also be specified.
ru: Настройка :setting:`DATABASES` должна определять базу данных с псевдонимом ``default`` и любое количество дополнительных баз данных.

source: The simplest possible settings file is for a single-database setup using SQLite. This can be configured using the following::
ru: Самый простой вариант настройки это одна SQLite база данных. Например::

source: When connecting to other database backends, such as MySQL, Oracle, or PostgreSQL, additional connection parameters will be required. See the :setting:`ENGINE <DATABASE-ENGINE>` setting below on how to specify other database types. This example is for PostgreSQL::
ru: При подключении к другим типам баз данных, таких как MySQL, Oracle или PostgreSQL, необходимы дополнительные параметры. Смотрите описание настройки :setting:`ENGINE <DATABASE-ENGINE>` ниже. Вот пример для PostgreSQL::

source: The following inner options that may be required for more complex configurations are available:
ru: Следующие настройки могут быть использовать при подключении к различным базам данных:

source: Set this to ``True`` to wrap each HTTP request in a transaction on this database. See :ref:`tying-transactions-to-http-requests`.
ru: Установите в ``True`` чтобы каждый HTTP запрос выполнялся в отдельной транзакции. Смотрите :ref:`tying-transactions-to-http-requests`.

source: Set this to ``False`` if you want to :ref:`disable Django's transaction management <deactivate-transaction-management>` and implement your own.
ru: Укажите ``False``, если хотите :ref:`отключить управление транзакциями в Django <deactivate-transaction-management>` и реализовать собственное.

source: The database backend to use. The built-in database backends are:
ru: Бэкенд базы данных. Django предоставляет следующие бэкенды:

source: You can use a database backend that doesn't ship with Django by setting ``ENGINE`` to a fully-qualified path (i.e. ``mypackage.backends.whatever``).
ru: Вы можете использовать сторонние бэкэнды указав в ``ENGINE`` путь для импорта (например, ``mypackage.backends.whatever``).

source: Which host to use when connecting to the database. An empty string means localhost. Not used with SQLite.
ru: Имя хоста используемого при подключении к базе данных. Пустая строка подразумевает localhost. Не используется для SQLite.

source: If this value starts with a forward slash (``'/'``) and you're using MySQL, MySQL will connect via a Unix socket to the specified socket. For example::
ru: Если значение начинается с прямого слэша (``'/'``) и используется MySQL, MySQL будет подключаться через Unix сокет к указанному сокету. Например::

source: If you're using MySQL and this value *doesn't* start with a forward slash, then this value is assumed to be the host.
ru: Если вы используете MySQL и значение *не* начинается с прямого слэша, значение будет использоваться как имя хоста.
