Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/settings.po
Languages: ru

source: A boolean that specifies whether to display numbers using a thousand separator. When :setting:`USE_L10N` is set to ``True`` and if this is also set to ``True``, Django will use the values of :setting:`THOUSAND_SEPARATOR` and :setting:`NUMBER_GROUPING` to format numbers.
ru: Указывает, использовать ли разделитель тысяч при отображении чисел. При :setting:`USE_L10N` равном ``True`` и если эта настройка равна ``True``, Django будет использовать значения :setting:`THOUSAND_SEPARATOR` и :setting:`NUMBER_GROUPING` при форматировании чисел.

source: See also :setting:`DECIMAL_SEPARATOR`, :setting:`NUMBER_GROUPING` and :setting:`THOUSAND_SEPARATOR`.
ru: Смотрите :setting:`DECIMAL_SEPARATOR`, :setting:`NUMBER_GROUPING` и :setting:`THOUSAND_SEPARATOR`.

source: A boolean that specifies if datetimes will be timezone-aware by default or not. If this is set to ``True``, Django will use timezone-aware datetimes internally. Otherwise, Django will use naive datetimes in local time.
ru: Указывает, используется ли часовой пояс. Пот ``True``, Django будет использовать объекты даты и времени с указанным часовым поясом. Иначе Django будет использовать объекты даты и времени без учета часового пояса.

source: See also :setting:`TIME_ZONE`, :setting:`USE_I18N` and :setting:`USE_L10N`.
ru: Смотрите :setting:`TIME_ZONE`, :setting:`USE_I18N` и :setting:`USE_L10N`.

source: The default :file:`settings.py` file created by :djadmin:`django-admin startproject <startproject>` includes ``USE_TZ = True`` for convenience.
ru: По умолчанию файл :file:`settings.py`, созданный :djadmin:`django-admin startproject <startproject>`, содержит ``USE_TZ = True``.

source: A boolean that specifies whether to use the X-Forwarded-Host header in preference to the Host header. This should only be enabled if a proxy which sets this header is in use.
ru: Указывает, использовать ли заголовок X-Forwarded-Host как более приоритетный чем Host. Включать только при использовании прокси, который устанавливает этот заголовок.

source: The full Python path of the WSGI application object that Django's built-in servers (e.g. :djadmin:`runserver`) will use. The :djadmin:`django-admin startproject <startproject>` management command will create a simple ``wsgi.py`` file with an ``application`` callable in it, and point this setting to that ``application``.
ru: Полный Python путь к объекту WSGI приложения, которое будет использовать встроенный сервер Django (например :djadmin:`runserver`). Команда :djadmin:`django-admin startproject <startproject>` создаст простой ``wsgi.py`` файл с функцией ``application``, и установит значение этой настройки на этот объект ``application``.

source: If not set, the return value of ``django.core.wsgi.get_wsgi_application()`` will be used. In this case, the behavior of :djadmin:`runserver` will be identical to previous Django versions.
ru: Если не указана, будет использовать результат выполнения ``django.core.wsgi.get_wsgi_application()``. В этом случае поведение :djadmin:`runserver` будет аналогичным предыдущим версиям Django.

source: Default: ``'F Y'``
ru: По умолчанию: ``'F Y'``

source: The default formatting to use for date fields on Django admin change-list pages -- and, possibly, by other parts of the system -- in cases when only the year and month are displayed.
ru: Формат по умолчанию для полей даты при отображении значении в интерфейсе администратора Django и, возможно, в других частях системы в случае, если отображается только год и месяц.

source: For example, when a Django admin change-list page is being filtered by a date drilldown, the header for a given month displays the month and the year. Different locales have different formats. For example, U.S. English would say "January 2006," whereas another locale might say "2006/January."
ru: Например, если отфильтровать страницу списка объектов в интерфейсе администратора по месяцу, название страницы будет содержать год и месяц. Различные локали содержат различные форматы даты. Например, для U.S. English будет отображаться “January 2006”, в то время как для другой локали это может быть - “2006/January”.

source: See :tfilter:`allowed date format strings <date>`. See also :setting:`DATE_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`TIME_FORMAT` and :setting:`MONTH_DAY_FORMAT`.
ru: Смотрите :tfilter:`доступные форматы <date>`. Также смотрите :setting:`DATE_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`TIME_FORMAT` и :setting:`MONTH_DAY_FORMAT`.

source: Default: ``'SAMEORIGIN'``
ru: По умолчанию: ``'SAMEORIGIN'``

source: The default value for the X-Frame-Options header used by :class:`~django.middleware.clickjacking.XFrameOptionsMiddleware`. See the :doc:`clickjacking protection </ref/clickjacking/>` documentation.
ru: Значение по умолчанию для заголовка X-Frame-Options используемого :class:`~django.middleware.clickjacking.XFrameOptionsMiddleware`. Смотрите раздел о :doc:`clickjacking защите </ref/clickjacking/>`.

source: Settings for :mod:`django.contrib.auth`.
ru: Настройки для :mod:`django.contrib.auth`.

source: Default: ``('django.contrib.auth.backends.ModelBackend',)``
ru: По умолчанию: ``('django.contrib.auth.backends.ModelBackend',)``

source: A tuple of authentication backend classes (as strings) to use when attempting to authenticate a user. See the :ref:`authentication backends documentation <authentication-backends>` for details.
ru: Кортеж, который содержит классы бэкенда авторизации (строки с путем для импорта), которые используются при аутентификации пользователя. Смотрите раздел о :ref:`бэкендах аутентификации <authentication-backends>`.

source: Default: 'auth.User'
ru: По умолчанию: 'auth.User'

source: The model to use to represent a User. See :ref:`auth-custom-user`.
ru: Модель пользователя. Смотрите :ref:`auth-custom-user`.

source: You cannot change the AUTH_USER_MODEL setting during the lifetime of a project (i.e. once you have made and migrated models that depend on it) without serious effort. It is intended to be set at the project start, and the model it refers to must be available in the first migration of the app that it lives in. See :ref:`auth-custom-user` for more details.
ru: Вы не можете изменить эту настройку в процессе разработки проекта (то есть после создания и миграции моделей, которые ссылаются на указанную модель) без конкретного геморроя. Предполагается, что эта настройка будет добавлена при создании проекта, и модель, на которую она указывает, будет доступна в первой миграции приложения. Смотрите :ref:`auth-custom-user`.

source: Default: ``'/accounts/profile/'``
ru: По умолчанию: ``'/accounts/profile/'``

source: The URL where requests are redirected after login when the ``contrib.auth.login`` view gets no ``next`` parameter.
ru: URL куда перенаправляется пользователь поле авторизации пользователя в представлении ``contrib.auth.login``, если не передан параметр ``next``.

source: This is used by the :func:`~django.contrib.auth.decorators.login_required` decorator, for example.
ru: Используется декоратором :func:`~django.contrib.auth.decorators.login_required`, например.

source: This setting also accepts view function names and :ref:`named URL patterns <naming-url-patterns>` which can be used to reduce configuration duplication since you don't have to define the URL in two places (``settings`` and URLconf).
ru: Эта настройка так же принимает функцию представления или :ref:`имя URL-шаблона <naming-url-patterns>`, благодаря этому можно избежать дублирования определения URL-а (в ``settings`` и URLconf).

source: Default: ``'/accounts/login/'``
ru: По умолчанию: ``'/accounts/login/'``

source: The URL where requests are redirected for login, especially when using the :func:`~django.contrib.auth.decorators.login_required` decorator.
ru: URL, на который перенаправляются пользователи для авторизации, особенно при использовании декоратора :func:`~django.contrib.auth.decorators.login_required`.

source: Default: ``'/accounts/logout/'``
ru: По умолчанию: ``'/accounts/logout/'``

source: LOGIN_URL counterpart.
ru: Аналогичен LOGIN_URL.

source: Default: ``3``
ru: По умолчанию: ``3``

source: The number of days a password reset link is valid for. Used by the :mod:`django.contrib.auth` password reset mechanism.
ru: Количество дней, в течении которых действует ссылка для сброса пароля. Используется модулем :mod:`django.contrib.auth`.

source: See :ref:`auth_password_storage`.
ru: Смотрите :ref:`auth_password_storage`.

source: Settings for :mod:`django.contrib.messages`.
ru: Настройки для :mod:`django.contrib.messages`.

source: Default: ``messages.INFO``
ru: По умолчанию: `messages.INFO`

source: Sets the minimum message level that will be recorded by the messages framework. See :ref:`message levels <message-level>` for more details.
ru: Определяет минимальный уровень сообщений, которые будут сохраняется фреймверком сообщений. Смотрите :ref:`описание уровней сообщений <message-level>`.

source: Important
ru: Важно

source: If desired, you may specify the numeric values for the constants directly according to the values in the above :ref:`constants table <message-level-constants>`.
ru: При желании, вы можете указать числовые значения для констант непосредственно в соответствии со значениями в приведенной выше :ref:`таблице констант<message-level-constants>`.

source: Default: ``'django.contrib.messages.storage.fallback.FallbackStorage'``
ru: По умолчанию: ``'django.contrib.messages.storage.fallback.FallbackStorage'``

source: Controls where Django stores message data. Valid values are:
ru: Указывает где Django хранит сообщения. Возможные значения:

source: See :ref:`message storage backends <message-storage-backends>` for more details.
ru: Смотрите :ref:`бэкенды для хранения сообщейний <message-storage-backends>`.

source: The backends that use cookies -- :class:`~django.contrib.messages.storage.cookie.CookieStorage` and :class:`~django.contrib.messages.storage.fallback.FallbackStorage` -- use the value of :setting:`SESSION_COOKIE_DOMAIN`, :setting:`SESSION_COOKIE_SECURE` and :setting:`SESSION_COOKIE_HTTPONLY` when setting their cookies.
ru: Бекенды использующие куки -- :class:`~django.contrib.messages.storage.cookie.CookieStorage` и :class:`~django.contrib.messages.storage.fallback.FallbackStorage` -- используют значения :setting:`SESSION_COOKIE_DOMAIN`, :setting:`SESSION_COOKIE_SECURE` и :setting:`SESSION_COOKIE_HTTPONLY` при добавлении кук.

source: This sets the mapping of message level to message tag, which is typically rendered as a CSS class in HTML. If you specify a value, it will extend the default. This means you only have to specify those values which you need to override. See :ref:`message-displaying` above for more details.
ru: Словарь определяющий соответствие уровня сообщения и тега, которые используются при генерации CSS классов. Указанные значения дополняют значения по умолчанию. То есть вам нужно указать только те, которые вы хотите переопределить. Смотреть :ref:`message-displaying`.

source: If you override ``MESSAGE_TAGS`` in your settings file and rely on any of the built-in constants, you must import the ``constants`` module directly to avoid the potential for circular imports, e.g.::
ru: Если вы переопределили ``MESSAGE_TAGS`` в настройках и используете встроенные значения, вам необходимо импортировать модуль ``constants``, чтобы избежать циклического импорта, например::

source: Sessions
ru: Сессия

source: Settings for :mod:`django.contrib.sessions`.
ru: Настройки для :mod:`django.contrib.sessions`.

source: If you're using :ref:`cache-based session storage <cached-sessions-backend>`, this selects the cache to use.
ru: При использовании :ref:`кэширующего бэкенда для сессии <cached-sessions-backend>`, указывает какой кэш использовать.

source: Default: ``1209600`` (2 weeks, in seconds)
ru: По умолчанию: ``1209600`` (2 недели в секундах)

source: The age of session cookies, in seconds.
ru: Время хранения сесионной куки в секундах.

source: The domain to use for session cookies. Set this to a string such as ``".example.com"`` (note the leading dot!) for cross-domain cookies, or use ``None`` for a standard domain cookie.
ru: Домен, используемый для сессионных кук. Используйте строку, например, ``".example.com"`` (обратите внимание на точку в начале!), для кросдоменних кук, или используйте ``None`` для стандартного домена.

source: Be cautious when updating this setting on a production site. If you update this setting to enable cross-domain cookies on a site that previously used standard domain cookies, existing user cookies will be set to the old domain. This may result in them being unable to log in as long as these cookies persist.
ru: Осторожно меняйте эту настройку на боевом сайте. Если вы измените ее, чтобы разрешить кросс-доменные куки на сайте, старые куки будут использовать старое значение домена. По этому все пользователя не будут авторизованы.

source: This setting also affects cookies set by :mod:`django.contrib.messages`.
ru: Также влияет на работу кук :mod:`django.contrib.messages`.

source: Whether to use ``HTTPOnly`` flag on the session cookie. If this is set to ``True``, client-side JavaScript will not to be able to access the session cookie.
ru: Использовать ли флаг ``HTTPOnly`` для сессионной куки. Если установлена в ``True``, JavaScript в браузере не будет иметь доступ к сессионной куке.

source: HTTPOnly_ is a flag included in a Set-Cookie HTTP response header. It is not part of the :rfc:`2109` standard for cookies, and it isn't honored consistently by all browsers. However, when it is honored, it can be a useful way to mitigate the risk of client side script accessing the protected cookie data.
ru: HTTPOnly_ -- флаг, добавляемый в HTTP заголовок, который устанавливает куки. Он не является частью стандарта для куки :rfc:`2109` и поддерживается не всеми браузерами. Однако, если он поддерживается, может помочь ограничить доступ клиентских скриптов к сессионным кукам.

source: Turning it on makes it less trivial for an attacker to escalate a cross-site scripting vulnerability into full hijacking of a user's session. There's not much excuse for leaving this off, either: if your code depends on reading session cookies from Javascript, you're probably doing it wrong.
ru: Эта настройка усложнит использование XSS уязвимости для кражи сессии пользователя. Нет важных причин, чтобы не включать эту опцию. Если вы читаете сессионную куку в Javascript, скорее всего вы делаете что-то не так.

source: Default: ``'sessionid'``
ru: По умолчанию: ``'sessionid'``

source: The name of the cookie to use for sessions. This can be whatever you want (but should be different from :setting:`LANGUAGE_COOKIE_NAME`).
ru: Название для сессионной куки. Может быть каким угодно (но не совпадать с :setting:`LANGUAGE_COOKIE_NAME`).

source: The path set on the session cookie. This should either match the URL path of your Django installation or be parent of that path.
ru: Путь(*пер.* path), который будет использоваться при установке сессионной куки. Путь должен соответствовать URL-у к вашему проекту или быть родительским относительно него.

source: This is useful if you have multiple Django instances running under the same hostname. They can use different cookie paths, and each instance will only see its own session cookie.
ru: Эта настройка может быть полезна если вы используете несколько проектов на одном домене. Они могут использовать различные пути для сессионных кук и каждый проект будет видеть только свою сессионную куку.

source: Whether to use a secure cookie for the session cookie. If this is set to ``True``, the cookie will be marked as "secure," which means browsers may ensure that the cookie is only sent under an HTTPS connection.
ru: Указывает использовать ли безопасные куки для сессии. Если равна ``True``, куки будут помечены как "безопасные", это означает что браузер будет проверять отослана ли кука через HTTPS подключение.

source: Since it's trivial for a packet sniffer (e.g. `Firesheep`_) to hijack a user's session if the session cookie is sent unencrypted, there's really no good excuse to leave this off. It will prevent you from using sessions on insecure requests and that's a good thing.
ru: Т.к. для снифера пакетов (например `Firesheep`_) очень легко украсть сессионную куку пользователя, если она отправляется в открытом виде, нет никаких важных причин выключать эту опцию. Эта опция отключит возможность использовать сессию для незащищенных запросов, что является хорошим подходом.

source: Default: ``django.contrib.sessions.backends.db``
ru: По умолчанию: ``django.contrib.sessions.backends.db``

source: Controls where Django stores session data. Included engines are:
ru: Указывает, где Django хранит сесионные данные. Возможные значения:

source: See :ref:`configuring-sessions` for more details.
ru: Подробности смотрите :ref:`configuring-sessions`.

source: Whether to expire the session when the user closes their browser. See :ref:`browser-length-vs-persistent-sessions`.
ru: Истекает ли сессия после закрытия браузера. Смотрите :ref:`browser-length-vs-persistent-sessions`.

source: If you're using file-based session storage, this sets the directory in which Django will store session data. When the default value (``None``) is used, Django will use the standard temporary directory for the system.
ru: Если вы используете файловое хранилище сессионных данных, эта настройка укажет Django каталог, в котором хранить данные. Если используется значение по умолчанию (``None``), Django будет использовать стандартный каталог для временных файлов вашей операционной системы.

source: Whether to save the session data on every request. If this is ``False`` (default), then the session data will only be saved if it has been modified -- that is, if any of its dictionary values have been assigned or deleted.
ru: Сохранять ли данные сессии при каждом запросе. При ``False`` (по умолчанию), данные сохраняются только при изменении.

source: Default: ``'django.contrib.sessions.serializers.JSONSerializer'``
ru: По умолчанию ``'django.contrib.sessions.serializers.JSONSerializer'``

source: Full import path of a serializer class to use for serializing session data. Included serializers are:
ru: Полный путь для импорта класса сериализатора сессионных данных. Есть несколько встроенных классов:

source: See :ref:`session_serialization` for details, including a warning regarding possible remote code execution when using :class:`~django.contrib.sessions.serializers.PickleSerializer`.
ru: Смотрите :ref:`session_serialization`, обратите внимание на опасность выполнения стороннего кода при использовании :class:`~django.contrib.sessions.serializers.PickleSerializer`.

source: Sites
ru: Сайты

source: Settings for :mod:`django.contrib.sites`.
ru: Настройки для :mod:`django.contrib.sites`.

source: The ID, as an integer, of the current site in the ``django_site`` database table. This is used so that application data can hook into specific sites and a single database can manage content for multiple sites.
ru: ID(число) текущего сайта в таблице ``django_site`` базы данных. Используется для привязки данных к конкретному сайту, что позволяет использовать один установленный проект для нескольких сайтов.

source: Static files
ru: Статические файлы

source: Settings for :mod:`django.contrib.staticfiles`.
ru: Настройки для :mod:`django.contrib.staticfiles`.

source: The absolute path to the directory where :djadmin:`collectstatic` will collect static files for deployment.
ru: Абсолютный путь к каталогу, в который :djadmin:`collectstatic` соберет все статические файлы.

source: Example: ``"/var/www/example.com/static/"``
ru: Например: ``"/var/www/example.com/static/"``

source: If the :doc:`staticfiles</ref/contrib/staticfiles>` contrib app is enabled (default) the :djadmin:`collectstatic` management command will collect static files into this directory. See the howto on :doc:`managing static files</howto/static-files/index>` for more details about usage.
ru: Если используется стандартное приложение :doc:`staticfiles</ref/contrib/staticfiles>` (по умолчанию), команда :djadmin:`collectstatic` соберет все статические файлы в указанном каталоге. Подробности смотрите в разделе о :doc:`работе со статическими файлами</howto/static-files/index>`.

source: This should be an (initially empty) destination directory for collecting your static files from their permanent locations into one directory for ease of deployment; it is **not** a place to store your static files permanently. You should do that in directories that will be found by :doc:`staticfiles</ref/contrib/staticfiles>`’s :setting:`finders<STATICFILES_FINDERS>`, which by default, are ``'static/'`` app sub-directories and any directories you include in :setting:`STATICFILES_DIRS`).
ru: Это должен быть каталог(изначально пустой), куда будут скопированы все статические файлы для более простой настройки сервера; это **не** каталог, в котором вы создаете статические файлы при разработке. Вы должны создавать статические файлы в каталогах, которые будут найдены :setting:`модулями поиска<STATICFILES_FINDERS>` :doc:`статических файлов</ref/contrib/staticfiles>`. По умолчанию это подкаталоги ``'static/'`` в приложениях и каталоги, указанные в :setting:`STATICFILES_DIRS`.

source: URL to use when referring to static files located in :setting:`STATIC_ROOT`.
ru: URL, указывающий на каталог со статическими файлами :setting:`STATIC_ROOT`.

source: Example: ``"/static/"`` or ``"http://static.example.com/"``
ru: Например: ``"/static/"`` или ``"http://static.example.com/"``

source: If not ``None``, this will be used as the base path for :ref:`asset definitions<form-asset-paths>` (the ``Media`` class) and the :doc:`staticfiles app</ref/contrib/staticfiles>`.
ru: Если не равен ``None``, будет использовать как базовый путь при :ref:`определении "media" файлов<form-asset-paths>` (класс ``Media``) и :doc:`приложением staticfiles</ref/contrib/staticfiles>`.

source: It must end in a slash if set to a non-empty value.
ru: Должна оканчиваться косой чертой, если не пустая.

source: You may need to :ref:`configure these files to be served in development <serving-static-files-in-development>` and will definitely need to do so :doc:`in production </howto/static-files/deployment>`.
ru: Возможно вам понадобится :ref:`настроить раздачу этих файлов dev-сервером <serving-static-files-in-development>` и обязательно сделать это для :doc:`боевого сервера </howto/static-files/deployment>`.

source: This setting defines the additional locations the staticfiles app will traverse if the ``FileSystemFinder`` finder is enabled, e.g. if you use the :djadmin:`collectstatic` or :djadmin:`findstatic` management command or use the static file serving view.
ru: Настройка указывать каталоги со статическими файлами, которые будут найдены при использовании ``FileSystemFinder``, например, при запуске команды :djadmin:`collectstatic` или :djadmin:`findstatic`, или при раздаче файлов встроенным представлением.

source: This should be set to a list or tuple of strings that contain full paths to your additional files directory(ies) e.g.::
ru: Можно указать список или кортеж строк, указывающих полный путь к каталогам с файлами, например::

source: Note that these paths should use Unix-style forward slashes, even on Windows (e.g. ``"C:/Users/user/mysite/extra_static_content"``).
ru: Заметим, что эти пути должны использовать прямые слэши, то есть быть в Unix-стиле, даже на Windows (например, ``"C:/Users/user/mysite/extra_static_content"``).

source: Prefixes (optional)
ru: Прификсы (необязательно)

source: In case you want to refer to files in one of the locations with an additional namespace, you can **optionally** provide a prefix as ``(prefix, path)`` tuples, e.g.::
ru: Вы можете указать префикс для каталога как кортеж ``(префикс, путь)``, например::
