Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/settings.po
Languages: ru

source: If you're using PostgreSQL, by default (empty :setting:`HOST`), the connection to the database is done through UNIX domain sockets ('local' lines in ``pg_hba.conf``). If your UNIX domain socket is not in the standard location, use the same value of ``unix_socket_directory`` from ``postgresql.conf``. If you want to connect through TCP sockets, set :setting:`HOST` to 'localhost' or '127.0.0.1' ('host' lines in ``pg_hba.conf``). On Windows, you should always define :setting:`HOST`, as UNIX domain sockets are not available.
ru: При использовании PostgreSQL, по умолчанию (при пустом :setting:`HOST`) подключение к базе данных будет выполнено через UNIX domain сокет ('local' в ``pg_hba.conf``). Если у вас UNIX domain сокеты находятся не в стандартном каталоге, укажите в этой настройке значение ``unix_socket_directory`` из ``postgresql.conf``. Если вы хотите использовать TCP сокеты, укажите в :setting:`HOST` 'localhost' или '127.0.0.1' ('host' в ``pg_hba.conf``). В Windows необходимо указать :setting:`HOST`, т.к. UNIX domain сокеты не доступны.

source: The name of the database to use. For SQLite, it's the full path to the database file. When specifying the path, always use forward slashes, even on Windows (e.g. ``C:/homes/user/mysite/sqlite3.db``).
ru: Название используемой базы данных. Для SQLite -- это полный путь к файлу базы данных. При указывании пути к файлу, всегда используйте обратные слэшы, даже на Windows (например, ``C:/homes/user/mysite/sqlite3.db``).

source: Default: ``0``
ru: По умолчанию: ``0``

source: The lifetime of a database connection, in seconds. Use ``0`` to close database connections at the end of each request — Django's historical behavior — and ``None`` for unlimited persistent connections.
ru: Время существования подключения к базе данных. При ``0`` подключение будет закрываться после каждого запроса — как это всегда работало в Django. При ``None`` подключение никогда не будет закрываться.

source: Extra parameters to use when connecting to the database. Available parameters vary depending on your database backend.
ru: Дополнительные параметры используемые при подключении к базе данных. Доступные параметры зависят от используемого бэкенда.

source: Some information on available parameters can be found in the :doc:`Database Backends </ref/databases>` documentation. For more information, consult your backend module's own documentation.
ru: Информацию о дополнительных параметрах можно найти в описании :doc:`Бэкендов базы данных </ref/databases>`.

source: The password to use when connecting to the database. Not used with SQLite.
ru: Пароль, используемый при подключении к базе данных. Не используется для SQLite.

source: The port to use when connecting to the database. An empty string means the default port. Not used with SQLite.
ru: Порт, используемый при подключении к базе данных. Пустая строка подразумевает порт по умолчанию. Не используется для SQLite.

source: The username to use when connecting to the database. Not used with SQLite.
ru: Имя пользователя используемое при подключении к базе данных. Не используется для SQLite.

source: All :setting:`TEST <DATABASE-TEST>` sub-entries used to be independent entries in the database settings dictionary, with a ``TEST_`` prefix. For backwards compatibility with older versions of Django, you can define both versions of the settings as long as they match. Further, ``TEST_CREATE``, ``TEST_USER_CREATE`` and ``TEST_PASSWD`` were changed to ``CREATE_DB``, ``CREATE_USER`` and ``PASSWORD`` respectively.
ru: Ранее все настройки :setting:`TEST <DATABASE-TEST>` задавались в словаре настроек базы данных с префиксом ``TEST_``. Для обратной совместимости со старыми версиями Django, вы можете указать настройки двумя способами, главное чтобы они совпадали. ``TEST_CREATE``, ``TEST_USER_CREATE`` и ``TEST_PASSWD`` были заменены на ``CREATE_DB``, ``CREATE_USER`` и ``PASSWORD`` соответственно.

source: Default: ``{}``
ru: По умолчанию: ``{}``

source: A dictionary of settings for test databases; for more details about the creation and use of test databases, see :ref:`the-test-database`. The following entries are available:
ru: Словарь с настройками для тестовой базы данных. Больше о создании и использовании тестовой базы данных смотрите в :ref:`the-test-database`. Можно использовать следующие настройки:

source: The character set encoding used to create the test database. The value of this string is passed directly through to the database, so its format is backend-specific.
ru: Кодировка(*пер.* character set encoding) используемая при создании тестовой базы данных. Значение передается непосредственно в базу данных, так что его формат зависит от используемой базы данных.

source: Supported for the PostgreSQL_ (``postgresql_psycopg2``) and MySQL_ (``mysql``) backends.
ru: Поддерживается PostgreSQL_ (``postgresql_psycopg2``) и MySQL_ (``mysql``) бэкендами.

source: The collation order to use when creating the test database. This value is passed directly to the backend, so its format is backend-specific.
ru: Порядок сортировки(*пер.* collation order), используемый при создании тестовой базы данных. Значение передается непосредственно в базу данных, так что его формат зависит от используемой базы данных.

source: Only supported for the ``mysql`` backend (see the `MySQL manual`_ for details).
ru: Поддерживается только ``mysql`` (подробности смотрите в `руководстве MySQL <http://dev.mysql.com/doc/refman/5.0/en/charset-database.html>`_).

source: Default: ``['default']``, for all databases other than ``default``, which has no dependencies.
ru: По умолчанию: ``['default']`` для всех используемых баз данных кроме ``default``, которая не имеет зависимостей.

source: The creation-order dependencies of the database. See the documentation on :ref:`controlling the creation order of test databases <topics-testing-creation-dependencies>` for details.
ru: Порядок создания баз данных. Подробности смотрите в разделе об :ref:`управлении созданием тестовых баз данных <topics-testing-creation-dependencies>`.

source: The alias of the database that this database should mirror during testing.
ru: Псевдоним базы данных, которую должна отображать конфигурируемая база данных при тестировании.

source: This setting exists to allow for testing of primary/replica (referred to as master/slave by some databases) configurations of multiple databases. See the documentation on :ref:`testing primary/replica configurations <topics-testing-primaryreplica>` for details.
ru: Эта настройка предназначена для тестирования master/slave конфигурации нескольких баз данных. Подробности смотрите в разделе о :ref:`тестировании master/slave конфигурации <topics-testing-primaryreplica>`.

source: The name of database to use when running the test suite.
ru: Название базы данных используемой при тестировании.

source: If the default value (``None``) is used with the SQLite database engine, the tests will use a memory resident database. For all other database engines the test database will use the name ``'test_' + DATABASE_NAME``.
ru: Если указано значение по умолчанию (``None``) для SQLite, будет использована база данных в памяти. Для всех остальных баз данных будет использоваться ``'test_' + DATABASE_NAME``.

source: See :ref:`the-test-database`.
ru: Смотрите :ref:`the-test-database`.

source: Boolean value to control whether or not the default test runner serializes the database into an in-memory JSON string before running tests (used to restore the database state between tests if you don't have transactions). You can set this to ``False`` to speed up creation time if you don't have any test classes with :ref:`serialized_rollback=True <test-case-serialized-rollback>`.
ru: Указывает сериализировать ли содержимое базы данных в JSON в памяти перед запуском тестов (используется для восстановления состояния базы данных между тестами, если не поддерживаются транзакции). Используется стандартным механизмом выполнения тестов Django. Вы можете указать ``False``, чтобы ускорить выполнение тестов, если у вас нет тестов с :ref:`serialized_rollback=True <test-case-serialized-rollback>`.

source: This is an Oracle-specific setting.
ru: Эта настройка используется Oracle.

source: If it is set to ``False``, the test tablespaces won't be automatically created at the beginning of the tests and dropped at the end.
ru: Если равно ``False``, табличное пространство(*пер.* tablespace) не будет создано на время выполнения тестов.

source: If it is set to ``False``, the test user won't be automatically created at the beginning of the tests and dropped at the end.
ru: При ``False`` тестовый пользователь не будет создаваться на время выполнения тестов.

source: The username to use when connecting to the Oracle database that will be used when running tests. If not provided, Django will use ``'test_' + USER``.
ru: Имя пользователя, которое будет использоваться Oracle при подключении к базе данных во время выполнения тестов. Если не указано, Django будет использовать ``'test_' + USER``.

source: The password to use when connecting to the Oracle database that will be used when running tests. If not provided, Django will use a hardcoded default value.
ru: Пароль, который будет использоваться Oracle при подключении к базе данных во время выполнения тестов. Если значение не установлено Django будет использовать "захардкоденное" значение по умолчанию.

source: The name of the tablespace that will be used when running tests. If not provided, Django will use ``'test_' + USER``.
ru: Название табличного пространства(*пер.* tablespace), которое будет использоваться во время выполнения тестов. Если не указано, Django будет использовать ``'test_' + USER``.

source: Previously Django used ``'test_' + NAME`` if not provided.
ru: Ранее использовалось ``'test_' + NAME``, если значение не было указано.

source: The name of the temporary tablespace that will be used when running tests. If not provided, Django will use ``'test_' + USER + '_temp'``.
ru: Название временного табличного пространства(*пер.* temporary tablespace), которое будет использоваться во время выполнения тестов. Если не указано, Django будет использовать ``'test_' + USER + '_temp'``.

source: Previously Django used ``'test_' + NAME + '_temp'`` if not provided.
ru: Ранее использовалось ``'test_' + NAME + '_temp'``, если значение не было указано.

source: The name of the datafile to use for the TBLSPACE. If not provided, Django will use ``TBLSPACE + '.dbf'``.
ru: Название для файла с данными(datafile), который будет использоваться для TBLSPACE. Если не указан, Django будет использовать ``TBLSPACE + '.dbf'``.

source: The name of the datafile to use for the TBLSPACE_TMP. If not provided, Django will use ``TBLSPACE_TMP + '.dbf'``.
ru: Название для файла с данными(datafile), который будет использоваться для TBLSPACE_TMP. Если не указан, Django будет использовать ``TBLSPACE_TMP + '.dbf'``.

source: Default: ``'500M'``
ru: По умолчанию: ``'500M'``

source: The previous value was 200M and was not user customizable.
ru: Ранее использовалось значение 200M и его нельзя было настроить.

source: The maximum size that the DATAFILE is allowed to grow to.
ru: Максимальный размер DATAFILE.

source: The maximum size that the DATAFILE_TMP is allowed to grow to.
ru: Максимальный размер DATAFILE_TMP.

source: Use the :setting:`CHARSET <TEST_CHARSET>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`CHARSET <TEST_CHARSET>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`COLLATION <TEST_COLLATION>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`COLLATION <TEST_COLLATION>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`DEPENDENCIES <TEST_DEPENDENCIES>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`DEPENDENCIES <TEST_DEPENDENCIES>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`MIRROR <TEST_MIRROR>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`MIRROR <TEST_MIRROR>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`NAME <TEST_NAME>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`NAME <TEST_NAME>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`CREATE_DB <TEST_CREATE>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`CREATE_DB <TEST_CREATE>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`USER <TEST_USER>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`USER <TEST_USER>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`CREATE_USER <TEST_USER_CREATE>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`CREATE_USER <TEST_USER_CREATE>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`PASSWORD <TEST_PASSWD>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`PASSWORD <TEST_PASSWD>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`TBLSPACE <TEST_TBLSPACE>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`TBLSPACE <TEST_TBLSPACE>` в :setting:`TEST <DATABASE-TEST>`.

source: Use the :setting:`TBLSPACE_TMP <TEST_TBLSPACE_TMP>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Используйте :setting:`TBLSPACE_TMP <TEST_TBLSPACE_TMP>` в :setting:`TEST <DATABASE-TEST>`.

source: The list of routers that will be used to determine which database to use when performing a database queries.
ru: Список маршрутизаторов(*пер.* routers), которые будут использоваться для определения какую базу данных использовать при выполнении запроса.

source: See the documentation on :ref:`automatic database routing in multi database configurations <topics-db-multi-db-routing>`.
ru: Подробности смотрите в разделе :ref:`Автоматическая маршрутизация при использовании нескольких баз данных <topics-db-multi-db-routing>`.

source: Default: ``'N j, Y'`` (e.g. ``Feb. 4, 2003``)
ru: По умолчанию: ``'N j, Y'`` (например, ``Feb. 4, 2003``)

source: The default formatting to use for displaying date fields in any part of the system. Note that if :setting:`USE_L10N` is set to ``True``, then the locale-dictated format has higher precedence and will be applied instead. See :tfilter:`allowed date format strings <date>`.
ru: Формат по умолчанию для отображение значений полей даты в любой части системы. Заметим, если :setting:`USE_L10N` равна ``True``, будет использоваться формат даты текущей локали, если он указан в файлах локализации. Формат значения смотрите в :tfilter:`описании фильтра date <date>`.

source: See also :setting:`DATETIME_FORMAT`, :setting:`TIME_FORMAT` and :setting:`SHORT_DATE_FORMAT`.
ru: Смотрите :setting:`DATETIME_FORMAT`, :setting:`TIME_FORMAT` и :setting:`SHORT_DATE_FORMAT`.

source: A tuple of formats that will be accepted when inputting data on a date field. Formats will be tried in order, using the first valid one. Note that these format strings use Python's datetime_ module syntax, not the format strings from the ``date`` Django template tag.
ru: Кортеж содержащий форматы даты, которые доступны в поле даты формы. Форматы проверяются в указанном порядке, используется первый подходящий. Заметим что эти строки используют `формат datetime Python <http://docs.python.org/library/datetime.html#strftime-strptime-behavior>`_, а не формат шаблонного тега ``date``.

source: When :setting:`USE_L10N` is ``True``, the locale-dictated format has higher precedence and will be applied instead.
ru: При :setting:`USE_L10N` равном ``True``, формат даты текущей локали имеет больший приоритет.

source: See also :setting:`DATETIME_INPUT_FORMATS` and :setting:`TIME_INPUT_FORMATS`.
ru: Смотрите :setting:`DATETIME_INPUT_FORMATS` и :setting:`TIME_INPUT_FORMATS`.

source: Default: ``'N j, Y, P'`` (e.g. ``Feb. 4, 2003, 4 p.m.``)
ru: По умолчанию: ``'N j, Y, P'`` (например ``Feb. 4, 2003, 4 p.m.``)

source: The default formatting to use for displaying datetime fields in any part of the system. Note that if :setting:`USE_L10N` is set to ``True``, then the locale-dictated format has higher precedence and will be applied instead. See :tfilter:`allowed date format strings <date>`.
ru: Формат по умолчанию для отображение значений полей даты и времени в любой части системы. Заметим, если :setting:`USE_L10N` равна ``True``, будет использоваться формат даты текущей локали, если он указан в файлах локализации. Формат значения смотрите в :tfilter:`описании фильтра date <date>`.

source: See also :setting:`DATE_FORMAT`, :setting:`TIME_FORMAT` and :setting:`SHORT_DATETIME_FORMAT`.
ru: Смотрите :setting:`DATETIME_FORMAT`, :setting:`TIME_FORMAT` и :setting:`SHORT_DATETIME_FORMAT`.

source: A tuple of formats that will be accepted when inputting data on a datetime field. Formats will be tried in order, using the first valid one. Note that these format strings use Python's datetime_ module syntax, not the format strings from the ``date`` Django template tag.
ru: Кортеж содержащий форматы даты, которые доступны в поле даты и времени формы. Форматы проверяются в указанном порядке, используется первый подходящий. Заметим что эти строки используют `формат datetime Python <http://docs.python.org/library/datetime.html#strftime-strptime-behavior>`_, а не формат шаблонного тега ``date``.

source: See also :setting:`DATE_INPUT_FORMATS` and :setting:`TIME_INPUT_FORMATS`.
ru: Смотрите :setting:`DATE_INPUT_FORMATS` и :setting:`TIME_INPUT_FORMATS`.

source: A boolean that turns on/off debug mode.
ru: Включает/выключает режим отладки.

source: Never deploy a site into production with :setting:`DEBUG` turned on.
ru: Никогда не включайте :setting:`DEBUG` на "боевом" сервере.

source: Did you catch that? NEVER deploy a site into production with :setting:`DEBUG` turned on.
ru: Вы уловили это? НИКОГДА не устанавливайте проект на "боевом" сервере с включенным :setting:`DEBUG`.

source: One of the main features of debug mode is the display of detailed error pages. If your app raises an exception when :setting:`DEBUG` is ``True``, Django will display a detailed traceback, including a lot of metadata about your environment, such as all the currently defined Django settings (from ``settings.py``).
ru: Одна из особенностей режима отладки -- отображение подробной страницы с ошибкой. Если ваше приложение вызывает исключение при ``DEBUG`` равном ``True``, Django покажет подробную отладочную информацию включая различные мета-данные об окружении, такие как настройки проекта (из ``settings.py``).

source: As a security measure, Django will *not* include settings that might be sensitive (or offensive), such as :setting:`SECRET_KEY`. Specifically, it will exclude any setting whose name includes any of the following:
ru: В целях безопасности Django *не* включает небезопасные настройки, такие как :setting:`SECRET_KEY`. В том числе не отображаются настройки, которые содержат в названии следующее:

source: Note that these are *partial* matches. ``'PASS'`` will also match PASSWORD, just as ``'TOKEN'`` will also match TOKENIZED and so on.
ru: Заметим, учитывается *частичное* совпадение. ``'PASS'`` учитывает PASSWORD, также как и ``'TOKEN'`` учитывает TOKENIZED и так далее.

source: Still, note that there are always going to be sections of your debug output that are inappropriate for public consumption. File paths, configuration options and the like all give attackers extra information about your server.
ru: Помните, что в любом случае страница с ошибкой будет содержать небезопасные данные при включенном режиме отладки. Пути к различным файлам, настройки и другая информация будет доступна для желающих атаковать ваш сайт.

source: It is also important to remember that when running with :setting:`DEBUG` turned on, Django will remember every SQL query it executes. This is useful when you're debugging, but it'll rapidly consume memory on a production server.
ru: Также при включенном :setting:`DEBUG`, Django запоминает каждый выполненный SQL запрос. Это полезно при отладке, но на сервере может занять много памяти.

source: Finally, if :setting:`DEBUG` is ``False``, you also need to properly set the :setting:`ALLOWED_HOSTS` setting. Failing to do so will result in all requests being returned as "Bad Request (400)".
ru: Также при :setting:`DEBUG` равном ``False``, необходимо правильно указать :setting:`ALLOWED_HOSTS`. Иначе все запросы будут возвращать "Bad Request (400)".

source: If set to True, Django's normal exception handling of view functions will be suppressed, and exceptions will propagate upwards. This can be useful for some test setups, and should never be used on a live site.
ru: При ``True`` стандартная обработка исключений в Django не будет использована и исключение будет "передано далее". Это может быть полезным при разработке но не должно быть использовано на "боевом" сервере.

source: Default: ``'.'`` (Dot)
ru: По умолчанию: ``'.'`` (Точка)

source: Default decimal separator used when formatting decimal numbers.
ru: Десятичный разделитель, который используется при форматировании десятичных чисел.

source: Note that if :setting:`USE_L10N` is set to ``True``, then the locale-dictated format has higher precedence and will be applied instead.
ru: Заметим, при :setting:`USE_L10N` равном ``True``, будет использовано значение из настроек локали.

source: See also :setting:`NUMBER_GROUPING`, :setting:`THOUSAND_SEPARATOR` and :setting:`USE_THOUSAND_SEPARATOR`.
ru: Смотрите :setting:`NUMBER_GROUPING`, :setting:`THOUSAND_SEPARATOR` и :setting:`USE_THOUSAND_SEPARATOR`.

source: Default: ``'utf-8'``
ru: По умолчанию: ``'utf-8'``

source: Default charset to use for all ``HttpResponse`` objects, if a MIME type isn't manually specified. Used with :setting:`DEFAULT_CONTENT_TYPE` to construct the ``Content-Type`` header.
ru: Кодировка, которая используется по умолчанию для объектов ``HttpResponse`` если MIME-тип не указан явно. Используется вместе с :setting:`DEFAULT_CONTENT_TYPE` при установке заголовка ``Content-Type``.

source: Default: ``'text/html'``
ru: По умолчанию: ``'text/html'``

source: Default content type to use for all ``HttpResponse`` objects, if a MIME type isn't manually specified. Used with :setting:`DEFAULT_CHARSET` to construct the ``Content-Type`` header.
ru: Тип содержимого(*пер.* content type) , который используется по умолчанию для объектов ``HttpResponse`` если MIME-тип не указан явно. Используется вместе с :setting:`DEFAULT_CHARSET` при установке заголовка ``Content-Type``.

source: Default: :class:`django.views.debug.SafeExceptionReporterFilter`
ru: По умолчанию: :class:`django.views.debug.SafeExceptionReporterFilter`

source: Default exception reporter filter class to be used if none has been assigned to the :class:`~django.http.HttpRequest` instance yet. See :ref:`Filtering error reports<filtering-error-reports>`.
ru: Класс фильтра отчета об ошибке, который будет использоваться если не установлен другой для объекта :class:`~django.http.HttpRequest`. Смотрите :ref:`Фильтрация отчетов об ошибке <filtering-error-reports>`.

source: Default: :class:`django.core.files.storage.FileSystemStorage`
ru: По умолчанию: :class:`django.core.files.storage.FileSystemStorage`

source: Default file storage class to be used for any file-related operations that don't specify a particular storage system. See :doc:`/topics/files`.
ru: Класс хранилища файлов(*пер.* file storage), который будет использоваться по умолчанию для всех операций с файлами, если не используется конкретное файловое хранилище. Смотрите :doc:`/topics/files`.

source: Default: ``'webmaster@localhost'``
ru: По умолчанию: ``'webmaster@localhost'``
