Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/settings.po
Languages: ru

source: For example, assuming you have :setting:`STATIC_URL` set to ``'/static/'``, the :djadmin:`collectstatic` management command would collect the "stats" files in a ``'downloads'`` subdirectory of :setting:`STATIC_ROOT`.
ru: Предположим :setting:`STATIC_URL` равна ``'/static/'``, команда :djadmin:`collectstatic` добавит файлы "stats" в подкаталог ``'downloads'`` в :setting:`STATIC_ROOT`.

source: This would allow you to refer to the local file ``'/opt/webfiles/stats/polls_20101022.tar.gz'`` with ``'/static/downloads/polls_20101022.tar.gz'`` in your templates, e.g.:
ru: Вы сможете обратиться к файлу ``'/opt/webfiles/stats/polls_20101022.tar.gz'`` через ``'/static/downloads/polls_20101022.tar.gz'`` в шаблоне, например:

source: Default: ``'django.contrib.staticfiles.storage.StaticFilesStorage'``
ru: По умолчанию: ``'django.contrib.staticfiles.storage.StaticFilesStorage'``

source: The file storage engine to use when collecting static files with the :djadmin:`collectstatic` management command.
ru: Бэкенд для хранения файлов, используется при сборе файлов командой :djadmin:`collectstatic`.

source: A ready-to-use instance of the storage backend defined in this setting can be found at ``django.contrib.staticfiles.storage.staticfiles_storage``.
ru: Классы бэкендов можно найти в ``django.contrib.staticfiles.storage.staticfiles_storage``.

source: For an example, see :ref:`staticfiles-from-cdn`.
ru: Например, смотрите :ref:`staticfiles-from-cdn`.

source: The list of finder backends that know how to find static files in various locations.
ru: Бэкенды для поиска статических файлов.

source: The default will find files stored in the :setting:`STATICFILES_DIRS` setting (using ``django.contrib.staticfiles.finders.FileSystemFinder``) and in a ``static`` subdirectory of each app (using ``django.contrib.staticfiles.finders.AppDirectoriesFinder``). If multiple files with the same name are present, the first file that is found will be used.
ru: Бэкенды по умолчанию ищут файлы в каталогах указанных в настройке :setting:`STATICFILES_DIRS` (используя ``django.contrib.staticfiles.finders.FileSystemFinder``) и в подкаталоге ``static`` приложений (используя ``django.contrib.staticfiles.finders.AppDirectoriesFinder``). Если существует несколько файлов с одинаковым названием, будет использоваться первый найденный.

source: One finder is disabled by default: ``django.contrib.staticfiles.finders.DefaultStorageFinder``. If added to your :setting:`STATICFILES_FINDERS` setting, it will look for static files in the default file storage as defined by the :setting:`DEFAULT_FILE_STORAGE` setting.
ru: Один бэкенд отключен по умолчанию: ``django.contrib.staticfiles.finders.DefaultStorageFinder``. Он ищет файлы в бэкенде для хранения файлов указанном в настройке :setting:`DEFAULT_FILE_STORAGE`.

source: When using the ``AppDirectoriesFinder`` finder, make sure your apps can be found by staticfiles. Simply add the app to the :setting:`INSTALLED_APPS` setting of your site.
ru: При использовании ``AppDirectoriesFinder`` убедитесь, что ваше приложение может быть найдено командой. Просто добавьте его в настройку :setting:`INSTALLED_APPS`.

source: Static file finders are currently considered a private interface, and this interface is thus undocumented.
ru: Бэкенды для поиска файлов пока не предоставляют публичный задокументированный API.

source: Core Settings Topical Index
ru: Список основных настроек

source: Cache
ru: Кэш

source: Database
ru: База данных

source: Debugging
ru: Отладка

source: Error reporting
ru: Отправка ошибок

source: File uploads
ru: Загрузка файлов

source: Globalization (i18n/l10n)
ru: Локализация (i18n/l10n)

source: Security
ru: Безопасность

source: Logging
ru: Логгирование

source: Models
ru: Модели

source: Cross Site Request Forgery protection
ru: CSRF защита

source: Serialization
ru: Сериализация

source: Templates
ru: Шаблоны

source: Testing
ru: Тестирование

source: Database: :setting:`TEST <DATABASE-TEST>`
ru: База данных: :setting:`TEST <DATABASE-TEST>`

source: URLs
ru: URL-ы
