Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/settings.po
Languages: ru

source: Default: ``'django_language'``
ru: По умолчанию: ``'django_language'``

source: The name of the cookie to use for the language cookie. This can be whatever you want (but should be different from :setting:`SESSION_COOKIE_NAME`). See :doc:`/topics/i18n/index`.
ru: Название куки которая используется для хранения текущего языка. Может принимать какое угодно значение (но не должно совпадать с :setting:`SESSION_COOKIE_NAME`). Смотрите :doc:`/topics/i18n/index`.

source: Default: ``/``
ru: По умолчанию: ``/``

source: The path set on the language cookie. This should either match the URL path of your Django installation or be a parent of that path.
ru: Путь(*пер.* path), который будет использоваться при установке кук локализации. Путь должен соответствовать URL-у вашего проекта или быть родительским относительно него.

source: This is useful if you have multiple Django instances running under the same hostname. They can use different cookie paths and each instance will only see its own language cookie.
ru: Эта настройка может быть полезна если вы используете несколько проектов на одном домене. Они могут использовать различные пути для кук и каждый проект будет видеть только свои куки локализации.

source: Be cautious when updating this setting on a production site. If you update this setting to use a deeper path than it previously used, existing user cookies that have the old path will not be updated. This will result in site users being unable to switch the language as long as these cookies persist. The only safe and reliable option to perform the switch is to change the language cookie name permanently (via the :setting:`LANGUAGE_COOKIE_NAME` setting), and to add a middleware that copies the value from the old cookie to a new one and then deletes the one.
ru: Осторожно меняйте эту настройку на боевом сайте. Если вы измените ее, чтобы разрешить кросс-доменные куки на сайте, старые куки будут использовать старое значение домена. Это приведет к тому, что пользователи не смогут сменить текущую локаль, пока куки не устареют. Единственный вариант -- поменять название куки(через настройку :setting:`LANGUAGE_COOKIE_NAME`) и добавить мидлвар, который скопирует значение старой куки в новую и удалит старую куку.

source: Default: A tuple of all available languages. This list is continually growing and including a copy here would inevitably become rapidly out of date. You can see the current list of translated languages by looking in ``django/conf/global_settings.py`` (or view the `online source`_).
ru: По умолчанию: Кортеж всех доступных языков. Этот список постоянно растет по этому мы не приводим здесь значение. Текущий список вы можете посмотреть в файле ``django/conf/global_settings.py`` (или посмотреть `исходный код онлайн <https://code.djangoproject.com/browser/django/trunk/django/conf/global_settings.py>`_).

source: The list is a tuple of two-tuples in the format (:term:`language code<language code>`, ``language name``) -- for example, ``('ja', 'Japanese')``. This specifies which languages are available for language selection. See :doc:`/topics/i18n/index`.
ru: Кортеж содержит двухэлементные кортежи формата (:term:`код языка<language code>`, ``язык``), например ``('ja', 'Japanese')``. Эта настройка указывает доступные для выбора языки. Смотрите :doc:`/topics/i18n/index`.

source: Generally, the default value should suffice. Only set this setting if you want to restrict language selection to a subset of the Django-provided languages.
ru: В большинстве случаев значение по умолчанию подойдет для большинства проектов. Используйте это значение, если хотите ограничить доступные для проекта языки.

source: If you define a custom :setting:`LANGUAGES` setting, you can mark the language names as translation strings using the :func:`~django.utils.translation.ugettext_lazy` function.
ru: Если вы меняете :setting:`LANGUAGES`, можете определить названия языка как переводимую строку, используя функцию :func:`~django.utils.translation.ugettext_lazy`.

source: Here's a sample settings file::
ru: Вот пример настроек::

source: A tuple of directories where Django looks for translation files. See :ref:`how-django-discovers-translations`.
ru: Кортеж каталогов в которых Django ищет файлы перевода. Смотрите :ref:`how-django-discovers-translations`.

source: Example::
ru: Например::

source: Django will look within each of these paths for the ``<locale_code>/LC_MESSAGES`` directories containing the actual translation files.
ru: Django в каждом каталоге ищет подкаталог ``<locale_code>/LC_MESSAGES`` с файлами перевода.

source: Default: A logging configuration dictionary.
ru: По умолчанию: Словарь конфигурации логгирования.

source: A data structure containing configuration information. The contents of this data structure will be passed as the argument to the configuration method described in :setting:`LOGGING_CONFIG`.
ru: Структура данных, которая определяет конфигурацию логгирования. Содержимое будет передано в метод настройки логгирования указанный в :setting:`LOGGING_CONFIG`.

source: Among other things, the default logging configuration passes HTTP 500 server errors to an email log handler when :setting:`DEBUG` is ``False``. See also :ref:`configuring-logging`.
ru: Настройки по умолчанию все HTTP 500 ошибки отправляются в email обработчик при :setting:`DEBUG` равном ``False``. Смотрите также :ref:`configuring-logging`.

source: You can see the default logging configuration by looking in ``django/utils/log.py`` (or view the `online source`__).
ru: Стандартные настройки логгирования можно найти в файле ``django/utils/log.py`` (или `посмотреть онлайн <https://github.com/django/django/blob/1.6/django/utils/log.py>`_).

source: Default: ``'logging.config.dictConfig'``
ru: По умолчанию: ``'logging.config.dictConfig'``

source: A path to a callable that will be used to configure logging in the Django project. Points at a instance of Python's `dictConfig`_ configuration method by default.
ru: Путь для импорта функции, которая используется для настройки логгирования в проекте. Указывает на метод объекта Python `dictConfig <http://docs.python.org/library/logging.config.html#configuration-dictionary-schema>`_.

source: If you set :setting:`LOGGING_CONFIG` to ``None``, the logging configuration process will be skipped.
ru: Если :setting:`LOGGING_CONFIG` равно ``None``, настройки логгирования не будет выполняться.

source: Previously, the default value was ``'django.utils.log.dictConfig'``.
ru: Раньше значение по умолчанию было ``'django.utils.log.dictConfig'``.

source: A tuple in the same format as :setting:`ADMINS` that specifies who should get broken link notifications when :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` is enabled.
ru: Кортеж по формату аналогичен :setting:`ADMINS`, который определяет кто получает оповещение о "сломанных" ссылках при включенном :class:`~django.middleware.common.BrokenLinkEmailsMiddleware`.

source: Absolute filesystem path to the directory that will hold :doc:`user-uploaded files </topics/files>`.
ru: Абсолютный путь к каталогу, в котором хранятся медиа-файлы, используется для :doc:`работы с файлами </topics/files>`.

source: Example: ``"/var/www/example.com/media/"``
ru: Например: ``"/var/www/example.com/media/"``

source: See also :setting:`MEDIA_URL`.
ru: Смотрите :setting:`MEDIA_URL`.

source: :setting:`MEDIA_ROOT` and :setting:`STATIC_ROOT` must have different values. Before :setting:`STATIC_ROOT` was introduced, it was common to rely or fallback on :setting:`MEDIA_ROOT` to also serve static files; however, since this can have serious security implications, there is a validation check to prevent it.
ru: :setting:`MEDIA_ROOT` и :setting:`STATIC_ROOT` должны отличаться. Когда :setting:`STATIC_ROOT` только добавили, нормальным было указать :setting:`MEDIA_ROOT` на те самые файлы, однако, т.к. это потенциально не безопасно, добавлена проверка этих значений.

source: URL that handles the media served from :setting:`MEDIA_ROOT`, used for :doc:`managing stored files </topics/files>`. It must end in a slash if set to a non-empty value. You will need to :ref:`configure these files to be served <serving-uploaded-files-in-development>` in both development and production.
ru: URL который указывает на каталог :setting:`MEDIA_ROOT`, используется для :doc:`работы с файлами </topics/files>`. Должен оканчиваться слешом при не пустом значении. Вам необходимо :ref:`настроить раздачу этих файлов <serving-uploaded-files-in-development>` как dev-сервером, так и боевым.

source: If you want to use ``{{ MEDIA_URL }}`` in your templates, add ``'django.template.context_processors.media'`` in the ``'context_processors'`` option of :setting:`TEMPLATES`.
ru: Если вы хотите использовать ``{{ MEDIA_URL }}`` в шаблонах, добавьте ``'django.template.context_processors.media'`` в опцию ``'context_processors'`` настройки :setting:`TEMPLATES`.

source: Example: ``"http://media.example.com/"``
ru: Например: ``"http://media.example.com/"``

source: There are security risks if you are accepting uploaded content from untrusted users! See the security guide's topic on :ref:`user-uploaded-content-security` for mitigation details.
ru: Принимать загруженный контент от непроверенных пользователей -- опасно! Подробности смотрите в :ref:`user-uploaded-content-security`.

source: :setting:`MEDIA_URL` and :setting:`STATIC_URL` must have different values. See :setting:`MEDIA_ROOT` for more details.
ru: :setting:`MEDIA_URL` и :setting:`STATIC_URL` должны отличаться. Подробности смотрите в описании :setting:`MEDIA_ROOT`.

source: A tuple of middleware classes to use. See :doc:`/topics/http/middleware`.
ru: Кортеж, который состоит из путей для импорта используемых функциональных слоев(*пер.* middleware). Смотрите :doc:`/topics/http/middleware`.

source: :class:`~django.contrib.sessions.middleware.SessionMiddleware`, :class:`~django.contrib.auth.middleware.AuthenticationMiddleware`, and :class:`~django.contrib.messages.middleware.MessageMiddleware` were removed from this setting.
ru: :class:`~django.contrib.sessions.middleware.SessionMiddleware`, :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` и :class:`~django.contrib.messages.middleware.MessageMiddleware` были удалены из этой настройки.

source: A dictionary specifying the package where migration modules can be found on a per-app basis. The default value of this setting is an empty dictionary, but the default package name for migration modules is ``migrations``.
ru: Словарь, который указывает где искать миграции для приложений.По умолчанию ничего не содержит и миграцию ищутся в пакете ``migrations`` приложения.

source: In this case, migrations pertaining to the ``blog`` app will be contained in the ``blog.db_migrations`` package.
ru: В этом примере миграции для приложения ``blog`` содержатся в пакете ``blog.db_migrations``.

source: If you provide the ``app_label`` argument, :djadmin:`makemigrations` will automatically create the package if it doesn't already exist.
ru: Если вы укажите аргумент ``app_label``, :djadmin:`makemigrations` создаст этот пакет, если он не существует.

source: Default: ``'F j'``
ru: По умолчанию: ``'F j'``

source: The default formatting to use for date fields on Django admin change-list pages -- and, possibly, by other parts of the system -- in cases when only the month and day are displayed.
ru: Формат по умолчанию для полей даты при отображении значении в интерфейсе администратора Django и, возможно, в других частях системы в случае, если отображается только месяц и день.

source: For example, when a Django admin change-list page is being filtered by a date drilldown, the header for a given day displays the day and month. Different locales have different formats. For example, U.S. English would say "January 1," whereas Spanish might say "1 Enero."
ru: Например, если отфильтровать страницу списка объектов в интерфейсе администратора по дате, название страницы будет содержать месяц и день. Различные локали содержат различные форматы даты. Например, для U.S. English будет отображаться "January 1," для Spanish - "1 Enero."

source: Note that if :setting:`USE_L10N` is set to ``True``, then the corresponding locale-dictated format has higher precedence and will be applied.
ru: Заметим, при :setting:`USE_L10N` равном ``True``, значение текущей локали имеет больший приоритет и будет использоваться вместо настройки.

source: See :tfilter:`allowed date format strings <date>`. See also :setting:`DATE_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`TIME_FORMAT` and :setting:`YEAR_MONTH_FORMAT`.
ru: Смотрите :tfilter:`доступные форматы <date>`. Также смотрите :setting:`DATE_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`TIME_FORMAT` и :setting:`YEAR_MONTH_FORMAT`.

source: Number of digits grouped together on the integer part of a number.
ru: Количество цифр для группирования в целочисленной части числа.

source: Common use is to display a thousand separator. If this setting is ``0``, then no grouping will be applied to the number. If this setting is greater than ``0``, then :setting:`THOUSAND_SEPARATOR` will be used as the separator between those groups.
ru: Используется для разделителя тысяч при отображении чисел. При ``0``, цифры не будут группироваться. Если значение больше ``0``, :setting:`THOUSAND_SEPARATOR` будет использоваться как разделитель.

source: See also :setting:`DECIMAL_SEPARATOR`, :setting:`THOUSAND_SEPARATOR` and :setting:`USE_THOUSAND_SEPARATOR`.
ru: Смотрите :setting:`DECIMAL_SEPARATOR`, :setting:`THOUSAND_SEPARATOR` и :setting:`USE_THOUSAND_SEPARATOR`.

source: Whether to prepend the "www." subdomain to URLs that don't have it. This is only used if :class:`~django.middleware.common.CommonMiddleware` is installed (see :doc:`/topics/http/middleware`). See also :setting:`APPEND_SLASH`.
ru: Указывает добавлять ли поддомен "www." к URL-у, если он не содержит его. Работает только при использовании :class:`~django.middleware.common.CommonMiddleware` (смотрите :doc:`/topics/http/middleware`). Смотрите :setting:`APPEND_SLASH`.

source: A string representing the full Python import path to your root URLconf. For example: ``"mydjangoapps.urls"``. Can be overridden on a per-request basis by setting the attribute ``urlconf`` on the incoming ``HttpRequest`` object. See :ref:`how-django-processes-a-request` for details.
ru: Путь для импорта Python-модуля с главной конфигурацией URL-ов. Например: ``"mydjangoapps.urls"``. Может быть переопределена для конкретного запроса изменением атрибута ``urlconf`` объекта ``HttpRequest``. Подробности смотрите в :ref:`how-django-processes-a-request`.

source: A secret key for a particular Django installation. This is used to provide :doc:`cryptographic signing </topics/signing>`, and should be set to a unique, unpredictable value.
ru: Секретный ключ. Используется для :doc:`криптографической подписи </topics/signing>`, должен быть случайным и сложным для подбора.

source: :djadmin:`django-admin startproject <startproject>` automatically adds a randomly-generated ``SECRET_KEY`` to each new project.
ru: :djadmin:`django-admin startproject <startproject>` автоматом создает случайный ``SECRET_KEY`` для нового проекта.

source: Django will refuse to start if :setting:`SECRET_KEY` is not set.
ru: Django не запустится, если :setting:`SECRET_KEY` не указан.

source: **Keep this value secret.**
ru: **Храните это значение в секрете.**

source: Running Django with a known :setting:`SECRET_KEY` defeats many of Django's security protections, and can lead to privilege escalation and remote code execution vulnerabilities.
ru: Если :setting:`SECRET_KEY` станет кому-то известен, это позволит обойти различную защиту в Django.

source: The secret key is used for:
ru: Секретный ключ используется для:

source: All :doc:`sessions </topics/http/sessions>` if you are using any other session backend than ``django.contrib.sessions.backends.cache``, or if you use :class:`~django.contrib.auth.middleware.SessionAuthenticationMiddleware` and are using the default :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()`.
ru: Всех :doc:`сессий </topics/http/sessions>` при использовании любого бэкенда кроме ``django.contrib.sessions.backends.cache``, или при использовании :class:`~django.contrib.auth.middleware.SessionAuthenticationMiddleware` с :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()`.

source: All :doc:`messages </ref/contrib/messages>` if you are using :class:`~django.contrib.messages.storage.cookie.CookieStorage` or :class:`~django.contrib.messages.storage.fallback.FallbackStorage`.
ru: Всех :doc:`сообщений </ref/contrib/messages>`, если вы используете :class:`~django.contrib.messages.storage.cookie.CookieStorage` или :class:`~django.contrib.messages.storage.fallback.FallbackStorage`.

source: :mod:`Form wizard <formtools.wizard.views>` progress when using cookie storage with :class:`formtools.wizard.views.CookieWizardView`.
ru: Прогресс :mod:`мастера форм <formtools.wizard.views>`, если используются куки для хранения с :class:`formtools.wizard.views.CookieWizardView`.

source: All :func:`~django.contrib.auth.views.password_reset` tokens.
ru: Токены :func:`~django.contrib.auth.views.password_reset`.

source: All in progress :mod:`form previews <formtools.preview>`.
ru: Прогресс :mod:`превью форм <formtools.preview>`.

source: Any usage of :doc:`cryptographic signing </topics/signing>`, unless a different key is provided.
ru: Для :doc:`криптографической подписи </topics/signing>`, если не указан другой ключ.

source: If you rotate your secret key, all of the above will be invalidated. Secret keys are not used for passwords of users and key rotation will not affect them.
ru: Если вы поменяете секретный ключ, все предыдущие значения будут неверны. Секретный ключ не используется для хранения пароля пользователей и при смене они не будут сломаны.

source: If ``True``, the :class:`~django.middleware.security.SecurityMiddleware` sets the :ref:`x-xss-protection` header on all responses that do not already have it.
ru: При ``True`` :class:`~django.middleware.security.SecurityMiddleware` добавит заголовок :ref:`x-xss-protection` для всех ответов, которые еще не содержат его.

source: If ``True``, the :class:`~django.middleware.security.SecurityMiddleware` sets the :ref:`x-content-type-options` header on all responses that do not already have it.
ru: При ``True`` :class:`~django.middleware.security.SecurityMiddleware` добавит заголовок :ref:`x-content-type-options` для всех ответов, которые еще не содержат его.

source: If ``True``, the :class:`~django.middleware.security.SecurityMiddleware` adds the ``includeSubDomains`` tag to the :ref:`http-strict-transport-security` header. It has no effect unless :setting:`SECURE_HSTS_SECONDS` is set to a non-zero value.
ru: При ``True`` :class:`~django.middleware.security.SecurityMiddleware` добавляет тег ``includeSubDomains`` в заголовок :ref:`http-strict-transport-security`. Не имеет эффекта, если не указать в :setting:`SECURE_HSTS_SECONDS` значение отличное от ноля.

source: Setting this incorrectly can irreversibly (for some time) break your site. Read the :ref:`http-strict-transport-security` documentation first.
ru: Неправильная установка этих настроек может необратимо (в течение некоторого времени) сломать ваш сайт. Для начала ознакомьтесь с :ref:`http-strict-transport-security`.

source: If set to a non-zero integer value, the :class:`~django.middleware.security.SecurityMiddleware` sets the :ref:`http-strict-transport-security` header on all responses that do not already have it.
ru: Если указать не ноль, :class:`~django.middleware.security.SecurityMiddleware` добавит заголовок :ref:`http-strict-transport-security` для всех ответов, которые еще не содержат его.

source: A tuple representing a HTTP header/value combination that signifies a request is secure. This controls the behavior of the request object's ``is_secure()`` method.
ru: Кортеж из комбинаций HTTP заголовка/значения, которые определяют зашифрован ли запрос. Влияет на работу метода ``is_secure()`` объекта запроса.

source: This takes some explanation. By default, ``is_secure()`` is able to determine whether a request is secure by looking at whether the requested URL uses "https://". This is important for Django's CSRF protection, and may be used by your own code or third-party apps.
ru: Здесь требуются пояснения. По умолчанию, ``is_secure()`` определяет безопасен ли запрошенный URL(по наличию "https://"). Это важно для CSRF защиты, вы также можете использовать эту настройку.

source: If your Django app is behind a proxy, though, the proxy may be "swallowing" the fact that a request is HTTPS, using a non-HTTPS connection between the proxy and Django. In this case, ``is_secure()`` would always return ``False`` -- even for requests that were made via HTTPS by the end user.
ru: Если приложение Django находится за прокси, который использует не HTTPS соединение к проекту, будут утеряны данные о том, что запрос зашифрованный. В этом случае ``is_secure()`` всегда будет возвращать ``False`` -- даже для запросов, сделанных через HTTPS.

source: In this situation, you'll want to configure your proxy to set a custom HTTP header that tells Django whether the request came in via HTTPS, and you'll want to set ``SECURE_PROXY_SSL_HEADER`` so that Django knows what header to look for.
ru: В таком случае вам необходимо настроить прокси таким образом, чтобы добавлялись специальные HTTP заголовки для защищенных запросов, которые вы укажите в ``SECURE_PROXY_SSL_HEADER`` чтобы Django мог определить является запрос защищенным.

source: You'll need to set a tuple with two elements -- the name of the header to look for and the required value. For example::
ru: Необходимо указать кортеж из двух элементов -- название заголовка и значение. Например::

source: Here, we're telling Django that we trust the ``X-Forwarded-Proto`` header that comes from our proxy, and any time its value is ``'https'``, then the request is guaranteed to be secure (i.e., it originally came in via HTTPS). Obviously, you should *only* set this setting if you control your proxy or have some other guarantee that it sets/strips this header appropriately.
ru: В этом примере мы указываем Django, что можно доверять заголовку ``X-Forwarded-Proto`` пришедшему от прокси, и при значении ``'https'`` считать запрос защищенным (то есть он выполнен через HTTPS). Очевидно, что вы должны использовать эту настройку *только* если контролируете прокси-сервер и доверяете ему.

source: Note that the header needs to be in the format as used by ``request.META`` -- all caps and likely starting with ``HTTP_``. (Remember, Django automatically adds ``'HTTP_'`` to the start of x-header names before making the header available in ``request.META``.)
ru: Название заголовка должно быть в формате, используемом ``request.META`` -- в верхнем регистре и начинаться с ``HTTP_``. (Помните, Django автоматически добавляет ``'HTTP_'`` в начале к названию x-заголовка передо добавлением его в ``request.META``.)

source: **You will probably open security holes in your site if you set this without knowing what you're doing. And if you fail to set it when you should. Seriously.**
ru: **Возможн,о вы создадите уязвимость, если будете использовать эту настройку, не понимая как все работает. И если забудете указать ее тогда, когда это следует сделать. Будьте осторожны.**

source: Make sure ALL of the following are true before setting this (assuming the values from the example above):
ru: Убедитесь что ВСЕ следующие условия верны, перед тем как использовать эту настройку(предполагая, что используется значение из примера выше):

source: Your Django app is behind a proxy.
ru: Проект находится за прокси-сервером.
