Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/settings.po
Languages: ru

source: Default email address to use for various automated correspondence from the site manager(s). This doesn't include error messages sent to :setting:`ADMINS` and :setting:`MANAGERS`; for that, see :setting:`SERVER_EMAIL`.
ru: Email, используемый для при отправки различных автоматических рассылок от имени менеджера сайта. Не включает письма с ошибками на сайта для :setting:`ADMINS` и :setting:`MANAGERS`. Для таких писем используйте :setting:`SERVER_EMAIL`.

source: Default tablespace to use for indexes on fields that don't specify one, if the backend supports it (see :doc:`/topics/db/tablespaces`).
ru: Табличное пространство(*пер.* tablespace) используемое для индексов полей, которые не указывают явно значение. Используется если база данных поддерживает их (смотрите :doc:`/topics/db/tablespaces`).

source: Default tablespace to use for models that don't specify one, if the backend supports it (see :doc:`/topics/db/tablespaces`).
ru: Табличное пространство(*пер.* tablespace) используемое для моделей, которые не указывают явно значение. Используется если база данных поддерживает их (смотрите :doc:`/topics/db/tablespaces`).

source: List of compiled regular expression objects representing User-Agent strings that are not allowed to visit any page, systemwide. Use this for bad robots/crawlers. This is only used if ``CommonMiddleware`` is installed (see :doc:`/topics/http/middleware`).
ru: Список скомпилированных регулярных выражений, которые используются при фильтрации заголовка ``User-Agent`` для запрета доступа ко всем страницам сайта. Используйте для блокировки роботов/сканеров. Используется только при включенном ``CommonMiddleware`` (смотрите :doc:`/topics/http/middleware`).

source: Default: ``'django.core.mail.backends.smtp.EmailBackend'``
ru: По умолчанию: ``'django.core.mail.backends.smtp.EmailBackend'``

source: The backend to use for sending emails. For the list of available backends see :doc:`/topics/email`.
ru: Бэкенд, используемый для отправки электронных писем. Список доступных бэкендов смотрите в разделе :doc:`/topics/email`.

source: Default: Not defined
ru: По умолчанию: Не определена

source: The directory used by the ``file`` email backend to store output files.
ru: Каталог, используемый файловым бэкендом для отправки электронных писем.

source: Default: ``'localhost'``
ru: По умолчанию: ``'localhost'``

source: The host to use for sending email.
ru: Имя хоста используемое для отправки электронных писем.

source: See also :setting:`EMAIL_PORT`.
ru: Смотрите :setting:`EMAIL_PORT`.

source: Password to use for the SMTP server defined in :setting:`EMAIL_HOST`. This setting is used in conjunction with :setting:`EMAIL_HOST_USER` when authenticating to the SMTP server. If either of these settings is empty, Django won't attempt authentication.
ru: Пароль для подключения к SMTP сервера, который указан в :setting:`EMAIL_HOST`. Эта настройка используется вместе с :setting:`EMAIL_HOST_USER` для авторизации при подключении к SMTP серверу. Если эти настройки пустые, Django будет подключаться без авторизации.

source: See also :setting:`EMAIL_HOST_USER`.
ru: Смотрите :setting:`EMAIL_HOST_USER`.

source: Username to use for the SMTP server defined in :setting:`EMAIL_HOST`. If empty, Django won't attempt authentication.
ru: Имя пользователя используемое при подключении к SMTP серверу указанному в :setting:`EMAIL_HOST`. Если не указано, Django не будет выполнять авторизацию.

source: See also :setting:`EMAIL_HOST_PASSWORD`.
ru: Смотрите :setting:`EMAIL_HOST_PASSWORD`.

source: Default: ``25``
ru: По умолчанию: ``25``

source: Port to use for the SMTP server defined in :setting:`EMAIL_HOST`.
ru: Порт, используемый при подключении к SMTP серверу указанному в :setting:`EMAIL_HOST`.

source: Default: ``'[Django] '``
ru: По умолчанию: ``'[Django] '``

source: Subject-line prefix for email messages sent with ``django.core.mail.mail_admins`` or ``django.core.mail.mail_managers``. You'll probably want to include the trailing space.
ru: Префикс добавляемый к теме электронного письма отправленного функциями ``django.core.mail.mail_admins`` или ``django.core.mail.mail_managers``. Возможно, вы заходите добавить пробелы в конце.

source: Whether to use a TLS (secure) connection when talking to the SMTP server. This is used for explicit TLS connections, generally on port 587. If you are experiencing hanging connections, see the implicit TLS setting :setting:`EMAIL_USE_SSL`.
ru: Указывает использовать ли TLS (защищенное) соединение с SMTP сервером. Используется для явного использования TLS подключения, обычно к 587 порту. Если подключение не работает, используйте неявное TLS подключение указав :setting:`EMAIL_USE_SSL`.

source: Whether to use an implicit TLS (secure) connection when talking to the SMTP server. In most email documentation this type of TLS connection is referred to as SSL. It is generally used on port 465. If you are experiencing problems, see the explicit TLS setting :setting:`EMAIL_USE_TLS`.
ru: Указывает использовать ли неявное TLS (защищенное) соединение с SMTP сервером. В документации этот тип TLS подключения обычно называется SSL. По умолчанию использует 465 порт. Если подключение не работает, используйте явно TLS подключение указав :setting:`EMAIL_USE_TLS`.

source: Note that :setting:`EMAIL_USE_TLS`/:setting:`EMAIL_USE_SSL` are mutually exclusive, so only set one of those settings to ``True``.
ru: Обратите внимание, :setting:`EMAIL_USE_TLS`/:setting:`EMAIL_USE_SSL` взаимоисключающие, только одна настройка может быть ``True``.

source: If :setting:`EMAIL_USE_SSL` or :setting:`EMAIL_USE_TLS` is ``True``, you can optionally specify the path to a PEM-formatted certificate chain file to use for the SSL connection.
ru: Если :setting:`EMAIL_USE_SSL` или :setting:`EMAIL_USE_TLS` равна ``True``, вы можете указать путь к сертификату в PEM-формате, который будет использоваться при создании SSL подключения.

source: If :setting:`EMAIL_USE_SSL` or :setting:`EMAIL_USE_TLS` is ``True``, you can optionally specify the path to a PEM-formatted private key file to use for the SSL connection.
ru: Если :setting:`EMAIL_USE_SSL` или :setting:`EMAIL_USE_TLS` равна ``True``, вы можете указать путь к приватному ключу в формате PEM, который будет использоваться при создании SSL подключения.

source: Note that setting :setting:`EMAIL_SSL_CERTFILE` and :setting:`EMAIL_SSL_KEYFILE` doesn't result in any certificate checking. They're passed to the underlying SSL connection. Please refer to the documentation of Python's :func:`python:ssl.wrap_socket` function for details on how the certificate chain file and private key file are handled.
ru: Обратите внимание, никакой проверки сертификата не выполняется при указании настроек :setting:`EMAIL_SSL_CERTFILE` и :setting:`EMAIL_SSL_KEYFILE`. Они передаются в SSL подключение. Обратитесь к документации функции :func:`python:ssl.wrap_socket` Python, чтобы узнать подробности о работе с сертификатом и приватным ключем.

source: Specifies a timeout in seconds for blocking operations like the connection attempt.
ru: Указывает таймаут в секундах для блокирующих операций, таких как попытка подключения.

source: The character encoding used to decode any files read from disk. This includes template files and initial SQL data files.
ru: Кодировка используемая при декодировании файлов прочитанных с файловой системы. Это включает файлы шаблонов и инициализирующие SQL файлы.

source: A tuple of handlers to use for uploading. Changing this setting allows complete customization -- even replacement -- of Django's upload process.
ru: Кортеж обработчиков загрузки файлов. Можно изменить или полностью переопределить процесс загрузки в Django.

source: See :doc:`/topics/files` for details.
ru: Подробности смотрите :doc:`/topics/files`.

source: Default: ``2621440`` (i.e. 2.5 MB).
ru: По умолчанию: ``2621440`` (то есть 2.5 MB).

source: The maximum size (in bytes) that an upload will be before it gets streamed to the file system. See :doc:`/topics/files` for details.
ru: Максимальный размер (в байтах) загруженного файла, который будет храниться в памяти, а не сохраняться в файловой системе. Подробности смотрите :doc:`/topics/files`.

source: The numeric mode to apply to directories created in the process of uploading files.
ru: Права доступа в цифровом виде для каталогов, которые будут созданы при сохранении загруженных файлов.

source: This setting also determines the default permissions for collected static directories when using the :djadmin:`collectstatic` management command. See :djadmin:`collectstatic` for details on overriding it.
ru: Также используется для каталогов, которые будут созданы при сборке статических файлов командой :djadmin:`collectstatic`. Подробности смотрите в :djadmin:`collectstatic`.

source: This value mirrors the functionality and caveats of the :setting:`FILE_UPLOAD_PERMISSIONS` setting.
ru: Используется аналогично настройке :setting:`FILE_UPLOAD_PERMISSIONS`.

source: The numeric mode (i.e. ``0o644``) to set newly uploaded files to. For more information about what these modes mean, see the documentation for :func:`os.chmod`.
ru: Права доступа в цифровом виде (то есть ``0644``) которые назначаются новым загруженным файлам. Подробную информацию смотрите в описании функции :func:`os.chmod`.

source: If this isn't given or is ``None``, you'll get operating-system dependent behavior. On most platforms, temporary files will have a mode of ``0o600``, and files saved from memory will be saved using the system's standard umask.
ru: Если значение не указано или равно ``None``, поведение будет зависеть от операционной системы. На большинстве платформ временные файлы создаются с правами ``0o600``, а файлы, сохраненный из памяти, будут использовать umask системы.

source: For security reasons, these permissions aren't applied to the temporary files that are stored in :setting:`FILE_UPLOAD_TEMP_DIR`.
ru: Для безопасности эти права не применяются для временных файлов, которые сохраняются в :setting:`FILE_UPLOAD_TEMP_DIR`.

source: This setting also determines the default permissions for collected static files when using the :djadmin:`collectstatic` management command. See :djadmin:`collectstatic` for details on overriding it.
ru: Также используется для файлов, которые будут созданы при сборке статических файлов командой :djadmin:`collectstatic`. Подробности смотрите в :djadmin:`collectstatic`.

source: **Always prefix the mode with a 0.**
ru: **Это значение всегда должно начинаться с 0.**

source: If you're not familiar with file modes, please note that the leading ``0`` is very important: it indicates an octal number, which is the way that modes must be specified. If you try to use ``644``, you'll get totally incorrect behavior.
ru: Если вы не знакомы с правами доступа, обратите внимание что ``0`` очень важен: он означает восьмеричное число, которыми определяются права доступа. Если вы будете использовать ``644``, все будет работать не правильно.

source: The directory to store data (typically files larger than :setting:`FILE_UPLOAD_MAX_MEMORY_SIZE`) temporarily while uploading files. If ``None``, Django will use the standard temporary directory for the operating system. For example, this will default to ``/tmp`` on \*nix-style operating systems.
ru: Каталог, используемый для загрузки временных файлов (обычно файлы больше :setting:`FILE_UPLOAD_MAX_MEMORY_SIZE`). Если ``None``, Django будет использовать стандартный каталог временных файлов используемой операционной системы. Например, для \*nix-систем это ``/tmp``.

source: Default: ``0`` (Sunday)
ru: По умолчанию: ``0`` (Воскресение)

source: Number representing the first day of the week. This is especially useful when displaying a calendar. This value is only used when not using format internationalization, or when a format cannot be found for the current locale.
ru: Число указывающее первый день недели. Используется при отображении календаря. Это значение используется если не найдено значение используемой локали.

source: The value must be an integer from 0 to 6, where 0 means Sunday, 1 means Monday and so on.
ru: Значение должно быть целым числом от 0 до 6, где 0 означает Воскресение, 1 означает Понедельник.

source: List of directories searched for fixture files, in addition to the ``fixtures`` directory of each application, in search order.
ru: Список каталогов, в которых происходит поиск фикстур в дополнение к каталогам ``fixtures`` в приложениях.

source: Note that these paths should use Unix-style forward slashes, even on Windows.
ru: Заметим, что эти пути должны использовать прямые слэши, то есть быть в Unix-стиле, а не Windows.

source: See :ref:`initial-data-via-fixtures` and :ref:`topics-testing-fixtures`.
ru: Смотрите :ref:`initial-data-via-fixtures` и :ref:`topics-testing-fixtures`.

source: If not ``None``, this will be used as the value of the ``SCRIPT_NAME`` environment variable in any HTTP request. This setting can be used to override the server-provided value of ``SCRIPT_NAME``, which may be a rewritten version of the preferred value or not supplied at all.
ru: Если не ``None``, будет использоваться как значение переменной окружения ``SCRIPT_NAME`` при HTTP запросе. Это значение может использоваться для переопределения значения переменной ``SCRIPT_NAME`` предоставленного сервером.

source: A full Python path to a Python package that contains format definitions for project locales. If not ``None``, Django will check for a ``formats.py`` file, under the directory named as the current locale, and will use the formats defined on this file.
ru: Полный Python путь для импорта Python пакета, который содержит определение форматов для локалей. Если не ``None``, Django попытается найти файл ``formats.py`` в каталогах с названием текущей локали и использовать форматы определенные в этом файле.

source: For example, if :setting:`FORMAT_MODULE_PATH` is set to ``mysite.formats``, and current language is ``en`` (English), Django will expect a directory tree like::
ru: Например, если :setting:`FORMAT_MODULE_PATH` равна ``mysite.formats`` и текущая локаль ``en`` (Английский), Django будет искать следующий каталог::

source: You can also set this setting to a list of Python paths, for example::
ru: Вы также можете указать список путей Python::

source: When Django searches for a certain format, it will go through all given Python paths until it finds a module that actually defines the given format. This means that formats defined in packages farther up in the list will take precedence over the same formats in packages farther down.
ru: Когда Django ищет определенный формат, проверяются все указанные путя Python пока не будет найдет модуль, который содержит нужный формат.

source: Available formats are :setting:`DATE_FORMAT`, :setting:`TIME_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`YEAR_MONTH_FORMAT`, :setting:`MONTH_DAY_FORMAT`, :setting:`SHORT_DATE_FORMAT`, :setting:`SHORT_DATETIME_FORMAT`, :setting:`FIRST_DAY_OF_WEEK`, :setting:`DECIMAL_SEPARATOR`, :setting:`THOUSAND_SEPARATOR` and :setting:`NUMBER_GROUPING`.
ru: Доступные форматы: :setting:`DATE_FORMAT`, :setting:`TIME_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`YEAR_MONTH_FORMAT`, :setting:`MONTH_DAY_FORMAT`, :setting:`SHORT_DATE_FORMAT`, :setting:`SHORT_DATETIME_FORMAT`, :setting:`FIRST_DAY_OF_WEEK`, :setting:`DECIMAL_SEPARATOR`, :setting:`THOUSAND_SEPARATOR` и :setting:`NUMBER_GROUPING`.

source: Default: ``()``
ru: По умолчанию: ``()``

source: List of compiled regular expression objects describing URLs that should be ignored when reporting HTTP 404 errors via email (see :doc:`/howto/error-reporting`). Regular expressions are matched against :meth:`request's full paths <django.http.HttpRequest.get_full_path>` (including query string, if any). Use this if your site does not provide a commonly requested file such as ``favicon.ico`` or ``robots.txt``, or if it gets hammered by script kiddies.
ru: Список скомпилированных регулярных выражений, которые соответствуют URL-ам, для которых не должны отсылаться письма о 404 ошибках (смотрите :doc:`/howto/error-reporting`). Регулярное выражение проверяет :meth:`полный адрес запроса <django.http.HttpRequest.get_full_path>` с учетом всех GET аргументов. Вы можете использовать эту настройку если ваш проект не содержит обычно запрашиваемые файлы, такие как ``favicon.ico`` или ``robots.txt``, или если кто-то натравил на ваш сайт скрипт(*пер.* hammered by script kiddies).

source: This is only used if :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` is enabled (see :doc:`/topics/http/middleware`).
ru: Используется при включенном :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` (смотрите :doc:`/topics/http/middleware`).

source: A tuple of strings designating all applications that are enabled in this Django installation. Each string should be a dotted Python path to:
ru: Кортеж строк, который указывают не все приложения Django, используемые в проекте. Каждая строка должна быть полным Python путем к:

source: an application configuration class, or
ru: классу настройки приложения, или

source: a package containing a application.
ru: пакету с приложением.

source: :doc:`Learn more about application configurations </ref/applications>`.
ru: :doc:`Больше о настройке приложений </ref/applications>`.

source: :setting:`INSTALLED_APPS` now supports application configurations.
ru: :setting:`INSTALLED_APPS` теперь поддерживает конфигурации приложений.

source: Use the application registry for introspection
ru: Используйте реестр приложений

source: Your code should never access :setting:`INSTALLED_APPS` directly. Use :attr:`django.apps.apps` instead.
ru: Ваш код не должен использовать :setting:`INSTALLED_APPS`. Вместо этого используйте :attr:`django.apps.apps`.

source: Application names and labels must be unique in :setting:`INSTALLED_APPS`
ru: Названия приложения и метки(labels) должны быть уникальны в :setting:`INSTALLED_APPS`

source: Application :attr:`names <django.apps.AppConfig.name>` — the dotted Python path to the application package — must be unique. There is no way to include the same application twice, short of duplicating its code under another name.
ru: :attr:`Названия приложений <django.apps.AppConfig.name>` — Python путь к пакету приложения — должны быть уникальны. Нельзя подключить одно приложение дважды, разве что продублировав код с другим названием.

source: Application :attr:`labels <django.apps.AppConfig.label>` — by default the final part of the name — must be unique too. For example, you can't include both ``django.contrib.auth`` and ``myproject.auth``. However, you can relabel an application with a custom configuration that defines a different :attr:`~django.apps.AppConfig.label`.
ru: :attr:`Короткие названия приложения <django.apps.AppConfig.label>` — по умолчанию последняя часть названия приложения — должны быть так же уникальны. Например, можно использовать вместе ``django.contrib.auth`` и ``myproject.auth``. Однако, необходимо указать :attr:`~django.apps.AppConfig.label`.

source: These rules apply regardless of whether :setting:`INSTALLED_APPS` references application configuration classes on application packages.
ru: Эти правила распространяются на все приложения в :setting:`INSTALLED_APPS`, как на классы настройки приложений, так и на пакеты приложений.

source: When several applications provide different versions of the same resource (template, static file, management command, translation), the application listed first in :setting:`INSTALLED_APPS` has precedence.
ru: Если несколько приложений содержат разные версии одних и тех же ресурсов (шаблоны, статические файлы, команды, файлы перевода), будут использоваться ресурсы из приложения, которое указано выше в :setting:`INSTALLED_APPS`.

source: A tuple of IP addresses, as strings, that:
ru: Кортеж IP адресов, в виде строк, которые:

source: See debug comments, when :setting:`DEBUG` is ``True``
ru: Видят отладочную информацию, при :setting:`DEBUG` равном ``True``

source: Receive X headers in admindocs if the ``XViewMiddleware`` is installed (see :doc:`/ref/contrib/admin/admindocs`)
ru: Получают X заголовки в "admindocs" при использовании ``XViewMiddleware`` (смотрите :doc:`/ref/contrib/admin/admindocs`)

source: Default: ``'en-us'``
ru: По умолчанию: ``'en-us'``

source: A string representing the language code for this installation. This should be in standard :term:`language ID format <language code>`. For example, U.S. English is ``"en-us"``. See also the `list of language identifiers`_ and :doc:`/topics/i18n/index`.
ru: Код используемого в проекте языка. Должен соответствовать :term:`формату сокращений названий языков<language code>`. Например, U.S. English обозначается как ``"en-us"``. Смотрите `список кодов языков <http://www.i18nguy.com/unicode/language-identifiers.html>`_ и :doc:`/topics/i18n/index`.

source: :setting:`USE_I18N` must be active for this setting to have any effect.
ru: Необходимо включить для использования этой настройки :setting:`USE_I18N`.

source: It serves two purposes:
ru: Настройка используется в двух случаях:

source: If the locale middleware isn't in use, it decides which translation is served to all users.
ru: Если мидлвар для определения локали отключен, она указывает какой язык использовать для всех пользователей.

source: If the locale middleware is active, it provides a fallback language in case the user's preferred language can't be determined or is not supported by the Web site. It also provides the fallback translation when a translation for a given literal doesn't exist for the user's preferred language.
ru: При включенном мидлваре, указывает язык по умолчанию, если язык пользователя не может быть определен или не доступен в проекте. Также предоставляет перевод по умолчанию, если перевод текста на язык пользователя не был найден.

source: The fallback for translation literals was added.
ru: Был добавлен перевод по умолчанию, если перевод для текста не был найден.

source: See :ref:`how-django-discovers-language-preference` for more details.
ru: Подробности смотрите в :ref:`how-django-discovers-language-preference`.

source: Default: ``None`` (expires at browser close)
ru: По умолчанию: ``None`` (истекает при закрытии браузера)

source: The age of the language cookie, in seconds.
ru: Время хранения куки локализации в секундах.

source: The domain to use for the language cookie. Set this to a string such as ``".example.com"`` (note the leading dot!) for cross-domain cookies, or use ``None`` for a standard domain cookie.
ru: Домен, используемый для кук локализации. Используйте строку, например, ``".example.com"`` (обратите внимание на точку в начале!), для кросдоменних кук, или используйте ``None`` для стандартного домена.

source: Be cautious when updating this setting on a production site. If you update this setting to enable cross-domain cookies on a site that previously used standard domain cookies, existing user cookies that have the old domain will not be updated. This will result in site users being unable to switch the language as long as these cookies persist. The only safe and reliable option to perform the switch is to change the language cookie name permanently (via the :setting:`LANGUAGE_COOKIE_NAME` setting) and to add a middleware that copies the value from the old cookie to a new one and then deletes the old one.
ru: Осторожно меняйте эту настройку на боевом сайте. Если вы измените ее, чтобы разрешить кросс-доменные куки на сайте, старые куки будут использовать старое значение домена. Это приведет к тому, что пользователи не смогут сменить текущую локаль, пока куки не устареют. Единственный вариант -- поменять название куки(через настройку :setting:`LANGUAGE_COOKIE_NAME`) и добавить мидлвар, который скопирует значение старой куки в новую и удалит старую куку.
