Repository: djbook-ru/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/settings.po
Languages: ru

source: Your proxy strips the ``X-Forwarded-Proto`` header from all incoming requests. In other words, if end users include that header in their requests, the proxy will discard it.
ru: Прокси удаляет 'X-Forwarded-Proto' заголовок из приходящих запросов. Другими словами, пользователь не сможет подделать защищенный запрос указав заголовок.

source: Your proxy sets the ``X-Forwarded-Proto`` header and sends it to Django, but only for requests that originally come in via HTTPS.
ru: Прокси устанавливает заголовок 'X-Forwarded-Proto' и передает Django, но только для запросов через HTTPS.

source: If any of those are not true, you should keep this setting set to ``None`` and find another way of determining HTTPS, perhaps via custom middleware.
ru: Если одно из условий не соблюдено, установите значение настройки в ``None`` и найдите другой способ определить, используется ли HTTPS, возможно через функциональный слой(*пер.* middleware).

source: Default: ``[]``
ru: По умолчанию: ``[]``

source: If a URL path matches a regular expression in this list, the request will not be redirected to HTTPS. If :setting:`SECURE_SSL_REDIRECT` is ``False``, this setting has no effect.
ru: Если URL удовлетворяет регулярному выражению из этого списка, запрос не будет перенаправлен на HTTPS. Если :setting:`SECURE_SSL_REDIRECT` равна ``False``, эта настройка не имеет эффекта.

source: If a string (e.g. ``secure.example.com``), all SSL redirects will be directed to this host rather than the originally-requested host (e.g. ``www.example.com``). If :setting:`SECURE_SSL_REDIRECT` is ``False``, this setting has no effect.
ru: Если указать строку (например ``secure.example.com``), все SSL будут отправлены на указанный домен, а не запрошенный домен (например ``www.example.com``). Если :setting:`SECURE_SSL_REDIRECT` равна ``False``, эта настройка не имеет эффекта.

source: Default: ``False``.
ru: По умолчанию: ``False``.

source: If ``True``, the :class:`~django.middleware.security.SecurityMiddleware` :ref:`redirects <ssl-redirect>` all non-HTTPS requests to HTTPS (except for those URLs matching a regular expression listed in :setting:`SECURE_REDIRECT_EXEMPT`).
ru: При ``True`` :class:`~django.middleware.security.SecurityMiddleware` :ref:`перенаправляет <ssl-redirect>` все не-HTTPS запросы на HTTPS (кроме тех URL-ов, которые удовлетворяют регулярному выржению из :setting:`SECURE_REDIRECT_EXEMPT`).

source: If turning this to ``True`` causes infinite redirects, it probably means your site is running behind a proxy and can't tell which requests are secure and which are not. Your proxy likely sets a header to indicate secure requests; you can correct the problem by finding out what that header is and configuring the :setting:`SECURE_PROXY_SSL_HEADER` setting accordingly.
ru: Если при указании ``True`` происходит бесконечное перенаправление при запросе, возможно ваш сайт находится за прокси и не может определить защищен запрос или нет. Скорее всего прокси устанавливает заголовок, который указывает защищен ли запрос. Вы можете указать этот заголовок в настройке :setting:`SECURE_PROXY_SSL_HEADER`, что исправит проблему.

source: Default: Not defined.
ru: По умолчанию: Не определена.

source: A dictionary of modules containing serializer definitions (provided as strings), keyed by a string identifier for that serialization type. For example, to define a YAML serializer, use::
ru: Словарь, указывающий модули, реализующие различные форматы сериализации данных(*пер.* serializer) (строка с путем для импорта). Например, чтобы определить сериализатор для YAML формата, используйте::

source: Default: ``'root@localhost'``
ru: По умолчанию: ``'root@localhost'``

source: The email address that error messages come from, such as those sent to :setting:`ADMINS` and :setting:`MANAGERS`.
ru: Email-адрес, используемый в качестве адреса отправителя, для писем с ошибками, которые отсылаются на адреса, указание в :setting:`ADMINS` и :setting:`MANAGERS`.

source: Why are my emails sent from a different address?
ru: Почему мои письма отправляются с разных адресов?

source: This address is used only for error messages. It is *not* the address that regular email messages sent with :meth:`~django.core.mail.send_mail()` come from; for that, see :setting:`DEFAULT_FROM_EMAIL`.
ru: Этот адрес используется только для писем с ошибками. Этот адрес *не* не используется для отправки обычных писем через :meth:`~django.core.mail.send_mail()`. Для них используется значение :setting:`DEFAULT_FROM_EMAIL`.

source: Default: ``m/d/Y`` (e.g. ``12/31/2003``)
ru: По умолчанию: ``m/d/Y`` (например ``12/31/2003``)

source: An available formatting that can be used for displaying date fields on templates. Note that if :setting:`USE_L10N` is set to ``True``, then the corresponding locale-dictated format has higher precedence and will be applied. See :tfilter:`allowed date format strings <date>`.
ru: Формат, используемый при отображении даты в шаблоне. . Заметим, если :setting:`USE_L10N` равна ``True``, будет использоваться формат даты текущей локали, если он указан в файлах локализации. Формат значения смотрите в :tfilter:`описании фильтра date <date>`.

source: See also :setting:`DATE_FORMAT` and :setting:`SHORT_DATETIME_FORMAT`.
ru: Смотрите :setting:`DATE_FORMAT` и :setting:`SHORT_DATETIME_FORMAT`.

source: Default: ``m/d/Y P`` (e.g. ``12/31/2003 4 p.m.``)
ru: По умолчанию: ``m/d/Y P`` (например ``12/31/2003 4 p.m.``)

source: An available formatting that can be used for displaying datetime fields on templates. Note that if :setting:`USE_L10N` is set to ``True``, then the corresponding locale-dictated format has higher precedence and will be applied. See :tfilter:`allowed date format strings <date>`.
ru: Формат, используемый при отображении даты-времени в шаблоне. . Заметим, если :setting:`USE_L10N` равна ``True``, будет использоваться формат даты текущей локали, если он указан в файлах локализации. Формат значения смотрите в :tfilter:`описании фильтра date <date>`.

source: See also :setting:`DATE_FORMAT` and :setting:`SHORT_DATE_FORMAT`.
ru: Смотрите также :setting:`DATE_FORMAT` и :setting:`SHORT_DATE_FORMAT`.

source: Default: ``'django.core.signing.TimestampSigner'``
ru: По умолчанию: ``'django.core.signing.TimestampSigner'``

source: The backend used for signing cookies and other data.
ru: Бэкенд, используемый для подписанных кук и других данных.

source: See also the :doc:`/topics/signing` documentation.
ru: Смотрите :doc:`/topics/signing`.

source: A list of identifiers of messages generated by the system check framework (i.e. ``["models.W001"]``) that you wish to permanently acknowledge and ignore. Silenced warnings will no longer be output to the console; silenced errors will still be printed, but will not prevent management commands from running.
ru: Список кодов сообщений, генерируемые приложением проверки проекта (например, ``["models.W001"]``), которые вы хотите проигнорировать. Игнорируемые приложения не будут выводится в консоль. Игнорируемые ошибки будут выводится, но команды Django все равно будут запускаться.

source: See also the :doc:`/ref/checks` documentation.
ru: Смотрите :doc:`/ref/checks`.

source: Default:: ``[]`` (Empty list)
ru: По умолчанию: ``[]`` (Пустой список)

source: A list containing the settings for all template engines to be used with Django. Each item of the list is a dictionary containing the options for an individual engine.
ru: Список настроек для шаблонизаторов, которые используются Django. Каждый элемент -- это словарь с параметрами настройки шаблонизатора.

source: Here's a simple setup that tells the Django template engine to load templates from the ``templates`` subdirectories inside installed applications::
ru: Вот небольшой пример как указать Django загружать шаблоны из каталогов ``templates``, которые находятся в установленных приложениях::

source: The following options are available for all backends.
ru: Следующие опции доступны для всех бэкендов.

source: Default: not defined
ru: По умолчанию: Не определена

source: The template backend to use. The built-in template backends are:
ru: Бэкенд шаблонизатора, который используется. Django предоставляет следующие бэкенды:

source: You can use a template backend that doesn't ship with Django by setting ``BACKEND`` to a fully-qualified path (i.e. ``'mypackage.whatever.Backend'``).
ru: Вы можете использовать сторонние бэкэнды указав в ``BACKEND`` путь для импорта (например, ``mypackage.whatever.Backend``).

source: Default: see below
ru: По умолчанию: смотрите ниже

source: The alias for this particular template engine. It's an identifier that allows selecting an engine for rendering. Aliases must be unique across all configured template engines.
ru: Название для текущей конфигурации шаблонизатора. Позволяет явно указывать бэкенд для рендеринга шаблона. Должны быть уникальными.

source: It defaults to the name of the module defining the engine class, i.e. the next to last piece of :setting:`BACKEND <TEMPLATES-BACKEND>`, when it isn't provided. For example if the backend is ``'mypackage.whatever.Backend'`` then its default name is ``'whatever'``.
ru: По умолчанию настройка равна названию модуля с классом бэкенда, то есть предпоследний элемент :setting:`BACKEND <TEMPLATES-BACKEND>`. Например для ``'mypackage.whatever.Backend'`` название будет ``'whatever'``.

source: Directories where the engine should look for template source files, in search order.
ru: Каталоги, в которых бэкенд должен искать шаблоны в порядке приоритета.

source: Default:: ``False``
ru: По умолчанию: ``False``

source: Whether the engine should look for template source files inside installed applications.
ru: Должен ли шаблонизатор искать файлы шаблонов в приложениях.

source: Default:: ``{}`` (Empty dict)
ru: По умолчанию: ``{}`` (Пустой словарь)

source: Extra parameters to pass to the template backend. Available parameters vary depending on the template backend.
ru: Дополнительные параметры для бэкенда шаблонизатора. Доступные параметры зависят от используемого бэкенда.

source: Set the ``'context_processors'`` option in the :setting:`OPTIONS <TEMPLATES-OPTIONS>` of a ``DjangoTemplates`` backend instead.
ru: Смотрите опцию ``'context_processors'`` из настройки :setting:`OPTIONS <TEMPLATES-OPTIONS>` для бэкенда ``DjangoTemplates``.

source: A tuple of callables that are used to populate the context in ``RequestContext``. These callables take a request object as their argument and return a dictionary of items to be merged into the context.
ru: Кортеж из функций, которые используются для добавления переменных в ``RequestContext``. Функция принимает объект запроса и возвращает словарь с данными, которые будут добавлены в контекст.

source: Built-in template context processors were moved from ``django.core.context_processors`` to ``django.template.context_processors`` in Django 1.8.
ru: Встроенные процессоры контекста были перенесены из ``django.core.context_processors`` в ``django.template.context_processors`` в Django 1.8.

source: Set the ``'debug'`` option in the :setting:`OPTIONS <TEMPLATES-OPTIONS>` of a ``DjangoTemplates`` backend instead.
ru: Смотрите опцию ``'debug'`` из настройки :setting:`OPTIONS <TEMPLATES-OPTIONS>` для бэкенда ``DjangoTemplates``.

source: A boolean that turns on/off template debug mode. If this is ``True``, the fancy error page will display a detailed report for any exception raised during template rendering. This report contains the relevant snippet of the template, with the appropriate line highlighted.
ru: Включает/выключает режим отладки в шаблонах. При ``True``, для ошибок, возникших при выполнении шаблона, будет показана страница с отладочной информацией.

source: Note that Django only displays fancy error pages if :setting:`DEBUG` is ``True``, so you'll want to set that to take advantage of this setting.
ru: Заметим что Django отображает страницу с ошибкой только при :setting:`DEBUG` равном ``True``, вы можете безопасно использовать эту настройку.

source: See also :setting:`DEBUG`.
ru: Смотрите :setting:`DEBUG`.

source: Set the :setting:`DIRS <TEMPLATES-DIRS>` option of a ``DjangoTemplates`` backend instead.
ru: Смотрите опцию :setting:`DIRS <TEMPLATES-DIRS>` для ``DjangoTemplates``.

source: List of locations of the template source files searched by :class:`django.template.loaders.filesystem.Loader`, in search order.
ru: Список каталогов, в которых будут искаться файлы шаблонов при вызове :class:`django.template.loaders.filesystem.Loader` в указанном порядке.

source: See :doc:`/ref/templates/language`.
ru: Смотрите :doc:`/ref/templates/language`.

source: Set the ``'loaders'`` option in the :setting:`OPTIONS <TEMPLATES-OPTIONS>` of a ``DjangoTemplates`` backend instead.
ru: Смотрите опцию ``'loaders'`` из настройки :setting:`OPTIONS <TEMPLATES-OPTIONS>` для бэкенда ``DjangoTemplates``.

source: A tuple of template loader classes, specified as strings. Each ``Loader`` class knows how to import templates from a particular source. Optionally, a tuple can be used instead of a string. The first item in the tuple should be the ``Loader``’s module, subsequent items are passed to the ``Loader`` during initialization. See :doc:`/ref/templates/api`.
ru: Кортеж из классов-загрузчиков шаблонов, указанных путями для импорта. Каждый класс ``Loader`` знает как загрузить шаблоны из определенного источника. Вместо строки может использовать кортеж. Первым элементом должен быть модуль ``Loader``-а, последующие элементы будут переданы при инициализации объекта ``Loader``. Смотрите :doc:`/ref/templates/api`.

source: Set the ``'string_if_invalid'`` option in the :setting:`OPTIONS <TEMPLATES-OPTIONS>` of a ``DjangoTemplates`` backend instead.
ru: Смотрите опцию ``'string_if_invalid'`` из настройки :setting:`OPTIONS <TEMPLATES-OPTIONS>` для бэкенда ``DjangoTemplates``.

source: Output, as a string, that the template system should use for invalid (e.g. misspelled) variables. See :ref:`invalid-template-variables`.
ru: Строка, которая выводится в шаблоне для неверных переменных (например, отсутствующих в контексте). Смотрите :ref:`invalid-template-variables`.

source: Default: ``'django.test.runner.DiscoverRunner'``
ru: По умолчанию: ``'django.test.runner.DiscoverRunner'``

source: The name of the class to use for starting the test suite. See :ref:`other-testing-frameworks`.
ru: Название класса, используемого для запуска тестирования. Смотрите :ref:`other-testing-frameworks`.

source: In order to restore the database state between tests for ``TransactionTestCase``\s and database backends without transactions, Django will :ref:`serialize the contents of all apps with migrations <test-case-serialized-rollback>` when it starts the test run so it can then reload from that copy before tests that need it.
ru: Для восстановления состояния базы данных между тестами при использовании ``TransactionTestCase`` и бекендов без поддержки транзакций, Django :ref:`сериализирует содержимое всех приложений с миграциями <test-case-serialized-rollback>` перед запуском тестов, чтобы потом восстановить состояние перед новым тестом.

source: This slows down the startup time of the test runner; if you have apps that you know don't need this feature, you can add their full names in here (e.g. ``'django.contrib.contenttypes'``) to exclude them from this serialization process.
ru: Это замедляет запуск тестов. Если у вас есть приложения, которые не требуют такого поведения, вы можете добавить из полное название в эту настройку (например, ``'django.contrib.contenttypes'``), чтобы исключить из процесса сериализации.

source: Default: ``,`` (Comma)
ru: По умолчанию: ``,`` (Comma)

source: Default thousand separator used when formatting numbers. This setting is used only when :setting:`USE_THOUSAND_SEPARATOR` is ``True`` and :setting:`NUMBER_GROUPING` is greater than ``0``.
ru: Тысячный разделитель, используемый при форматировании чисел. Используется только при :setting:`USE_THOUSAND_SEPARATOR` равном ``True``, и если :setting:`NUMBER_GROUPING` больше чем ``0``.

source: See also :setting:`NUMBER_GROUPING`, :setting:`DECIMAL_SEPARATOR` and :setting:`USE_THOUSAND_SEPARATOR`.
ru: Смотрите :setting:`NUMBER_GROUPING`, :setting:`DECIMAL_SEPARATOR` и :setting:`USE_THOUSAND_SEPARATOR`.

source: Default: ``'P'`` (e.g. ``4 p.m.``)
ru: По умолчанию: ``'P'`` (например, ``4 p.m.``)

source: The default formatting to use for displaying time fields in any part of the system. Note that if :setting:`USE_L10N` is set to ``True``, then the locale-dictated format has higher precedence and will be applied instead. See :tfilter:`allowed date format strings <date>`.
ru: Формат по умолчанию для отображение значений полей времени в любой части системы. Заметим, если :setting:`USE_L10N` равна ``True``, будет использоваться формат даты текущей локали, если он указан в файлах локализации. Формат значения смотрите в :tfilter:`описании фильтра date <date>`.

source: See also :setting:`DATE_FORMAT` and :setting:`DATETIME_FORMAT`.
ru: Смотрите :setting:`DATE_FORMAT` и :setting:`DATETIME_FORMAT`.

source: A tuple of formats that will be accepted when inputting data on a time field. Formats will be tried in order, using the first valid one. Note that these format strings use Python's datetime_ module syntax, not the format strings from the ``date`` Django template tag.
ru: Кортеж содержащий форматы времени, которые будут приниматься при вводе значения в поле времени. Форматы будут проверяться по порядку, будет использован первый подходящий. Заметим что используется синтаксис модуля Python datetime_, не формат строки для шаблонного тега ``date``.

source: See also :setting:`DATE_INPUT_FORMATS` and :setting:`DATETIME_INPUT_FORMATS`.
ru: Смотрите :setting:`DATE_INPUT_FORMATS` и :setting:`DATETIME_INPUT_FORMATS`.

source: Default: ``'America/Chicago'``
ru: По умолчанию: ``'America/Chicago'``

source: A string representing the time zone for this installation, or ``None``. See the `list of time zones`_.
ru: Часовой пояс, который будет использоваться в проекте, или ``None``. Смотрите `список часовых поясов <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`_.

source: Since Django was first released with the :setting:`TIME_ZONE` set to ``'America/Chicago'``, the global setting (used if nothing is defined in your project's ``settings.py``) remains ``'America/Chicago'`` for backwards compatibility. New project templates default to ``'UTC'``.
ru: При первом релизе :setting:`TIME_ZONE` по умолчанию была ``'America/Chicago'``, глобальные настройки (которые используется, если ``settings.py`` не содержит настройки) содержат значение ``'America/Chicago'`` для обратной совместимости. Шаблон нового проекта содержит значение ``'UTC'``.

source: Note that this isn't necessarily the time zone of the server. For example, one server may serve multiple Django-powered sites, each with a separate time zone setting.
ru: Заметим, что указанный часовой пояс не обязан совпадать с часовым поясом сервера. Например, один сервер может обслуживать несколько Django-проектов, каждый может использовать свой часовой пояс.

source: When :setting:`USE_TZ` is ``False``, this is the time zone in which Django will store all datetimes. When :setting:`USE_TZ` is ``True``, this is the default time zone that Django will use to display datetimes in templates and to interpret datetimes entered in forms.
ru: Если :setting:`USE_TZ` равна ``False``, Django будет использовать указанный часовой пояс при сохранении времени. При :setting:`USE_TZ` равной ``True``, указанный часовой пояс будет использоваться по умолчанию при отображении даты в шаблоне и при интерпретации введенных через форму значений.

source: Django sets the ``os.environ['TZ']`` variable to the time zone you specify in the :setting:`TIME_ZONE` setting. Thus, all your views and models will automatically operate in this time zone. However, Django won't set the ``TZ`` environment variable under the following conditions:
ru: Django устанавливает переменной ``os.environ['TZ']`` значение, указанное в настройке :setting:`TIME_ZONE`. Таким образом все ваши представления и модели будут использовать один и тот же часовой пояс. Однако, Django не установит значение переменной окружения ``TZ`` при следующих обстоятельствах:

source: If you're using the manual configuration option as described in :ref:`manually configuring settings <settings-without-django-settings-module>`, or
ru: При ручной конфигурации настроек как описано в :ref:`соответствующем разделе <settings-without-django-settings-module>`, или

source: If you specify ``TIME_ZONE = None``. This will cause Django to fall back to using the system timezone. However, this is discouraged when :setting:`USE_TZ = True <USE_TZ>`, because it makes conversions between local time and UTC less reliable.
ru: Если указать ``TIME_ZONE = None``, Django будет использовать системную временную зону. Но при :setting:`USE_TZ = True <USE_TZ>` конвертация локального времени в UTC будет не такая однозначная.

source: If Django doesn't set the ``TZ`` environment variable, it's up to you to ensure your processes are running in the correct environment.
ru: Если Django не определяет переменную окружения ``TZ``, необходимо самостоятельно убедиться, что ваш код выполняется в правильном окружении.

source: Django cannot reliably use alternate time zones in a Windows environment. If you're running Django on Windows, :setting:`TIME_ZONE` must be set to match the system time zone.
ru: Django не может обеспечить надежное использование различных временных зон для Windows. При использовании Windows :setting:`TIME_ZONE` должна быть равна системному часовому поясу.

source: A boolean that specifies whether to output the "Etag" header. This saves bandwidth but slows down performance. This is used by the ``CommonMiddleware`` (see :doc:`/topics/http/middleware`) and in the``Cache Framework`` (see :doc:`/topics/cache`).
ru: Указывает, использовать ли заголовок "Etag". Улучшает пропускную способность сервера, но уменьшает производительность. Используется ``CommonMiddleware`` (смотрите :doc:`/topics/http/middleware`) и``Cache Framework`` (смотрите :doc:`/topics/cache`).

source: A boolean that specifies whether Django's translation system should be enabled. This provides an easy way to turn it off, for performance. If this is set to ``False``, Django will make some optimizations so as not to load the translation machinery.
ru: Указывает, используется ли механизм перевода Django. Позволяет легко отключить его для повышения производительности. При ``False``, Django выполнит небольшую оптимизацию чтобы не загружать механизм перевода.

source: See also :setting:`LANGUAGE_CODE`, :setting:`USE_L10N` and :setting:`USE_TZ`.
ru: Смотрите :setting:`LANGUAGE_CODE`, :setting:`USE_L10N` и :setting:`USE_TZ`.

source: A boolean that specifies if localized formatting of data will be enabled by default or not. If this is set to ``True``, e.g. Django will display numbers and dates using the format of the current locale.
ru: Указывает, использовать ли локализованный формат даты. При ``True``, например, Django будет отображать числа и даты в формате текущей локали.

source: See also :setting:`LANGUAGE_CODE`, :setting:`USE_I18N` and :setting:`USE_TZ`.
ru: Смотрите :setting:`LANGUAGE_CODE`, :setting:`USE_I18N` и :setting:`USE_TZ`.

source: The default :file:`settings.py` file created by :djadmin:`django-admin startproject <startproject>` includes ``USE_L10N = True`` for convenience.
ru: По умолчанию файл :file:`settings.py`, созданный :djadmin:`django-admin startproject <startproject>`, содержит ``USE_L10N = True``.
